#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityModeSetSelectionModal

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityModeSetSelectionModal.ActivityModeSetSelectionModal_C
// 0x0080 (0x0498 - 0x0418)
class UActivityModeSetSelectionModal_C final : public UFortActivityModeSetSelectionModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlidePannel;                                       // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnImageLoaded;                                     // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UActivityHabaneroButton_C*              Button_Activity_Habanero;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayDim;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_BackButton;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Habanero;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_ActivitySettings;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ThumbnailParameter;                                // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ThumbnailOpacityParameter;                         // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CloseDelay;                                        // 0x0480(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CloseDelayTimer;                                   // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPanelVisible;                                   // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__ActivityModeSetSelectionModal_ActivityPrivacyButton_K2Node_ComponentBoundEvent_4_OnPrivacyAvailableChanged__DelegateSignature(bool IsAvailable);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CloseModal();
	void ExecuteUbergraph_ActivityModeSetSelectionModal(int32 EntryPoint);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSubModeSelected();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityModeSetSelectionModal_C">();
	}
	static class UActivityModeSetSelectionModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityModeSetSelectionModal_C>();
	}
};
static_assert(alignof(UActivityModeSetSelectionModal_C) == 0x000008, "Wrong alignment on UActivityModeSetSelectionModal_C");
static_assert(sizeof(UActivityModeSetSelectionModal_C) == 0x000498, "Wrong size on UActivityModeSetSelectionModal_C");
static_assert(offsetof(UActivityModeSetSelectionModal_C, UberGraphFrame) == 0x000418, "Member 'UActivityModeSetSelectionModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SlidePannel) == 0x000420, "Member 'UActivityModeSetSelectionModal_C::SlidePannel' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, OnImageLoaded) == 0x000428, "Member 'UActivityModeSetSelectionModal_C::OnImageLoaded' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Button_Activity_Habanero) == 0x000430, "Member 'UActivityModeSetSelectionModal_C::Button_Activity_Habanero' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Image_Background) == 0x000438, "Member 'UActivityModeSetSelectionModal_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Overlay_1) == 0x000440, "Member 'UActivityModeSetSelectionModal_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, OverlayDim) == 0x000448, "Member 'UActivityModeSetSelectionModal_C::OverlayDim' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SafeZone) == 0x000450, "Member 'UActivityModeSetSelectionModal_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SafeZone_BackButton) == 0x000458, "Member 'UActivityModeSetSelectionModal_C::SafeZone_BackButton' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, SizeBox_Habanero) == 0x000460, "Member 'UActivityModeSetSelectionModal_C::SizeBox_Habanero' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Switcher_ActivitySettings) == 0x000468, "Member 'UActivityModeSetSelectionModal_C::Switcher_ActivitySettings' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, Thumbnail) == 0x000470, "Member 'UActivityModeSetSelectionModal_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, ThumbnailParameter) == 0x000478, "Member 'UActivityModeSetSelectionModal_C::ThumbnailParameter' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, ThumbnailOpacityParameter) == 0x00047C, "Member 'UActivityModeSetSelectionModal_C::ThumbnailOpacityParameter' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, CloseDelay) == 0x000480, "Member 'UActivityModeSetSelectionModal_C::CloseDelay' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, CloseDelayTimer) == 0x000488, "Member 'UActivityModeSetSelectionModal_C::CloseDelayTimer' has a wrong offset!");
static_assert(offsetof(UActivityModeSetSelectionModal_C, bIsPanelVisible) == 0x000490, "Member 'UActivityModeSetSelectionModal_C::bIsPanelVisible' has a wrong offset!");

}

