#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivitySquadFillButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivitySquadFillButton.ActivitySquadFillButton_C.ExecuteUbergraph_ActivitySquadFillButton
// 0x0088 (0x0088 - 0x0000)
struct ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0078(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAvailable;                         // 0x0079(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFillOnlyEnabled;                   // 0x007B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton) == 0x000008, "Wrong alignment on ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton");
static_assert(sizeof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton) == 0x000088, "Wrong size on ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, EntryPoint) == 0x000000, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, Temp_bool_Variable) == 0x000004, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, Temp_bool_Variable_1) == 0x000005, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, Temp_bool_Variable_2) == 0x000006, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000020, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000028, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000038, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000040, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_DynamicCast_AsSound_Base) == 0x000050, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000060, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_IsUsingGamepad_ReturnValue) == 0x000068, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000070, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_Event_bIsSelected) == 0x000078, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_Event_bIsAvailable) == 0x000079, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_Event_bIsAvailable' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_Event_IsDesignTime) == 0x00007A, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_Event_bIsFillOnlyEnabled) == 0x00007B, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_Event_bIsFillOnlyEnabled' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, K2Node_Select_Default) == 0x00007C, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton, CallFunc_SelectInt_ReturnValue) == 0x000080, "Member 'ActivitySquadFillButton_C_ExecuteUbergraph_ActivitySquadFillButton::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function ActivitySquadFillButton.ActivitySquadFillButton_C.OnDesiredSquadFillSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged) == 0x000001, "Wrong alignment on ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged");
static_assert(sizeof(ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged) == 0x000001, "Wrong size on ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged");
static_assert(offsetof(ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged, bIsSelected) == 0x000000, "Member 'ActivitySquadFillButton_C_OnDesiredSquadFillSelectionChanged::bIsSelected' has a wrong offset!");

// Function ActivitySquadFillButton.ActivitySquadFillButton_C.OnSquadFillAvailabilityChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged final
{
public:
	bool                                          bIsAvailable;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged) == 0x000001, "Wrong alignment on ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged");
static_assert(sizeof(ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged) == 0x000001, "Wrong size on ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged");
static_assert(offsetof(ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged, bIsAvailable) == 0x000000, "Member 'ActivitySquadFillButton_C_OnSquadFillAvailabilityChanged::bIsAvailable' has a wrong offset!");

// Function ActivitySquadFillButton.ActivitySquadFillButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivitySquadFillButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivitySquadFillButton_C_PreConstruct) == 0x000001, "Wrong alignment on ActivitySquadFillButton_C_PreConstruct");
static_assert(sizeof(ActivitySquadFillButton_C_PreConstruct) == 0x000001, "Wrong size on ActivitySquadFillButton_C_PreConstruct");
static_assert(offsetof(ActivitySquadFillButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivitySquadFillButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivitySquadFillButton.ActivitySquadFillButton_C.ToggleFillOnlyVisibility
// 0x0001 (0x0001 - 0x0000)
struct ActivitySquadFillButton_C_ToggleFillOnlyVisibility final
{
public:
	bool                                          bIsFillOnlyEnabled;                                // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActivitySquadFillButton_C_ToggleFillOnlyVisibility) == 0x000001, "Wrong alignment on ActivitySquadFillButton_C_ToggleFillOnlyVisibility");
static_assert(sizeof(ActivitySquadFillButton_C_ToggleFillOnlyVisibility) == 0x000001, "Wrong size on ActivitySquadFillButton_C_ToggleFillOnlyVisibility");
static_assert(offsetof(ActivitySquadFillButton_C_ToggleFillOnlyVisibility, bIsFillOnlyEnabled) == 0x000000, "Member 'ActivitySquadFillButton_C_ToggleFillOnlyVisibility::bIsFillOnlyEnabled' has a wrong offset!");

}

