#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirJellyfishRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class AirJellyfishRuntime.FortAirJellyfishAnimInstance
// 0x0020 (0x0550 - 0x0530)
class UFortAirJellyfishAnimInstance final : public UFortAnimInstance
{
public:
	float                                         RotatorLerpRate;                                   // 0x0530(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityDirectionScalar;                           // 0x0534(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RootRotation;                                      // 0x0538(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAirJellyfishAnimInstance">();
	}
	static class UFortAirJellyfishAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAirJellyfishAnimInstance>();
	}
};
static_assert(alignof(UFortAirJellyfishAnimInstance) == 0x000010, "Wrong alignment on UFortAirJellyfishAnimInstance");
static_assert(sizeof(UFortAirJellyfishAnimInstance) == 0x000550, "Wrong size on UFortAirJellyfishAnimInstance");
static_assert(offsetof(UFortAirJellyfishAnimInstance, RotatorLerpRate) == 0x000530, "Member 'UFortAirJellyfishAnimInstance::RotatorLerpRate' has a wrong offset!");
static_assert(offsetof(UFortAirJellyfishAnimInstance, VelocityDirectionScalar) == 0x000534, "Member 'UFortAirJellyfishAnimInstance::VelocityDirectionScalar' has a wrong offset!");
static_assert(offsetof(UFortAirJellyfishAnimInstance, RootRotation) == 0x000538, "Member 'UFortAirJellyfishAnimInstance::RootRotation' has a wrong offset!");

}

