#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_GrindRailLand

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_GrindRailLand.AnimNotify_GrindRailLand_C.Received_Notify
// 0x0060 (0x0060 - 0x0000)
struct AnimNotify_GrindRailLand_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GrindingComponent_C*                GrindingComponent;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GrindingComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_GrindRailLand_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_GrindRailLand_C_Received_Notify");
static_assert(sizeof(AnimNotify_GrindRailLand_C_Received_Notify) == 0x000060, "Wrong size on AnimNotify_GrindRailLand_C_Received_Notify");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, EventReference) == 0x000010, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, ReturnValue) == 0x000038, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, GrindingComponent) == 0x000040, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::GrindingComponent' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_GrindRailLand_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'AnimNotify_GrindRailLand_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

