#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnnualRefundTokenUI

#include "Basic.hpp"

#include "AnnualRefundTokenUI_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class AnnualRefundTokenUI.FortAnnualRefundTicket
// 0x0008 (0x0270 - 0x0268)
class UFortAnnualRefundTicket final : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_AvailableDate;                                // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPlayLockingAnimation();
	void OnUpdateAvailableState(const bool bIsAvailable);
	void OnUpdatePendingState(const bool bIsPending);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTicket">();
	}
	static class UFortAnnualRefundTicket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTicket>();
	}
};
static_assert(alignof(UFortAnnualRefundTicket) == 0x000008, "Wrong alignment on UFortAnnualRefundTicket");
static_assert(sizeof(UFortAnnualRefundTicket) == 0x000270, "Wrong size on UFortAnnualRefundTicket");
static_assert(offsetof(UFortAnnualRefundTicket, Text_AvailableDate) == 0x000268, "Member 'UFortAnnualRefundTicket::Text_AvailableDate' has a wrong offset!");

// Class AnnualRefundTokenUI.FortAnnualRefundTokenData
// 0x0028 (0x0548 - 0x0520)
class UFortAnnualRefundTokenData final : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   PurchaseHistoryScreenClass;                        // 0x0520(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTokenData">();
	}
	static class UFortAnnualRefundTokenData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTokenData>();
	}
};
static_assert(alignof(UFortAnnualRefundTokenData) == 0x000008, "Wrong alignment on UFortAnnualRefundTokenData");
static_assert(sizeof(UFortAnnualRefundTokenData) == 0x000548, "Wrong size on UFortAnnualRefundTokenData");
static_assert(offsetof(UFortAnnualRefundTokenData, PurchaseHistoryScreenClass) == 0x000520, "Member 'UFortAnnualRefundTokenData::PurchaseHistoryScreenClass' has a wrong offset!");

// Class AnnualRefundTokenUI.FortPurchaseHistoryEntry
// 0x0030 (0x14B0 - 0x1480)
class UFortPurchaseHistoryEntry final : public UFortHoldableButton
{
public:
	uint8                                         Pad_1478[0x8];                                     // 0x1478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCosmeticItemCard>      ItemCardClass;                                     // 0x1480(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CardWidthOverride;                                 // 0x1488(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148C[0x4];                                     // 0x148C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Name;                                         // 0x1490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         LootEntryItemTypesToExclude;                       // 0x1498(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14A8[0x8];                                     // 0x14A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetHistory(bool bHasBeenRefunded, bool bIsTokenlessRefund, bool bPlayerHasTokens, bool bNonRefundable);
	void SetPurchaseText(const class FText& PurchaseDateText, const class FText& RefundDateText, bool bHasBeenRefunded, const EFortPurchaseHistoryRefundType RefundType);
	void SetupItemCard(const class UFortCosmeticItemCard* ItemCard, const class UFortItem* Item);
	void UpdateItemList(const TArray<class UFortCosmeticItemCard*>& ItemCards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryEntry">();
	}
	static class UFortPurchaseHistoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryEntry>();
	}
};
static_assert(alignof(UFortPurchaseHistoryEntry) == 0x000010, "Wrong alignment on UFortPurchaseHistoryEntry");
static_assert(sizeof(UFortPurchaseHistoryEntry) == 0x0014B0, "Wrong size on UFortPurchaseHistoryEntry");
static_assert(offsetof(UFortPurchaseHistoryEntry, ItemCardClass) == 0x001480, "Member 'UFortPurchaseHistoryEntry::ItemCardClass' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryEntry, CardWidthOverride) == 0x001488, "Member 'UFortPurchaseHistoryEntry::CardWidthOverride' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryEntry, Text_Name) == 0x001490, "Member 'UFortPurchaseHistoryEntry::Text_Name' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryEntry, LootEntryItemTypesToExclude) == 0x001498, "Member 'UFortPurchaseHistoryEntry::LootEntryItemTypesToExclude' has a wrong offset!");

// Class AnnualRefundTokenUI.FortPurchaseHistoryListView
// 0x0110 (0x0370 - 0x0260)
class UFortPurchaseHistoryListView final : public UListViewBase
{
public:
	uint8                                         Pad_260[0x110];                                    // 0x0260(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryListView">();
	}
	static class UFortPurchaseHistoryListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryListView>();
	}
};
static_assert(alignof(UFortPurchaseHistoryListView) == 0x000008, "Wrong alignment on UFortPurchaseHistoryListView");
static_assert(sizeof(UFortPurchaseHistoryListView) == 0x000370, "Wrong size on UFortPurchaseHistoryListView");

// Class AnnualRefundTokenUI.FortPurchaseHistoryScreen
// 0x00F8 (0x0610 - 0x0518)
class UFortPurchaseHistoryScreen final : public UFortActivatablePanel
{
public:
	struct FDataTableRowHandle                    BackAction;                                        // 0x0518(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_528[0x18];                                     // 0x0528(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   RefundConfirmationClass;                           // 0x0540(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DirectPurchaseInfoModalClass;                      // 0x0568(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_MainContent;                              // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPurchaseHistoryListView*           ListView_Purchases;                                // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PostApproval;                               // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Desc;                                         // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultHeader;                                 // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultTitle;                                  // 0x05C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultDesc;                                   // 0x05D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x05D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_CancelPurchaseInfo;                         // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_ReturnTicketInfo;                           // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_TokenlessRefundInfo;                        // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_NonRefundableInfo;                          // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool BP_IsShowingPurchases();
	void OnBeginRefundSubmission();
	void OnEndRefundSubmission();
	void OnNoPurchasesAvailable();
	void OnPopulateView();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryScreen">();
	}
	static class UFortPurchaseHistoryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryScreen>();
	}
};
static_assert(alignof(UFortPurchaseHistoryScreen) == 0x000008, "Wrong alignment on UFortPurchaseHistoryScreen");
static_assert(sizeof(UFortPurchaseHistoryScreen) == 0x000610, "Wrong size on UFortPurchaseHistoryScreen");
static_assert(offsetof(UFortPurchaseHistoryScreen, BackAction) == 0x000518, "Member 'UFortPurchaseHistoryScreen::BackAction' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundConfirmationClass) == 0x000540, "Member 'UFortPurchaseHistoryScreen::RefundConfirmationClass' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, DirectPurchaseInfoModalClass) == 0x000568, "Member 'UFortPurchaseHistoryScreen::DirectPurchaseInfoModalClass' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Switcher_MainContent) == 0x000590, "Member 'UFortPurchaseHistoryScreen::Switcher_MainContent' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, ListView_Purchases) == 0x000598, "Member 'UFortPurchaseHistoryScreen::ListView_Purchases' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Button_CloseMobile) == 0x0005A0, "Member 'UFortPurchaseHistoryScreen::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Button_PostApproval) == 0x0005A8, "Member 'UFortPurchaseHistoryScreen::Button_PostApproval' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_Desc) == 0x0005B0, "Member 'UFortPurchaseHistoryScreen::Text_Desc' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_RefundCount) == 0x0005B8, "Member 'UFortPurchaseHistoryScreen::Text_RefundCount' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_ResultHeader) == 0x0005C0, "Member 'UFortPurchaseHistoryScreen::Text_ResultHeader' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_ResultTitle) == 0x0005C8, "Member 'UFortPurchaseHistoryScreen::Text_ResultTitle' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Text_ResultDesc) == 0x0005D0, "Member 'UFortPurchaseHistoryScreen::Text_ResultDesc' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundTicket_Left) == 0x0005D8, "Member 'UFortPurchaseHistoryScreen::RefundTicket_Left' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundTicket_Center) == 0x0005E0, "Member 'UFortPurchaseHistoryScreen::RefundTicket_Center' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, RefundTicket_Right) == 0x0005E8, "Member 'UFortPurchaseHistoryScreen::RefundTicket_Right' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Widget_CancelPurchaseInfo) == 0x0005F0, "Member 'UFortPurchaseHistoryScreen::Widget_CancelPurchaseInfo' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Widget_ReturnTicketInfo) == 0x0005F8, "Member 'UFortPurchaseHistoryScreen::Widget_ReturnTicketInfo' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Widget_TokenlessRefundInfo) == 0x000600, "Member 'UFortPurchaseHistoryScreen::Widget_TokenlessRefundInfo' has a wrong offset!");
static_assert(offsetof(UFortPurchaseHistoryScreen, Widget_NonRefundableInfo) == 0x000608, "Member 'UFortPurchaseHistoryScreen::Widget_NonRefundableInfo' has a wrong offset!");

// Class AnnualRefundTokenUI.FortRefundConfirmation
// 0x0058 (0x0570 - 0x0518)
class UFortRefundConfirmation final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_518[0x10];                                     // 0x0518(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_RefundsRemaining;                             // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AreYouSure;                                   // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Yes;                                        // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_No;                                         // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x0558(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x0560(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x0568(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_UpdateItemsList(const TArray<class UFortItemDefinition*>& SelectedItemDefs, const int32 TotalMtxPaid);
	void BP_UpdateRefundType(const EFortPurchaseHistoryRefundType RefundType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRefundConfirmation">();
	}
	static class UFortRefundConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRefundConfirmation>();
	}
};
static_assert(alignof(UFortRefundConfirmation) == 0x000008, "Wrong alignment on UFortRefundConfirmation");
static_assert(sizeof(UFortRefundConfirmation) == 0x000570, "Wrong size on UFortRefundConfirmation");
static_assert(offsetof(UFortRefundConfirmation, Text_RefundsRemaining) == 0x000528, "Member 'UFortRefundConfirmation::Text_RefundsRemaining' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Text_RefundCount) == 0x000530, "Member 'UFortRefundConfirmation::Text_RefundCount' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Text_AreYouSure) == 0x000538, "Member 'UFortRefundConfirmation::Text_AreYouSure' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Button_Yes) == 0x000540, "Member 'UFortRefundConfirmation::Button_Yes' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Button_No) == 0x000548, "Member 'UFortRefundConfirmation::Button_No' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, Button_CloseMobile) == 0x000550, "Member 'UFortRefundConfirmation::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, RefundTicket_Left) == 0x000558, "Member 'UFortRefundConfirmation::RefundTicket_Left' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, RefundTicket_Center) == 0x000560, "Member 'UFortRefundConfirmation::RefundTicket_Center' has a wrong offset!");
static_assert(offsetof(UFortRefundConfirmation, RefundTicket_Right) == 0x000568, "Member 'UFortRefundConfirmation::RefundTicket_Right' has a wrong offset!");

}

