#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Commando_KeepOutExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C
// 0x0400 (0x0A68 - 0x0668)
class AAOE_Commando_KeepOutExplosion_C final : public AFortAreaOfEffectCloud
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AOE_Audio_Effect;                                  // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Grenade_Linger;                                  // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DamageArea;                                        // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0690(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FSoundAttenuationSettings              AOE_Sound_Attenuation_Based_On_Radius;             // 0x0698(0x03D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AOE_Commando_KeepOutExplosion(int32 EntryPoint);
	void OnRep_Radius();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Send_Info(double Radius_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AOE_Commando_KeepOutExplosion_C">();
	}
	static class AAOE_Commando_KeepOutExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAOE_Commando_KeepOutExplosion_C>();
	}
};
static_assert(alignof(AAOE_Commando_KeepOutExplosion_C) == 0x000008, "Wrong alignment on AAOE_Commando_KeepOutExplosion_C");
static_assert(sizeof(AAOE_Commando_KeepOutExplosion_C) == 0x000A68, "Wrong size on AAOE_Commando_KeepOutExplosion_C");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, UberGraphFrame) == 0x000668, "Member 'AAOE_Commando_KeepOutExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, AOE_Audio_Effect) == 0x000670, "Member 'AAOE_Commando_KeepOutExplosion_C::AOE_Audio_Effect' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, P_Grenade_Linger) == 0x000678, "Member 'AAOE_Commando_KeepOutExplosion_C::P_Grenade_Linger' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, DamageArea) == 0x000680, "Member 'AAOE_Commando_KeepOutExplosion_C::DamageArea' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, DefaultSceneRoot) == 0x000688, "Member 'AAOE_Commando_KeepOutExplosion_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, Radius) == 0x000690, "Member 'AAOE_Commando_KeepOutExplosion_C::Radius' has a wrong offset!");
static_assert(offsetof(AAOE_Commando_KeepOutExplosion_C, AOE_Sound_Attenuation_Based_On_Radius) == 0x000698, "Member 'AAOE_Commando_KeepOutExplosion_C::AOE_Sound_Attenuation_Based_On_Radius' has a wrong offset!");

}

