#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AscenderCodeRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class AscenderCodeRuntime.FortAscenderZipline
// 0x0350 (0x1090 - 0x0D40)
class AFortAscenderZipline final : public AFortAthenaSplineZipline
{
public:
	TMulticastInlineDelegate<void()>              OnAscenderSetupComplete;                           // 0x0D40(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                   SplineTopAttachPointName;                          // 0x0D50(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoFindSplineEndLocation;                        // 0x0D54(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D55[0x3];                                      // 0x0D55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplineOffsetFromGround;                            // 0x0D58(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CableOffsetFromSplineEnd;                          // 0x0D5C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SplineLength;                                      // 0x0D60(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D64[0x4];                                      // 0x0D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            SplineStaticMesh;                                  // 0x0D68(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESplineMeshAxis                               MeshForwardAxis;                                   // 0x0D70(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandleReturning;                                  // 0x0D71(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D72[0x2];                                      // 0x0D72(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HandleReturnSpeed;                                 // 0x0D74(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCableDropping;                                    // 0x0D78(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D79[0x3];                                      // 0x0D79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CableDropSpeed;                                    // 0x0D7C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         YawRotationOffsetWhileUsingHandle;                 // 0x0D80(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         YawRotationOffsetWhileSlidingDown;                 // 0x0D84(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseComplexSplineCollision;                        // 0x0D88(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D89[0x3];                                      // 0x0D89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SimpleSplineCollisionRadius;                       // 0x0D8C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SimpleSplineCollisionHeightExtension;              // 0x0D90(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D94[0x4];                                      // 0x0D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DescendMinDistanceFromBottom;                      // 0x0D98(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendReachedEndHorizontalLaunchSpeed;             // 0x0DC0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendReachedEndVerticalLaunchSpeed;               // 0x0DE8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendJumpedOffHorizontalLaunchSpeed;              // 0x0E10(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendJumpedOffVerticalLaunchSpeed;                // 0x0E38(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DescendReachedEndHorizontalLaunchSpeed;            // 0x0E60(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DescendReachedEndVerticalLaunchSpeed;              // 0x0E88(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DescendJumpedOffHorizontalLaunchSpeed;             // 0x0EB0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DescendJumpedOffVerticalLaunchSpeed;               // 0x0ED8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HandleActorHitPlayerHorizontalLaunchSpeed;         // 0x0F00(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HandleActorHitPlayerVerticalLaunchSpeed;           // 0x0F28(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                HandleDestroyBuildingsOverlapExtents;              // 0x0F50(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PlayerDestroyBuildingsOverlapExtents;              // 0x0F68(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InitialSplineEndLocation;                          // 0x0F80(0x0018)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CurrentSplineEndLocation;                          // 0x0F98(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TargetSplineEndLocation;                           // 0x0FB0(0x0018)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CurrentHandleLocation;                             // 0x0FC8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPrimitiveComponent>     CurrentInteractComponent;                          // 0x0FE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerPawn>         PawnUsingHandle;                                   // 0x0FE8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerPawn>         PreviousPawnUsingHandle;                           // 0x0FF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineMeshComponent*                   SplineMesh;                                        // 0x0FF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCapsuleComponent*                      SimpleSplineMeshCollision;                         // 0x1000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ABuildingActor>          FloorActor;                                        // 0x1008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AFortPlayerPawn>> RotationLockedPawns;                               // 0x1010(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1020[0x68];                                    // 0x1020(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLinkToActorComponent*              LinkToActorComponent;                              // 0x1088(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_HandlePlayerStartedUsingHandle(class AFortPlayerPawn* Player);
	void BP_HandlePlayerStoppedUsingHandle(class AFortPlayerPawn* Player);
	void BP_HandleStartedLoweringCable();
	void BP_HandleStartedLoweringHandle();
	void BP_HandleStoppedLoweringCable();
	void BP_HandleStoppedLoweringHandle();
	void BP_HandleUpdatedLoweringCable();
	void BP_HandleUpdatedLoweringHandle();
	void HandleFloorActorDestroyed(class AActor* Actor);
	void HandleFloorActorHealthChanged();
	void HandlePawnUsingHandleDied(class AFortPawn* DeadPawn);
	void OnRep_InitialSplineEndLocation();
	void OnRep_PawnUsingHandle();
	void OnRep_TargetSplineEndLocation();
	void SetupAscender(const bool bFromConstruction, const bool bFromReplication);

	void ApplyStructureDamage(class ABuildingSMActor* BuildingActor, class AActor* DamageSource) const;
	class UPrimitiveComponent* GetHandleComponent() const;
	class UPrimitiveComponent* GetInteractComponentOverride(class AFortPlayerPawn* InteractingPawn, class UPrimitiveComponent* InteractComponent) const;
	class AFortPlayerPawn* GetPawnUsingHandle() const;
	class UPrimitiveComponent* GetTopComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAscenderZipline">();
	}
	static class AFortAscenderZipline* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAscenderZipline>();
	}
};
static_assert(alignof(AFortAscenderZipline) == 0x000008, "Wrong alignment on AFortAscenderZipline");
static_assert(sizeof(AFortAscenderZipline) == 0x001090, "Wrong size on AFortAscenderZipline");
static_assert(offsetof(AFortAscenderZipline, OnAscenderSetupComplete) == 0x000D40, "Member 'AFortAscenderZipline::OnAscenderSetupComplete' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SplineTopAttachPointName) == 0x000D50, "Member 'AFortAscenderZipline::SplineTopAttachPointName' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, bAutoFindSplineEndLocation) == 0x000D54, "Member 'AFortAscenderZipline::bAutoFindSplineEndLocation' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SplineOffsetFromGround) == 0x000D58, "Member 'AFortAscenderZipline::SplineOffsetFromGround' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, CableOffsetFromSplineEnd) == 0x000D5C, "Member 'AFortAscenderZipline::CableOffsetFromSplineEnd' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SplineLength) == 0x000D60, "Member 'AFortAscenderZipline::SplineLength' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SplineStaticMesh) == 0x000D68, "Member 'AFortAscenderZipline::SplineStaticMesh' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, MeshForwardAxis) == 0x000D70, "Member 'AFortAscenderZipline::MeshForwardAxis' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, bHandleReturning) == 0x000D71, "Member 'AFortAscenderZipline::bHandleReturning' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, HandleReturnSpeed) == 0x000D74, "Member 'AFortAscenderZipline::HandleReturnSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, bCableDropping) == 0x000D78, "Member 'AFortAscenderZipline::bCableDropping' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, CableDropSpeed) == 0x000D7C, "Member 'AFortAscenderZipline::CableDropSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, YawRotationOffsetWhileUsingHandle) == 0x000D80, "Member 'AFortAscenderZipline::YawRotationOffsetWhileUsingHandle' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, YawRotationOffsetWhileSlidingDown) == 0x000D84, "Member 'AFortAscenderZipline::YawRotationOffsetWhileSlidingDown' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, bUseComplexSplineCollision) == 0x000D88, "Member 'AFortAscenderZipline::bUseComplexSplineCollision' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SimpleSplineCollisionRadius) == 0x000D8C, "Member 'AFortAscenderZipline::SimpleSplineCollisionRadius' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SimpleSplineCollisionHeightExtension) == 0x000D90, "Member 'AFortAscenderZipline::SimpleSplineCollisionHeightExtension' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, DescendMinDistanceFromBottom) == 0x000D98, "Member 'AFortAscenderZipline::DescendMinDistanceFromBottom' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, AscendReachedEndHorizontalLaunchSpeed) == 0x000DC0, "Member 'AFortAscenderZipline::AscendReachedEndHorizontalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, AscendReachedEndVerticalLaunchSpeed) == 0x000DE8, "Member 'AFortAscenderZipline::AscendReachedEndVerticalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, AscendJumpedOffHorizontalLaunchSpeed) == 0x000E10, "Member 'AFortAscenderZipline::AscendJumpedOffHorizontalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, AscendJumpedOffVerticalLaunchSpeed) == 0x000E38, "Member 'AFortAscenderZipline::AscendJumpedOffVerticalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, DescendReachedEndHorizontalLaunchSpeed) == 0x000E60, "Member 'AFortAscenderZipline::DescendReachedEndHorizontalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, DescendReachedEndVerticalLaunchSpeed) == 0x000E88, "Member 'AFortAscenderZipline::DescendReachedEndVerticalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, DescendJumpedOffHorizontalLaunchSpeed) == 0x000EB0, "Member 'AFortAscenderZipline::DescendJumpedOffHorizontalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, DescendJumpedOffVerticalLaunchSpeed) == 0x000ED8, "Member 'AFortAscenderZipline::DescendJumpedOffVerticalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, HandleActorHitPlayerHorizontalLaunchSpeed) == 0x000F00, "Member 'AFortAscenderZipline::HandleActorHitPlayerHorizontalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, HandleActorHitPlayerVerticalLaunchSpeed) == 0x000F28, "Member 'AFortAscenderZipline::HandleActorHitPlayerVerticalLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, HandleDestroyBuildingsOverlapExtents) == 0x000F50, "Member 'AFortAscenderZipline::HandleDestroyBuildingsOverlapExtents' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, PlayerDestroyBuildingsOverlapExtents) == 0x000F68, "Member 'AFortAscenderZipline::PlayerDestroyBuildingsOverlapExtents' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, InitialSplineEndLocation) == 0x000F80, "Member 'AFortAscenderZipline::InitialSplineEndLocation' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, CurrentSplineEndLocation) == 0x000F98, "Member 'AFortAscenderZipline::CurrentSplineEndLocation' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, TargetSplineEndLocation) == 0x000FB0, "Member 'AFortAscenderZipline::TargetSplineEndLocation' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, CurrentHandleLocation) == 0x000FC8, "Member 'AFortAscenderZipline::CurrentHandleLocation' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, CurrentInteractComponent) == 0x000FE0, "Member 'AFortAscenderZipline::CurrentInteractComponent' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, PawnUsingHandle) == 0x000FE8, "Member 'AFortAscenderZipline::PawnUsingHandle' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, PreviousPawnUsingHandle) == 0x000FF0, "Member 'AFortAscenderZipline::PreviousPawnUsingHandle' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SplineMesh) == 0x000FF8, "Member 'AFortAscenderZipline::SplineMesh' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, SimpleSplineMeshCollision) == 0x001000, "Member 'AFortAscenderZipline::SimpleSplineMeshCollision' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, FloorActor) == 0x001008, "Member 'AFortAscenderZipline::FloorActor' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, RotationLockedPawns) == 0x001010, "Member 'AFortAscenderZipline::RotationLockedPawns' has a wrong offset!");
static_assert(offsetof(AFortAscenderZipline, LinkToActorComponent) == 0x001088, "Member 'AFortAscenderZipline::LinkToActorComponent' has a wrong offset!");

}

