#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssembledMeshSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct AssembledMeshSystem.AssembledMeshAttachmentRules
// 0x0020 (0x0020 - 0x0000)
struct FAssembledMeshAttachmentRules final
{
public:
	class FName                                   AttachSocketName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachOffset;                                      // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAssembledMeshAttachmentRules) == 0x000008, "Wrong alignment on FAssembledMeshAttachmentRules");
static_assert(sizeof(FAssembledMeshAttachmentRules) == 0x000020, "Wrong size on FAssembledMeshAttachmentRules");
static_assert(offsetof(FAssembledMeshAttachmentRules, AttachSocketName) == 0x000000, "Member 'FAssembledMeshAttachmentRules::AttachSocketName' has a wrong offset!");
static_assert(offsetof(FAssembledMeshAttachmentRules, AttachOffset) == 0x000008, "Member 'FAssembledMeshAttachmentRules::AttachOffset' has a wrong offset!");

// ScriptStruct AssembledMeshSystem.BaseParamData
// 0x0010 (0x0010 - 0x0000)
struct FBaseParamData
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseParamData) == 0x000008, "Wrong alignment on FBaseParamData");
static_assert(sizeof(FBaseParamData) == 0x000010, "Wrong size on FBaseParamData");
static_assert(offsetof(FBaseParamData, ParamName) == 0x000000, "Member 'FBaseParamData::ParamName' has a wrong offset!");

// ScriptStruct AssembledMeshSystem.IntParamData
// 0x0010 (0x0020 - 0x0010)
struct FIntParamData final : public FBaseParamData
{
public:
	TArray<class FString>                         ParamOptions;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIntParamData) == 0x000008, "Wrong alignment on FIntParamData");
static_assert(sizeof(FIntParamData) == 0x000020, "Wrong size on FIntParamData");
static_assert(offsetof(FIntParamData, ParamOptions) == 0x000010, "Member 'FIntParamData::ParamOptions' has a wrong offset!");

// ScriptStruct AssembledMeshSystem.FloatParamData
// 0x0010 (0x0020 - 0x0010)
struct FFloatParamData final : public FBaseParamData
{
public:
	float                                         FloatValue;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinFloatValue;                                     // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFloatValue;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFloatParamData) == 0x000008, "Wrong alignment on FFloatParamData");
static_assert(sizeof(FFloatParamData) == 0x000020, "Wrong size on FFloatParamData");
static_assert(offsetof(FFloatParamData, FloatValue) == 0x000010, "Member 'FFloatParamData::FloatValue' has a wrong offset!");
static_assert(offsetof(FFloatParamData, MinFloatValue) == 0x000014, "Member 'FFloatParamData::MinFloatValue' has a wrong offset!");
static_assert(offsetof(FFloatParamData, MaxFloatValue) == 0x000018, "Member 'FFloatParamData::MaxFloatValue' has a wrong offset!");

// ScriptStruct AssembledMeshSystem.AssembledComponentReferences
// 0x0010 (0x0010 - 0x0000)
struct FAssembledComponentReferences final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableSkeletalComponent*         CustomizableComponent;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAssembledComponentReferences) == 0x000008, "Wrong alignment on FAssembledComponentReferences");
static_assert(sizeof(FAssembledComponentReferences) == 0x000010, "Wrong size on FAssembledComponentReferences");
static_assert(offsetof(FAssembledComponentReferences, SkeletalMeshComponent) == 0x000000, "Member 'FAssembledComponentReferences::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(FAssembledComponentReferences, CustomizableComponent) == 0x000008, "Member 'FAssembledComponentReferences::CustomizableComponent' has a wrong offset!");

}

