#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemCustomizationSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ExecuteUbergraph_AthenaItemCustomizationSelector
// 0x0370 (0x0370 - 0x0000)
struct AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoHeaderWidget_C*                K2Node_DynamicCast_AsItem_Info_Header_Widget;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_CategoryDisplayName;                  // 0x0018(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ItemDisplayTypeName;                  // 0x0030(0x0018)(ConstParm)
	EAthenaCustomizationCategory                  K2Node_Event_SelectedCategory;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_Event_OverrideSlotImage;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_Event_SelectedItem;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationPicker_C*           K2Node_DynamicCast_AsAthena_Customization_Picker;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticAccountItem*             K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLockerItemTypeText_ReturnValue;        // 0x0088(0x0018)()
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLockerDescriptionText_ReturnValue;     // 0x00B0(0x0018)()
	bool                                          CallFunc_IsOwnedByCampaignHero_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              CallFunc_GetHero_ReturnValue;                      // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00E0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoHeaderWidget_C*                K2Node_DynamicCast_AsItem_Info_Header_Widget_1;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowingVariants;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_PassThrough;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsHovered;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationPicker_C*           K2Node_DynamicCast_AsAthena_Customization_Picker_1; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsHovered)>              K2Node_CreateDelegate_OutputDelegate;              // 0x011C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_NewText;                        // 0x0130(0x0018)()
	TDelegate<void(class FText NewText)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldHide;                          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldShow;                          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_CalloutText;                          // 0x0178(0x0018)(ConstParm)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_CustomEvent_SelectedItem;                   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_PassThrough_1;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBladeOpen_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MarkedCount;                          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowTooltip_2;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULockerArchivingTooltip_C*              K2Node_DynamicCast_AsLocker_Archiving_Tooltip;     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowTooltip_1;                       // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text_2;                               // 0x0230(0x0018)(ConstParm)
	class ULockerArchivingTooltip_C*              K2Node_DynamicCast_AsLocker_Archiving_Tooltip_1;   // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULockerArchivingTooltip_C*              K2Node_DynamicCast_AsLocker_Archiving_Tooltip_2;   // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0268(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0288(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x02A8(0x0018)()
	bool                                          K2Node_Event_bShowTooltip;                         // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text_1;                               // 0x02C8(0x0018)(ConstParm)
	class ULockerArchivingTooltip_C*              K2Node_DynamicCast_AsLocker_Archiving_Tooltip_3;   // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULockerArchivingTooltip_C*              K2Node_DynamicCast_AsLocker_Archiving_Tooltip_4;   // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x5];                                      // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULockerArchivingTooltip_C*              K2Node_DynamicCast_AsLocker_Archiving_Tooltip_5;   // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0310(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x032F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_RowDisplayName;                       // 0x0330(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector) == 0x000370, "Wrong size on AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, EntryPoint) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsItem_Info_Header_Widget) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsItem_Info_Header_Widget' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_CategoryDisplayName) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_ItemDisplayTypeName) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_ItemDisplayTypeName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_SelectedCategory) == 0x000048, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_SelectedCategory' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_OverrideSlotImage) == 0x000050, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_OverrideSlotImage' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_SelectedItem) == 0x000058, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_SelectedItem' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Customization_Picker) == 0x000060, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Customization_Picker' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item) == 0x000070, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000080, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetLockerItemTypeText_ReturnValue) == 0x000088, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetLockerItemTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x0000A0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetLockerDescriptionText_ReturnValue) == 0x0000B0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetLockerDescriptionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsOwnedByCampaignHero_ReturnValue) == 0x0000C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsOwnedByCampaignHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetHero_ReturnValue) == 0x0000D0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetRarity_ReturnValue) == 0x0000D9, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetDisplayName_ReturnValue) == 0x0000E0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsItem_Info_Header_Widget_1) == 0x000100, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsItem_Info_Header_Widget_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShowingVariants) == 0x000109, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShowingVariants' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_HandleBack_PassThrough) == 0x00010A, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_HandleBack_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_IsClosed_Variable) == 0x00010B, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CustomEvent_bIsHovered) == 0x00010C, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CustomEvent_bIsHovered' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Customization_Picker_1) == 0x000110, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Customization_Picker_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_5) == 0x000118, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate) == 0x00011C, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetContext_ReturnValue) == 0x000128, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CustomEvent_NewText) == 0x000130, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CustomEvent_NewText' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShouldHide) == 0x000154, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShouldHide' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Has_Been_Initd_Variable) == 0x000155, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsMobileGame_ReturnValue) == 0x000156, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000158, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_MakeStruct_Margin) == 0x000160, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_BooleanAND_ReturnValue) == 0x000170, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShouldShow) == 0x000171, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShouldShow' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_CalloutText) == 0x000178, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_CalloutText' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000190, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Variable) == 0x000198, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CustomEvent_SelectedItem) == 0x0001A0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_PlayAnimation_ReturnValue) == 0x0001A8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_3) == 0x0001B0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Variable_1) == 0x0001B1, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B4, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Variable_2) == 0x0001C0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_Not_PreBool_ReturnValue) == 0x0001C1, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_HandleBack_PassThrough_1) == 0x0001D0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_HandleBack_PassThrough_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Variable_3) == 0x0001D1, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_InVisibility) == 0x0001D2, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_byte_Variable) == 0x0001D3, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_Button_1) == 0x0001D8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_Button) == 0x0001E0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsBladeOpen_ReturnValue) == 0x0001E8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsBladeOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001E9, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_BooleanAND_ReturnValue_1) == 0x0001EA, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001EB, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001EC, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001F0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetContext_ReturnValue_1) == 0x000200, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_SelectInt_ReturnValue) == 0x000208, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_MarkedCount) == 0x00020C, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_MarkedCount' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000210, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShowTooltip_2) == 0x000218, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShowTooltip_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsLocker_Archiving_Tooltip) == 0x000220, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsLocker_Archiving_Tooltip' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_6) == 0x000228, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShowTooltip_1) == 0x000229, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShowTooltip_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_Text_2) == 0x000230, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_Text_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsLocker_Archiving_Tooltip_1) == 0x000248, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsLocker_Archiving_Tooltip_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_7) == 0x000250, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsLocker_Archiving_Tooltip_2) == 0x000258, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsLocker_Archiving_Tooltip_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_8) == 0x000260, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000261, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000262, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_BooleanOR_ReturnValue) == 0x000263, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_text_Variable) == 0x000268, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000280, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_text_Variable_1) == 0x000288, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Variable_4) == 0x0002A0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Select_Default) == 0x0002A8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShowTooltip) == 0x0002C0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShowTooltip' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_Text_1) == 0x0002C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_Text_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsLocker_Archiving_Tooltip_3) == 0x0002E0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsLocker_Archiving_Tooltip_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_9) == 0x0002E8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsLocker_Archiving_Tooltip_4) == 0x0002F0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsLocker_Archiving_Tooltip_4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_10) == 0x0002F8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_byte_Variable_1) == 0x0002F9, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_byte_Variable_2) == 0x0002FA, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_byte_Variable_2' has a wrong offset!");
