#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemCustomizationSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C
// 0x01A0 (0x0B40 - 0x09A0)
class UAthenaItemCustomizationSelector_C final : public UAthenaItemSelectorScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseAnim;                                         // 0x09A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x09B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x09B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortTextButton_C*                      Button_HitBlockerLeft;                             // 0x09C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTextButton_C*                      Button_HitBlockerRight;                            // 0x09C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CameraFrameContainer;                              // 0x09D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ExclusiveCalloutBox;                               // 0x09D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ExclusiveCalloutText;                              // 0x09E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VariantCustomizationHeader_C*      Header;                                            // 0x09E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              LeftSideContentSZ;                                 // 0x09F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              RightSideContentSZ;                                // 0x09F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_ButtonsBar;                               // 0x0A00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          SafezonePaddingReductionCB;                        // 0x0A08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_MainContent;                                    // 0x0A10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Mobile2;                                  // 0x0A18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Mobile3;                                  // 0x0A20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Vignette;                                          // 0x0A28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            WidgetSwitcher_InteractionMethod;                  // 0x0A30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            WidgetSwitcher_ItemEditor;                         // 0x0A38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPickingStyle;                                     // 0x0A40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHandledBackRequest;                               // 0x0A41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A42[0x6];                                      // 0x0A42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AutoHideInfoPanelEventTimer;                       // 0x0A48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TextEntryTimer;                                    // 0x0A50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SeasonFilter;                                      // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSeason;                                         // 0x0A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemInfoHideDelayTime;                             // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         TitleFontArchive;                                  // 0x0A68(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         TitleFontDefault;                                  // 0x0AC0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	ELockerScreenState                            LockerStateCache;                                  // 0x0B18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B19[0x7];                                      // 0x0B19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_SubHeader;                                    // 0x0B20(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__AthenaItemCustomizationSelector_Tooltip_ArchiveMode_K2Node_ComponentBoundEvent_2_OnDismissed__DelegateSignature();
	void BndEvt__AthenaItemCustomizationSelector_Tooltip_LockerArchivingCleanup_K2Node_ComponentBoundEvent_1_OnDismissed__DelegateSignature();
	void BndEvt__AthenaItemCustomizationSelector_Tooltip_ShowArchivedItems_K2Node_ComponentBoundEvent_7_OnDismissed__DelegateSignature();
	void BndEvt__Blade_SortAndFilter_K2Node_ComponentBoundEvent_3_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__Button_HitBlockerLeft_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_HitBlockerRight_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BP_HandleBack();
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_AthenaItemCustomizationSelector(int32 EntryPoint);
	class UMaterialInstance* GetCategoryImage(EAthenaCustomizationCategory Index_0, class UMaterialInstance* OverrideImage);
	void GetCurrentItemCosmeticDefinition(class UAthenaCosmeticItemDefinition** Cosmetic_Item_Definition);
	void HandleAlternateActionHoveredChanged(bool bIsHovered);
	void HandleBack(bool* PassThrough);
	void HandleHideInfoPanel();
	void HandleItemSetupFinished(const class FText& InText, EAthenaCustomizationCategory category, class UMaterialInstance* OverrideImage);
	void HandlePickerMarkedItemsChanged(int32 MarkedCount);
	void HandleShowInfoPanel(class UFortItem* SelectedItem);
	void HandleTextChanged(const class FText& NewText);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	void OnFinishedItemSave();
	void OnFinishedItemSetup(const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName, EAthenaCustomizationCategory SelectedCategory, class UMaterialInstance* OverrideSlotImage);
	void OnHideItemInfoHeader(bool bShouldHide);
	void OnInitialized();
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnLockerScreenStateChanged();
	void OnPreviewActionButtonUpdated(const class FText& RowDisplayName);
	void OnShowArchivedItemsTooltip(bool bShowTooltip);
	void OnShowArchiveModeTooltip(bool bShowTooltip);
	void OnShowLockerArchivingCleanupTooltip(bool bShowTooltip);
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnUpdateArchivedItemsTooltipText(const class FText& Text);
	void OnUpdateArchiveModeTooltipText(const class FText& Text);
	void OnUpdateExclusiveItemCallout(bool bShouldShow, const class FText& CalloutText);
	void OnUpdateLockerArchivingCleanupTooltipText(const class FText& Text);
	void PreConstruct(bool IsDesignTime);
	void UpdateArchivingButtonText(int32 MarkedCount);
	void UpdateSeasonButtonEnabledState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemCustomizationSelector_C">();
	}
	static class UAthenaItemCustomizationSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemCustomizationSelector_C>();
	}
};
static_assert(alignof(UAthenaItemCustomizationSelector_C) == 0x000010, "Wrong alignment on UAthenaItemCustomizationSelector_C");
static_assert(sizeof(UAthenaItemCustomizationSelector_C) == 0x000B40, "Wrong size on UAthenaItemCustomizationSelector_C");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, UberGraphFrame) == 0x0009A0, "Member 'UAthenaItemCustomizationSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, PulseAnim) == 0x0009A8, "Member 'UAthenaItemCustomizationSelector_C::PulseAnim' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ItemInfoIntroOutro) == 0x0009B0, "Member 'UAthenaItemCustomizationSelector_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Intro) == 0x0009B8, "Member 'UAthenaItemCustomizationSelector_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Button_HitBlockerLeft) == 0x0009C0, "Member 'UAthenaItemCustomizationSelector_C::Button_HitBlockerLeft' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Button_HitBlockerRight) == 0x0009C8, "Member 'UAthenaItemCustomizationSelector_C::Button_HitBlockerRight' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, CameraFrameContainer) == 0x0009D0, "Member 'UAthenaItemCustomizationSelector_C::CameraFrameContainer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ExclusiveCalloutBox) == 0x0009D8, "Member 'UAthenaItemCustomizationSelector_C::ExclusiveCalloutBox' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ExclusiveCalloutText) == 0x0009E0, "Member 'UAthenaItemCustomizationSelector_C::ExclusiveCalloutText' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Header) == 0x0009E8, "Member 'UAthenaItemCustomizationSelector_C::Header' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, LeftSideContentSZ) == 0x0009F0, "Member 'UAthenaItemCustomizationSelector_C::LeftSideContentSZ' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, RightSideContentSZ) == 0x0009F8, "Member 'UAthenaItemCustomizationSelector_C::RightSideContentSZ' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SafeZone_ButtonsBar) == 0x000A00, "Member 'UAthenaItemCustomizationSelector_C::SafeZone_ButtonsBar' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SafezonePaddingReductionCB) == 0x000A08, "Member 'UAthenaItemCustomizationSelector_C::SafezonePaddingReductionCB' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SB_MainContent) == 0x000A10, "Member 'UAthenaItemCustomizationSelector_C::SB_MainContent' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ScaleBox_Mobile2) == 0x000A18, "Member 'UAthenaItemCustomizationSelector_C::ScaleBox_Mobile2' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ScaleBox_Mobile3) == 0x000A20, "Member 'UAthenaItemCustomizationSelector_C::ScaleBox_Mobile3' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Vignette) == 0x000A28, "Member 'UAthenaItemCustomizationSelector_C::Vignette' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, WidgetSwitcher_InteractionMethod) == 0x000A30, "Member 'UAthenaItemCustomizationSelector_C::WidgetSwitcher_InteractionMethod' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, WidgetSwitcher_ItemEditor) == 0x000A38, "Member 'UAthenaItemCustomizationSelector_C::WidgetSwitcher_ItemEditor' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, bPickingStyle) == 0x000A40, "Member 'UAthenaItemCustomizationSelector_C::bPickingStyle' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, bHandledBackRequest) == 0x000A41, "Member 'UAthenaItemCustomizationSelector_C::bHandledBackRequest' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, AutoHideInfoPanelEventTimer) == 0x000A48, "Member 'UAthenaItemCustomizationSelector_C::AutoHideInfoPanelEventTimer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, TextEntryTimer) == 0x000A50, "Member 'UAthenaItemCustomizationSelector_C::TextEntryTimer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SeasonFilter) == 0x000A58, "Member 'UAthenaItemCustomizationSelector_C::SeasonFilter' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, MaxSeason) == 0x000A5C, "Member 'UAthenaItemCustomizationSelector_C::MaxSeason' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ItemInfoHideDelayTime) == 0x000A60, "Member 'UAthenaItemCustomizationSelector_C::ItemInfoHideDelayTime' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, TitleFontArchive) == 0x000A68, "Member 'UAthenaItemCustomizationSelector_C::TitleFontArchive' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, TitleFontDefault) == 0x000AC0, "Member 'UAthenaItemCustomizationSelector_C::TitleFontDefault' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, LockerStateCache) == 0x000B18, "Member 'UAthenaItemCustomizationSelector_C::LockerStateCache' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Text_SubHeader) == 0x000B20, "Member 'UAthenaItemCustomizationSelector_C::Text_SubHeader' has a wrong offset!");

}

