#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengeListEntry_LockedQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaChallengeListEntry_LockedQuest.AthenaChallengeListEntry_LockedQuest_C
// 0x0060 (0x03A0 - 0x0340)
class UAthenaChallengeListEntry_LockedQuest_C final : public UAthenaChallengeListEntry_LockedQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select;                                            // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_ChallengesUntilUnlock;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Disabled;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fade;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TimeUntilUnlock;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageContainer;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      SpinningClock;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Lock;                                              // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnChallengeInfoSet(bool bDisabled);
	void BP_OnEntryReleased();
	void BP_OnItemSelectionChanged(bool bIsSelected_0);
	void EndHighlight();
	void ExecuteUbergraph_AthenaChallengeListEntry_LockedQuest(int32 EntryPoint);
	void GetFinalDisplayName(class FText* DisplayName);
	void GetFormattedTime(struct FTimespan& TimeRemaining, class FText* OutputString);
	void OnInitDisplayText(const ELockedWidgetUnlockType& InUnlockType);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void StartHighlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaChallengeListEntry_LockedQuest_C">();
	}
	static class UAthenaChallengeListEntry_LockedQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeListEntry_LockedQuest_C>();
	}
};
static_assert(alignof(UAthenaChallengeListEntry_LockedQuest_C) == 0x000008, "Wrong alignment on UAthenaChallengeListEntry_LockedQuest_C");
static_assert(sizeof(UAthenaChallengeListEntry_LockedQuest_C) == 0x0003A0, "Wrong size on UAthenaChallengeListEntry_LockedQuest_C");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, UberGraphFrame) == 0x000340, "Member 'UAthenaChallengeListEntry_LockedQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Select) == 0x000348, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Select' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Hovered) == 0x000350, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Hovered' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Image_ChallengesUntilUnlock) == 0x000358, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Image_ChallengesUntilUnlock' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Image_Disabled) == 0x000360, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Image_Disabled' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Image_Fade) == 0x000368, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Image_Fade' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Image_TimeUntilUnlock) == 0x000370, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Image_TimeUntilUnlock' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, ImageContainer) == 0x000378, "Member 'UAthenaChallengeListEntry_LockedQuest_C::ImageContainer' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, bIsHovered) == 0x000380, "Member 'UAthenaChallengeListEntry_LockedQuest_C::bIsHovered' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, SpinningClock) == 0x000388, "Member 'UAthenaChallengeListEntry_LockedQuest_C::SpinningClock' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, Lock) == 0x000390, "Member 'UAthenaChallengeListEntry_LockedQuest_C::Lock' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeListEntry_LockedQuest_C, bIsSelected) == 0x000398, "Member 'UAthenaChallengeListEntry_LockedQuest_C::bIsSelected' has a wrong offset!");

}

