#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Athena_PlayerController.Athena_PlayerController_C.ExecuteUbergraph_Athena_PlayerController
// 0x0548 (0x0548 - 0x0000)
struct Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAudioAnalysisSubsystem*            CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAthenaMusicPackItemDefinition*   K2Node_CustomEvent_NewMusicPack;                   // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StartTimeOffset;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortWorldItemDefinition> K2Node_CustomEvent_Item_1;                         // 0x0028(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortWorldItemDefinition> K2Node_CustomEvent_Item;                           // 0x0080(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition_1; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	const class UFortWorldItem*                   CallFunc_GiveItemToInventoryOwner_ReturnValue;     // 0x00D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_ReceivingActor;                       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemEntry                         CallFunc_GetItemEntry_ReturnValue;                 // 0x0108(0x01A0)(ConstParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition_2; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMusicEventSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              CallFunc_GetVictoryStinger_ReturnValue;            // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_AddEvent_ReturnValue;                     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_PossessedPawn;                  // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            K2Node_Event_Volume_1;                             // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            K2Node_Event_Volume;                               // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Audio_Only;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAthenaMusicPackItemDefinition* NewMusicPack, float StartTimeOffset)> K2Node_CreateDelegate_OutputDelegate;              // 0x035C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMusicContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaMusicPackItemDefinition*         CallFunc_GetEquippedMusicPack_ReturnValue;         // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryStingerTimeUntilFadeOut_ReturnValue; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0394(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMusicContext*                      CallFunc_GetContext_ReturnValue_3;                 // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x03A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CurrentPlaylistReady*  CallFunc_PlaylistDataReadyAsync_ReturnValue;       // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   Temp_object_Variable_1;                            // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaylist*                          Temp_object_Variable_2;                            // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x03D8(0x0020)()
	class AFortGameStateAthena*                   K2Node_CustomEvent_GameState;                      // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFortPlaylist*                    K2Node_CustomEvent_Playlist;                       // 0x0400(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_PlaylistContextTags;            // 0x0408(0x0020)(ConstParm)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortGameStateAthena* GameState, class UFortPlaylist* Playlist, struct FGameplayTagContainer& PlaylistContextTags)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0430(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_FinisherPawn;                         // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFortWeaponItemDefinition*        K2Node_Event_FinishingWeapon;                      // 0x0450(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDeathCause                                   K2Node_Event_DeathCause;                           // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAudioOnly;                           // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERoundVictoryAnimation                        K2Node_Event_VictoryAnimation;                     // 0x045A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45B[0x5];                                      // 0x045B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_Event_VictoryStingerCue;                    // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E[0x2];                                      // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortWeapon>                CallFunc_GetWeaponActorClass_ReturnValue;          // 0x0480(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsFort_Weapon_Ranged_Dual; // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsB_Ranged_Generic;        // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x04AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APawn* PossessedPawn)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x04B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpatialGameplayExperience_ReturnValue;  // 0x04C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Creative_Mode_ReturnValue;             // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition_3; // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput_1; // 0x04E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	const class UFortWorldItem*                   CallFunc_GiveItemToInventoryOwner_ReturnValue_1;   // 0x04F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523[0x5];                                      // 0x0523(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController) == 0x000008, "Wrong alignment on Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController");
static_assert(sizeof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController) == 0x000548, "Wrong size on Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, EntryPoint) == 0x000000, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_bool_Variable) == 0x000010, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_NewMusicPack) == 0x000018, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_NewMusicPack' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_StartTimeOffset) == 0x000020, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_StartTimeOffset' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_Item_1) == 0x000028, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_Item_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000058, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsFort_World_Item_Definition) == 0x000060, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsFort_World_Item_Definition' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsSound_Base) == 0x000070, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000079, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_Item) == 0x000080, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x0000A8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsFort_World_Item_Definition_1) == 0x0000B0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsFort_World_Item_Definition_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_object_Variable) == 0x0000C0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x0000C8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GiveItemToInventoryOwner_ReturnValue) == 0x0000D8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GiveItemToInventoryOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_bool_Variable_1) == 0x0000E0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_ReceivingActor) == 0x0000E8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_ReceivingActor' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x0000F0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsFort_Pickup) == 0x0000F8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetItemEntry_ReturnValue) == 0x000108, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_K2_GetPawn_ReturnValue) == 0x0002A8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002B0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess_4) == 0x0002B8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsFort_World_Item_Definition_2) == 0x0002C0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsFort_World_Item_Definition_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess_5) == 0x0002C8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0002D0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0002E0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Not_PreBool_ReturnValue) == 0x0002E1, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0002E8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0002F8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetContext_ReturnValue) == 0x000300, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000308, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetVictoryStinger_ReturnValue) == 0x000310, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetVictoryStinger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_AddEvent_ReturnValue) == 0x000318, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_AddEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_1) == 0x000320, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_PossessedPawn) == 0x000328, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_PossessedPawn' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Select_Default) == 0x000330, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_EndPlayReason) == 0x000338, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_SpawnSound2D_ReturnValue) == 0x000340, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_Volume_1) == 0x000348, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_Volume_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_Volume) == 0x000350, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_Volume' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_Audio_Only) == 0x000358, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_Audio_Only' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_2) == 0x000359, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CreateDelegate_OutputDelegate) == 0x00035C, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetContext_ReturnValue_1) == 0x000368, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetEquippedMusicPack_ReturnValue) == 0x000370, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetEquippedMusicPack_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000378, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetContext_ReturnValue_2) == 0x000380, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000388, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_VictoryStingerTimeUntilFadeOut_ReturnValue) == 0x00038C, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_VictoryStingerTimeUntilFadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000390, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000394, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetContext_ReturnValue_3) == 0x0003A0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003A8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_PlaylistDataReadyAsync_ReturnValue) == 0x0003B8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_PlaylistDataReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_object_Variable_1) == 0x0003C0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_3) == 0x0003C8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_object_Variable_2) == 0x0003D0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_struct_Variable) == 0x0003D8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_GameState) == 0x0003F8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_Playlist) == 0x000400, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_Playlist' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_PlaylistContextTags) == 0x000408, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_PlaylistContextTags' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_SelectFloat_ReturnValue) == 0x000428, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CreateDelegate_OutputDelegate_3) == 0x000430, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000440, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_FinisherPawn) == 0x000448, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_FinisherPawn' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_FinishingWeapon) == 0x000450, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_FinishingWeapon' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_DeathCause) == 0x000458, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_DeathCause' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_bAudioOnly) == 0x000459, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_bAudioOnly' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_VictoryAnimation) == 0x00045A, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_VictoryAnimation' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Event_VictoryStingerCue) == 0x000460, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Event_VictoryStingerCue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000468, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000470, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_4) == 0x000478, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000479, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00047A, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_5) == 0x00047B, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanOR_ReturnValue) == 0x00047C, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Not_PreBool_ReturnValue_1) == 0x00047D, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetWeaponActorClass_ReturnValue) == 0x000480, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetWeaponActorClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_6) == 0x000488, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_ClassDynamicCast_AsFort_Weapon_Ranged_Dual) == 0x000490, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_ClassDynamicCast_AsFort_Weapon_Ranged_Dual' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_ClassDynamicCast_bSuccess) == 0x000498, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_ClassDynamicCast_AsB_Ranged_Generic) == 0x0004A0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_ClassDynamicCast_AsB_Ranged_Generic' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_ClassDynamicCast_bSuccess_1) == 0x0004A8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_7) == 0x0004A9, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanOR_ReturnValue_1) == 0x0004AA, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_8) == 0x0004AB, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanAND_ReturnValue) == 0x0004AC, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CreateDelegate_OutputDelegate_4) == 0x0004B0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetNumericCVar_OutValue) == 0x0004BC, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GetNumericCVar_ReturnValue) == 0x0004C0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0004C1, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanAND_ReturnValue_1) == 0x0004C2, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsSpatialGameplayExperience_ReturnValue) == 0x0004C3, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsSpatialGameplayExperience_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, Temp_object_Variable_3) == 0x0004C8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_Is_Creative_Mode_ReturnValue) == 0x0004D0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_Is_Creative_Mode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_AsFort_World_Item_Definition_3) == 0x0004D8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_AsFort_World_Item_Definition_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_DynamicCast_bSuccess_6) == 0x0004E0, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_Select_Default_1) == 0x0004E1, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput_1) == 0x0004E8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_GiveItemToInventoryOwner_ReturnValue_1) == 0x0004F8, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_GiveItemToInventoryOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanAND_ReturnValue_2) == 0x000500, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, K2Node_CustomEvent_Loaded) == 0x000508, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_IsValid_ReturnValue_9) == 0x000510, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000518, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000520, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanAND_ReturnValue_3) == 0x000521, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController, CallFunc_BooleanAND_ReturnValue_4) == 0x000522, "Member 'Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
