#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyPlayerPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobbyPlayerPanel.AthenaLobbyPlayerPanel_C
// 0x02E0 (0x0890 - 0x05B0)
class UAthenaLobbyPlayerPanel_C final : public UAthenaLobbyPlayerPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BattlePassRow;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x05D0(0x0250)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnGadgetsClicked;                                  // 0x0820(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   AddFriendText;                                     // 0x0830(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptInviteText;                                  // 0x0848(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SentInviteText;                                    // 0x0860(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptedInviteText;                                // 0x0878(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaLobbyPlayerPanel(int32 EntryPoint);
	void OnFriendStatusUpdated(EFortFriendRequestStatus FriendRequestStatus);
	void OnHasBattlePassUpdated(bool bHasBattlePass);
	void OnIsMutedUpdated(bool bIsMuted);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobbyPlayerPanel_C">();
	}
	static class UAthenaLobbyPlayerPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyPlayerPanel_C>();
	}
};
static_assert(alignof(UAthenaLobbyPlayerPanel_C) == 0x000010, "Wrong alignment on UAthenaLobbyPlayerPanel_C");
static_assert(sizeof(UAthenaLobbyPlayerPanel_C) == 0x000890, "Wrong size on UAthenaLobbyPlayerPanel_C");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, UberGraphFrame) == 0x0005B0, "Member 'UAthenaLobbyPlayerPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, BattlePassRow) == 0x0005B8, "Member 'UAthenaLobbyPlayerPanel_C::BattlePassRow' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, Border_0) == 0x0005C0, "Member 'UAthenaLobbyPlayerPanel_C::Border_0' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, TeamMemberInfo) == 0x0005D0, "Member 'UAthenaLobbyPlayerPanel_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, OnGadgetsClicked) == 0x000820, "Member 'UAthenaLobbyPlayerPanel_C::OnGadgetsClicked' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, AddFriendText) == 0x000830, "Member 'UAthenaLobbyPlayerPanel_C::AddFriendText' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, AcceptInviteText) == 0x000848, "Member 'UAthenaLobbyPlayerPanel_C::AcceptInviteText' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, SentInviteText) == 0x000860, "Member 'UAthenaLobbyPlayerPanel_C::SentInviteText' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, AcceptedInviteText) == 0x000878, "Member 'UAthenaLobbyPlayerPanel_C::AcceptedInviteText' has a wrong offset!");

}

