#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaLockerTab.AthenaLockerTab_C.AnimShowRandomDisclaimerEnabled
// 0x0020 (0x0020 - 0x0000)
struct AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled) == 0x000008, "Wrong alignment on AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled");
static_assert(sizeof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled) == 0x000020, "Wrong size on AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled");
static_assert(offsetof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled, Show) == 0x000000, "Member 'AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled::Show' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'AthenaLockerTab_C_AnimShowRandomDisclaimerEnabled::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.AssignAllSlots
// 0x0010 (0x0010 - 0x0000)
struct AthenaLockerTab_C_AssignAllSlots final
{
public:
	TArray<class UAthenaCustomizationSlotSelectorButton*> K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AthenaLockerTab_C_AssignAllSlots) == 0x000008, "Wrong alignment on AthenaLockerTab_C_AssignAllSlots");
static_assert(sizeof(AthenaLockerTab_C_AssignAllSlots) == 0x000010, "Wrong size on AthenaLockerTab_C_AssignAllSlots");
static_assert(offsetof(AthenaLockerTab_C_AssignAllSlots, K2Node_MakeArray_Array) == 0x000000, "Member 'AthenaLockerTab_C_AssignAllSlots::K2Node_MakeArray_Array' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.BeginPickingCustomization
// 0x0078 (0x0078 - 0x0000)
struct AthenaLockerTab_C_BeginPickingCustomization final
{
public:
	class UCommonButtonBase*                      WidgetToReturnFocusTo;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAthenaCustomizationParams             CustomizationParams_0;                             // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAthenaCustomizationSlotButton_C*       SlotButton;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable; // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCustomizationSlotActiveState_bOutActive; // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButton_C*       K2Node_DynamicCast_AsAthena_Customization_Slot_Button; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_BeginPickingCustomization) == 0x000008, "Wrong alignment on AthenaLockerTab_C_BeginPickingCustomization");
static_assert(sizeof(AthenaLockerTab_C_BeginPickingCustomization) == 0x000078, "Wrong size on AthenaLockerTab_C_BeginPickingCustomization");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, WidgetToReturnFocusTo) == 0x000000, "Member 'AthenaLockerTab_C_BeginPickingCustomization::WidgetToReturnFocusTo' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CustomizationParams_0) == 0x000008, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CustomizationParams_0' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, SlotButton) == 0x000050, "Member 'AthenaLockerTab_C_BeginPickingCustomization::SlotButton' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000059, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_NotEqual_ObjectObject_ReturnValue_2) == 0x00005B, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_NotEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable) == 0x00005C, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_GetCustomizationSlotActiveState_bOutActive) == 0x00005D, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_GetCustomizationSlotActiveState_bOutActive' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, K2Node_DynamicCast_AsAthena_Customization_Slot_Button) == 0x000060, "Member 'AthenaLockerTab_C_BeginPickingCustomization::K2Node_DynamicCast_AsAthena_Customization_Slot_Button' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AthenaLockerTab_C_BeginPickingCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_BeginPickingCustomization, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'AthenaLockerTab_C_BeginPickingCustomization::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_BackToGame_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLockerTab_C_BndEvt__AthenaLockerTab_Button_QuickRename2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.ExecuteUbergraph_AthenaLockerTab
// 0x0248 (0x0248 - 0x0000)
struct AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_LoadoutName_1;                        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShuffleTile;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0090(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x00B0(0x0018)()
	class UAthenaCustomizationSlotSelectorButton* K2Node_Event_SlotButton;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       K2Node_DynamicCast_AsAthena_Customization_Slot_Button; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAthenaCustomizationParams             K2Node_MakeStruct_AthenaCustomizationParams;       // 0x00F0(0x0048)()
	struct FAthenaCustomizationParams             K2Node_MakeStruct_AthenaCustomizationParams_1;     // 0x0138(0x0048)()
	bool                                          CallFunc_ShouldDisplayNextRandomPresetName_ReturnValue; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_RowDisplayName;                       // 0x0190(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_1;  // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsModified;                          // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanShowToolTip;                      // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAvailable;                         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_LoadoutName;                          // 0x0220(0x0018)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab) == 0x000008, "Wrong alignment on AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab");
static_assert(sizeof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab) == 0x000248, "Wrong size on AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, EntryPoint) == 0x000000, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable) == 0x000004, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable) == 0x000005, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_1) == 0x000007, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_text_Variable) == 0x000008, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_text_Variable_1) == 0x000020, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_2) == 0x000038, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_2) == 0x000039, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_3) == 0x00003A, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_LoadoutName_1) == 0x000040, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_LoadoutName_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bIsShuffleTile) == 0x000050, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bIsShuffleTile' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default) == 0x000058, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000070, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_text_Variable_2) == 0x000090, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_3) == 0x0000A8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_1) == 0x0000B0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_SlotButton) == 0x0000C8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_SlotButton' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_AsAthena_Customization_Slot_Button) == 0x0000D0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_AsAthena_Customization_Slot_Button' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000E8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_MakeStruct_AthenaCustomizationParams) == 0x0000F0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_MakeStruct_AthenaCustomizationParams' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_MakeStruct_AthenaCustomizationParams_1) == 0x000138, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_MakeStruct_AthenaCustomizationParams_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_ShouldDisplayNextRandomPresetName_ReturnValue) == 0x000180, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_ShouldDisplayNextRandomPresetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_BooleanAND_ReturnValue) == 0x000181, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_2) == 0x000182, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimation_ReturnValue_2) == 0x000188, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_RowDisplayName) == 0x000190, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_RowDisplayName' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_TextIsEmpty_ReturnValue) == 0x0001A8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001B0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_4) == 0x0001B8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_ComponentBoundEvent_Button_1) == 0x0001C0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_byte_Variable_5) == 0x0001C8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base) == 0x0001D0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, Temp_bool_Variable_4) == 0x0001D9, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_3) == 0x0001DA, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_1) == 0x0001E0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bIsModified) == 0x0001E9, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bIsModified' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bCanShowToolTip) == 0x0001EA, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bCanShowToolTip' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_BooleanAND_ReturnValue_1) == 0x0001EB, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_IsVisible_ReturnValue) == 0x0001EC, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001F0, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_CreateDelegate_OutputDelegate) == 0x0001F8, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimation_ReturnValue_4) == 0x000208, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_PlayAnimation_ReturnValue_5) == 0x000210, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_GetIsEnabled_ReturnValue) == 0x000218, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_bIsAvailable) == 0x000219, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_bIsAvailable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Event_LoadoutName) == 0x000220, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Event_LoadoutName' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_ComponentBoundEvent_Button) == 0x000238, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, K2Node_Select_Default_4) == 0x000240, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_IsVisible_ReturnValue_1) == 0x000241, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000242, "Member 'AthenaLockerTab_C_ExecuteUbergraph_AthenaLockerTab::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.LoadoutButtonCustomNavigationDown
// 0x0020 (0x0020 - 0x0000)
struct AthenaLockerTab_C_LoadoutButtonCustomNavigationDown final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown) == 0x000008, "Wrong alignment on AthenaLockerTab_C_LoadoutButtonCustomNavigationDown");
static_assert(sizeof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown) == 0x000020, "Wrong size on AthenaLockerTab_C_LoadoutButtonCustomNavigationDown");
static_assert(offsetof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown, Navigation_0) == 0x000000, "Member 'AthenaLockerTab_C_LoadoutButtonCustomNavigationDown::Navigation_0' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown, ReturnValue) == 0x000008, "Member 'AthenaLockerTab_C_LoadoutButtonCustomNavigationDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown, Temp_bool_Variable) == 0x000010, "Member 'AthenaLockerTab_C_LoadoutButtonCustomNavigationDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown, CallFunc_IsVisible_ReturnValue) == 0x000011, "Member 'AthenaLockerTab_C_LoadoutButtonCustomNavigationDown::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_LoadoutButtonCustomNavigationDown, K2Node_Select_Default) == 0x000018, "Member 'AthenaLockerTab_C_LoadoutButtonCustomNavigationDown::K2Node_Select_Default' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnBeginPickingCustomizationSlot
// 0x0008 (0x0008 - 0x0000)
struct AthenaLockerTab_C_OnBeginPickingCustomizationSlot final
{
public:
	class UAthenaCustomizationSlotSelectorButton* SlotButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_OnBeginPickingCustomizationSlot) == 0x000008, "Wrong alignment on AthenaLockerTab_C_OnBeginPickingCustomizationSlot");
static_assert(sizeof(AthenaLockerTab_C_OnBeginPickingCustomizationSlot) == 0x000008, "Wrong size on AthenaLockerTab_C_OnBeginPickingCustomizationSlot");
static_assert(offsetof(AthenaLockerTab_C_OnBeginPickingCustomizationSlot, SlotButton) == 0x000000, "Member 'AthenaLockerTab_C_OnBeginPickingCustomizationSlot::SlotButton' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnModifiedStatusUpdated
// 0x0002 (0x0002 - 0x0000)
struct AthenaLockerTab_C_OnModifiedStatusUpdated final
{
public:
	bool                                          bIsModified;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanShowToolTip;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_OnModifiedStatusUpdated) == 0x000001, "Wrong alignment on AthenaLockerTab_C_OnModifiedStatusUpdated");
static_assert(sizeof(AthenaLockerTab_C_OnModifiedStatusUpdated) == 0x000002, "Wrong size on AthenaLockerTab_C_OnModifiedStatusUpdated");
static_assert(offsetof(AthenaLockerTab_C_OnModifiedStatusUpdated, bIsModified) == 0x000000, "Member 'AthenaLockerTab_C_OnModifiedStatusUpdated::bIsModified' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_OnModifiedStatusUpdated, bCanShowToolTip) == 0x000001, "Member 'AthenaLockerTab_C_OnModifiedStatusUpdated::bCanShowToolTip' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnPreviewActionButtonUpdated
// 0x0018 (0x0018 - 0x0000)
struct AthenaLockerTab_C_OnPreviewActionButtonUpdated final
{
public:
	class FText                                   RowDisplayName;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLockerTab_C_OnPreviewActionButtonUpdated) == 0x000008, "Wrong alignment on AthenaLockerTab_C_OnPreviewActionButtonUpdated");
static_assert(sizeof(AthenaLockerTab_C_OnPreviewActionButtonUpdated) == 0x000018, "Wrong size on AthenaLockerTab_C_OnPreviewActionButtonUpdated");
static_assert(offsetof(AthenaLockerTab_C_OnPreviewActionButtonUpdated, RowDisplayName) == 0x000000, "Member 'AthenaLockerTab_C_OnPreviewActionButtonUpdated::RowDisplayName' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnQuickRenameStatusUpdated
// 0x0020 (0x0020 - 0x0000)
struct AthenaLockerTab_C_OnQuickRenameStatusUpdated final
{
public:
	bool                                          bIsAvailable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoadoutName;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLockerTab_C_OnQuickRenameStatusUpdated) == 0x000008, "Wrong alignment on AthenaLockerTab_C_OnQuickRenameStatusUpdated");
static_assert(sizeof(AthenaLockerTab_C_OnQuickRenameStatusUpdated) == 0x000020, "Wrong size on AthenaLockerTab_C_OnQuickRenameStatusUpdated");
static_assert(offsetof(AthenaLockerTab_C_OnQuickRenameStatusUpdated, bIsAvailable) == 0x000000, "Member 'AthenaLockerTab_C_OnQuickRenameStatusUpdated::bIsAvailable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_OnQuickRenameStatusUpdated, LoadoutName) == 0x000008, "Member 'AthenaLockerTab_C_OnQuickRenameStatusUpdated::LoadoutName' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.OnRefreshForNewLoadout
// 0x0018 (0x0018 - 0x0000)
struct AthenaLockerTab_C_OnRefreshForNewLoadout final
{
public:
	class FString                                 LoadoutName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsShuffleTile;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_OnRefreshForNewLoadout) == 0x000008, "Wrong alignment on AthenaLockerTab_C_OnRefreshForNewLoadout");
static_assert(sizeof(AthenaLockerTab_C_OnRefreshForNewLoadout) == 0x000018, "Wrong size on AthenaLockerTab_C_OnRefreshForNewLoadout");
static_assert(offsetof(AthenaLockerTab_C_OnRefreshForNewLoadout, LoadoutName) == 0x000000, "Member 'AthenaLockerTab_C_OnRefreshForNewLoadout::LoadoutName' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_OnRefreshForNewLoadout, bIsShuffleTile) == 0x000010, "Member 'AthenaLockerTab_C_OnRefreshForNewLoadout::bIsShuffleTile' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.PlayEquippedLockerMusic_STW
// 0x0028 (0x0028 - 0x0000)
struct AthenaLockerTab_C_PlayEquippedLockerMusic_STW final
{
public:
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_PlayEquippedLockerMusic_STW) == 0x000008, "Wrong alignment on AthenaLockerTab_C_PlayEquippedLockerMusic_STW");
static_assert(sizeof(AthenaLockerTab_C_PlayEquippedLockerMusic_STW) == 0x000028, "Wrong size on AthenaLockerTab_C_PlayEquippedLockerMusic_STW");
static_assert(offsetof(AthenaLockerTab_C_PlayEquippedLockerMusic_STW, CallFunc_GetSubGame_ReturnValue) == 0x000000, "Member 'AthenaLockerTab_C_PlayEquippedLockerMusic_STW::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_PlayEquippedLockerMusic_STW, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'AthenaLockerTab_C_PlayEquippedLockerMusic_STW::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_PlayEquippedLockerMusic_STW, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'AthenaLockerTab_C_PlayEquippedLockerMusic_STW::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_PlayEquippedLockerMusic_STW, CallFunc_Array_Get_Item) == 0x000020, "Member 'AthenaLockerTab_C_PlayEquippedLockerMusic_STW::CallFunc_Array_Get_Item' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.PlaySlotAnimationAndCenterSlot
// 0x0010 (0x0010 - 0x0000)
struct AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot) == 0x000008, "Wrong alignment on AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot");
static_assert(sizeof(AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot) == 0x000010, "Wrong size on AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot");
static_assert(offsetof(AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'AthenaLockerTab_C_PlaySlotAnimationAndCenterSlot::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.PlaySlotClickedAnimation
// 0x0018 (0x0018 - 0x0000)
struct AthenaLockerTab_C_PlaySlotClickedAnimation final
{
public:
	class UAthenaCustomizationSlotButton_C*       SlotToPlayAnimOn;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_PlaySlotClickedAnimation) == 0x000008, "Wrong alignment on AthenaLockerTab_C_PlaySlotClickedAnimation");
static_assert(sizeof(AthenaLockerTab_C_PlaySlotClickedAnimation) == 0x000018, "Wrong size on AthenaLockerTab_C_PlaySlotClickedAnimation");
static_assert(offsetof(AthenaLockerTab_C_PlaySlotClickedAnimation, SlotToPlayAnimOn) == 0x000000, "Member 'AthenaLockerTab_C_PlaySlotClickedAnimation::SlotToPlayAnimOn' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_PlaySlotClickedAnimation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AthenaLockerTab_C_PlaySlotClickedAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_PlaySlotClickedAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'AthenaLockerTab_C_PlaySlotClickedAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.TopRowCustomNavigationUp
// 0x0028 (0x0028 - 0x0000)
struct AthenaLockerTab_C_TopRowCustomNavigationUp final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                TargetWidget;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_TopRowCustomNavigationUp) == 0x000008, "Wrong alignment on AthenaLockerTab_C_TopRowCustomNavigationUp");
static_assert(sizeof(AthenaLockerTab_C_TopRowCustomNavigationUp) == 0x000028, "Wrong size on AthenaLockerTab_C_TopRowCustomNavigationUp");
static_assert(offsetof(AthenaLockerTab_C_TopRowCustomNavigationUp, Navigation_0) == 0x000000, "Member 'AthenaLockerTab_C_TopRowCustomNavigationUp::Navigation_0' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_TopRowCustomNavigationUp, ReturnValue) == 0x000008, "Member 'AthenaLockerTab_C_TopRowCustomNavigationUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_TopRowCustomNavigationUp, TargetWidget) == 0x000010, "Member 'AthenaLockerTab_C_TopRowCustomNavigationUp::TargetWidget' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_TopRowCustomNavigationUp, Temp_bool_Variable) == 0x000018, "Member 'AthenaLockerTab_C_TopRowCustomNavigationUp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_TopRowCustomNavigationUp, CallFunc_IsVisible_ReturnValue) == 0x000019, "Member 'AthenaLockerTab_C_TopRowCustomNavigationUp::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLockerTab_C_TopRowCustomNavigationUp, K2Node_Select_Default) == 0x000020, "Member 'AthenaLockerTab_C_TopRowCustomNavigationUp::K2Node_Select_Default' has a wrong offset!");

// Function AthenaLockerTab.AthenaLockerTab_C.UpdatePresetButtonStyles
// 0x0001 (0x0001 - 0x0000)
struct AthenaLockerTab_C_UpdatePresetButtonStyles final
{
public:
	ECommonInputType                              InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLockerTab_C_UpdatePresetButtonStyles) == 0x000001, "Wrong alignment on AthenaLockerTab_C_UpdatePresetButtonStyles");
static_assert(sizeof(AthenaLockerTab_C_UpdatePresetButtonStyles) == 0x000001, "Wrong size on AthenaLockerTab_C_UpdatePresetButtonStyles");
static_assert(offsetof(AthenaLockerTab_C_UpdatePresetButtonStyles, InputPin) == 0x000000, "Member 'AthenaLockerTab_C_UpdatePresetButtonStyles::InputPin' has a wrong offset!");

}

