#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaWatchers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaWatchers.AthenaWatchers_C
// 0x0018 (0x02F8 - 0x02E0)
class UAthenaWatchers_C final : public UAthenaWatchers
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnValueChanged;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaWatcherEye_C*                    AthenaWatcherEye;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SpectatorsEnded();
	void SpectatorsBegan(bool bBigGroup);
	void SpectatorsAdded(bool bBigGroup);
	void SpectatorRemoved();
	void SpectatorCountChanged_BP(int32 NewCount);
	void ExecuteUbergraph_AthenaWatchers(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaWatchers_C">();
	}
	static class UAthenaWatchers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWatchers_C>();
	}
};
static_assert(alignof(UAthenaWatchers_C) == 0x000008, "Wrong alignment on UAthenaWatchers_C");
static_assert(sizeof(UAthenaWatchers_C) == 0x0002F8, "Wrong size on UAthenaWatchers_C");
static_assert(offsetof(UAthenaWatchers_C, UberGraphFrame) == 0x0002E0, "Member 'UAthenaWatchers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaWatchers_C, OnValueChanged) == 0x0002E8, "Member 'UAthenaWatchers_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UAthenaWatchers_C, AthenaWatcherEye) == 0x0002F0, "Member 'UAthenaWatchers_C::AthenaWatcherEye' has a wrong offset!");

}

