#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengeListEntry_Custom

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaChallengeListEntry_Custom.AthenaChallengeListEntry_Custom_C.BP_OnChallengeInfoSet
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet) == 0x000001, "Wrong alignment on AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet");
static_assert(sizeof(AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet) == 0x000001, "Wrong size on AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet, bDisabled) == 0x000000, "Member 'AthenaChallengeListEntry_Custom_C_BP_OnChallengeInfoSet::bDisabled' has a wrong offset!");

// Function AthenaChallengeListEntry_Custom.AthenaChallengeListEntry_Custom_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged");
static_assert(sizeof(AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'AthenaChallengeListEntry_Custom_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function AthenaChallengeListEntry_Custom.AthenaChallengeListEntry_Custom_C.ExecuteUbergraph_AthenaChallengeListEntry_Custom
// 0x01C0 (0x01C0 - 0x0000)
struct AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0098)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E0(0x0098)(ConstParm)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDisabled;                            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom) == 0x000008, "Wrong alignment on AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom");
static_assert(sizeof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom) == 0x0001C0, "Wrong size on AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, EntryPoint) == 0x000000, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, Temp_bool_Variable) == 0x000004, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, Temp_byte_Variable) == 0x000005, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, Temp_byte_Variable_1) == 0x000006, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, K2Node_Event_MyGeometry) == 0x000008, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, K2Node_Event_MouseEvent) == 0x0000E0, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_IsUsingTouch_ReturnValue) == 0x000178, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_IsUsingTouch_ReturnValue_1) == 0x000179, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_PlayAnimation_ReturnValue) == 0x000180, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000188, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, K2Node_Event_bIsSelected) == 0x000190, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_PlayAnimation_ReturnValue_1) == 0x000198, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0001A0, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0001A8, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001B0, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, K2Node_Event_bDisabled) == 0x0001B8, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::K2Node_Event_bDisabled' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom, K2Node_Select_Default) == 0x0001B9, "Member 'AthenaChallengeListEntry_Custom_C_ExecuteUbergraph_AthenaChallengeListEntry_Custom::K2Node_Select_Default' has a wrong offset!");

// Function AthenaChallengeListEntry_Custom.AthenaChallengeListEntry_Custom_C.OnMouseEnter
// 0x00D8 (0x00D8 - 0x0000)
struct AthenaChallengeListEntry_Custom_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaChallengeListEntry_Custom_C_OnMouseEnter) == 0x000008, "Wrong alignment on AthenaChallengeListEntry_Custom_C_OnMouseEnter");
static_assert(sizeof(AthenaChallengeListEntry_Custom_C_OnMouseEnter) == 0x0000D8, "Wrong size on AthenaChallengeListEntry_Custom_C_OnMouseEnter");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'AthenaChallengeListEntry_Custom_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'AthenaChallengeListEntry_Custom_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function AthenaChallengeListEntry_Custom.AthenaChallengeListEntry_Custom_C.OnMouseLeave
// 0x0098 (0x0098 - 0x0000)
struct AthenaChallengeListEntry_Custom_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaChallengeListEntry_Custom_C_OnMouseLeave) == 0x000008, "Wrong alignment on AthenaChallengeListEntry_Custom_C_OnMouseLeave");
static_assert(sizeof(AthenaChallengeListEntry_Custom_C_OnMouseLeave) == 0x000098, "Wrong size on AthenaChallengeListEntry_Custom_C_OnMouseLeave");
static_assert(offsetof(AthenaChallengeListEntry_Custom_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'AthenaChallengeListEntry_Custom_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

