#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLocker_ItemInfo

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.ExecuteUbergraph_AthenaLocker_ItemInfo
// 0x01D0 (0x01D0 - 0x0000)
struct AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaLockerInfoRestrictionWarning           Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_6;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_7;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_8;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_9;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFlowDirectionPreference                      Temp_byte_Variable_10;                             // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFlowDirectionPreference                      Temp_byte_Variable_11;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              K2Node_Event_ItemDefinition;                       // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortColorPalette                      CallFunc_GetRarityOrSeriesColors_ReturnValue;      // 0x0094(0x0050)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortColorPalette                      CallFunc_BPGetRarityColorPalette_ReturnValue;      // 0x00EC(0x0050)(NoDestructor)
	int32                                         Temp_int_Variable_4;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShouldShow;                          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_WarningText;                          // 0x0148(0x0018)(ConstParm)
	EAthenaLockerInfoRestrictionWarning           K2Node_Event_WarningType;                          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0174(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAthenaLockerInfoRestrictionWarning           Temp_byte_Variable_12;                             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default_4;                           // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFlowDirectionPreference                      K2Node_Select_Default_6;                           // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_8;                           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo");
static_assert(sizeof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo) == 0x0001D0, "Wrong size on AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, EntryPoint) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable) == 0x000004, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_int_Variable) == 0x000008, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_int_Variable_1) == 0x00000C, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_int_Variable_2) == 0x000010, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_1) == 0x000014, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_struct_Variable) == 0x000018, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_struct_Variable_1) == 0x000028, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_struct_Variable_2) == 0x000038, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_struct_Variable_3) == 0x000048, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_struct_Variable_4) == 0x000058, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable) == 0x000068, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_2) == 0x000069, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_3) == 0x00006A, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_1) == 0x00006B, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_4) == 0x00006C, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_5) == 0x00006D, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_2) == 0x00006E, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_real_Variable) == 0x000070, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_real_Variable_1) == 0x000074, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_3) == 0x000078, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_6) == 0x000079, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_7) == 0x00007A, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_4) == 0x00007B, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_8) == 0x00007C, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_9) == 0x00007D, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_5) == 0x00007E, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_10) == 0x00007F, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_11) == 0x000080, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Event_ItemDefinition) == 0x000088, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Event_ItemDefinition' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_6) == 0x000090, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_GetRarity_ReturnValue) == 0x000091, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_GetRarityOrSeriesColors_ReturnValue) == 0x000094, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_GetRarityOrSeriesColors_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_int_Variable_3) == 0x0000E8, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_BPGetRarityColorPalette_ReturnValue) == 0x0000EC, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_BPGetRarityColorPalette_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_int_Variable_4) == 0x00013C, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Event_bShouldShow) == 0x000140, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Event_bShouldShow' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Event_WarningText) == 0x000148, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Event_WarningText' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Event_WarningType) == 0x000160, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Event_WarningType' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default) == 0x000164, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_MakeStruct_SlateColor) == 0x000174, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_PlayAnimation_ReturnValue) == 0x000188, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_12) == 0x000190, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_13) == 0x000191, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_1) == 0x000194, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_2) == 0x000198, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Event_IsDesignTime) == 0x000199, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_3) == 0x00019A, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0001A0, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A8, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_4) == 0x0001A9, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_5) == 0x0001AA, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_6) == 0x0001AB, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_7) == 0x0001AC, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_8) == 0x0001B0, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x0001B8, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x0001C0, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_SlotAsOverlaySlot_ReturnValue_3) == 0x0001C8, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_SlotAsOverlaySlot_ReturnValue_3' has a wrong offset!");

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.OnItemDefinitionSet
// 0x0008 (0x0008 - 0x0000)
struct AthenaLocker_ItemInfo_C_OnItemDefinitionSet final
{
public:
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_OnItemDefinitionSet) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_OnItemDefinitionSet");
static_assert(sizeof(AthenaLocker_ItemInfo_C_OnItemDefinitionSet) == 0x000008, "Wrong size on AthenaLocker_ItemInfo_C_OnItemDefinitionSet");
static_assert(offsetof(AthenaLocker_ItemInfo_C_OnItemDefinitionSet, ItemDefinition) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_OnItemDefinitionSet::ItemDefinition' has a wrong offset!");

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.OnUpdateAccessRestrictionWarning
// 0x0028 (0x0028 - 0x0000)
struct AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WarningText;                                       // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EAthenaLockerInfoRestrictionWarning           WarningType;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning");
static_assert(sizeof(AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning) == 0x000028, "Wrong size on AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning");
static_assert(offsetof(AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning, bShouldShow) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning::bShouldShow' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning, WarningText) == 0x000008, "Member 'AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning::WarningText' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning, WarningType) == 0x000020, "Member 'AthenaLocker_ItemInfo_C_OnUpdateAccessRestrictionWarning::WarningType' has a wrong offset!");

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaLocker_ItemInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaLocker_ItemInfo_C_PreConstruct");
static_assert(sizeof(AthenaLocker_ItemInfo_C_PreConstruct) == 0x000001, "Wrong size on AthenaLocker_ItemInfo_C_PreConstruct");
static_assert(offsetof(AthenaLocker_ItemInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.UpdateRarityWidgets
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaLocker_ItemInfo_C_UpdateRarityWidgets final
{
public:
	struct FFortColorPalette                      InColor;                                           // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	EFortRarity                                   InRarity;                                          // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemSeriesDefinition*              InSeries;                                          // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HideRarity;                                        // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNullItem_Is_Null_Item;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNullItem_Is_Null_Item_1;                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_UpdateRarityWidgets) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_UpdateRarityWidgets");
static_assert(sizeof(AthenaLocker_ItemInfo_C_UpdateRarityWidgets) == 0x0000A0, "Wrong size on AthenaLocker_ItemInfo_C_UpdateRarityWidgets");
static_assert(offsetof(AthenaLocker_ItemInfo_C_UpdateRarityWidgets, InColor) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_UpdateRarityWidgets::InColor' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_UpdateRarityWidgets, InRarity) == 0x000050, "Member 'AthenaLocker_ItemInfo_C_UpdateRarityWidgets::InRarity' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_UpdateRarityWidgets, InSeries) == 0x000058, "Member 'AthenaLocker_ItemInfo_C_UpdateRarityWidgets::InSeries' has a wrong offset!");
