#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationPickerSortAndFilterBlade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCustomizationPickerSortAndFilterBlade.AthenaCustomizationPickerSortAndFilterBlade_C
// 0x0020 (0x03C0 - 0x03A0)
class UAthenaCustomizationPickerSortAndFilterBlade_C final : public UAthenaCustomizationPickerSortAndFilterBlade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Open;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       FilterByLabel;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SortByLabel;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_HighlightSortOrFilterButton(class UCommonButtonBase* SortOrFilterButton, bool bHighlight);
	void BP_OnArchiveFilteringSet(bool bEnabled);
	void BP_OnBladeClose();
	void BP_OnBladeOpen();
	void BP_OnSortOrFilterButtonCreated(class UCommonButtonBase* NewButton);
	void BP_SetSortOrFilterButtonDisplayName(class UCommonButtonBase* SortOrFilterButton, const class FText& DisplayName);
	void ExecuteUbergraph_AthenaCustomizationPickerSortAndFilterBlade(int32 EntryPoint);
	void Finished_B61EB04E44460529171509A5523A917A();
	class UWidget* NavigateDownFromSortButtons(EUINavigation Navigation_0);
	class UWidget* NavigateUpFromFilterButtons(EUINavigation Navigation_0);
	void UpdateSortAndFilterButtons(bool bBladeOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCustomizationPickerSortAndFilterBlade_C">();
	}
	static class UAthenaCustomizationPickerSortAndFilterBlade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPickerSortAndFilterBlade_C>();
	}
};
static_assert(alignof(UAthenaCustomizationPickerSortAndFilterBlade_C) == 0x000008, "Wrong alignment on UAthenaCustomizationPickerSortAndFilterBlade_C");
static_assert(sizeof(UAthenaCustomizationPickerSortAndFilterBlade_C) == 0x0003C0, "Wrong size on UAthenaCustomizationPickerSortAndFilterBlade_C");
static_assert(offsetof(UAthenaCustomizationPickerSortAndFilterBlade_C, UberGraphFrame) == 0x0003A0, "Member 'UAthenaCustomizationPickerSortAndFilterBlade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerSortAndFilterBlade_C, Anim_Open) == 0x0003A8, "Member 'UAthenaCustomizationPickerSortAndFilterBlade_C::Anim_Open' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerSortAndFilterBlade_C, FilterByLabel) == 0x0003B0, "Member 'UAthenaCustomizationPickerSortAndFilterBlade_C::FilterByLabel' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPickerSortAndFilterBlade_C, SortByLabel) == 0x0003B8, "Member 'UAthenaCustomizationPickerSortAndFilterBlade_C::SortByLabel' has a wrong offset!");

}

