#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaFullScreenQuestMapContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaFullScreenQuestMapContent.AthenaFullScreenQuestMapContent_C
// 0x0038 (0x0670 - 0x0638)
class UAthenaFullScreenQuestMapContent_C final : public UAthenaFullScreenQuestMapContent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MapTransparency;                                   // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowMap;                                           // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disable;                                           // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Punchards_;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_AthenaFullScreenQuestMapContent(int32 EntryPoint);
	void OnChallengeCategoryChanged();
	void OnQuestListGainedFocus();
	void OnQuestListLostFocus();
	void SetEnabled(bool Enabled);
	void ShowMapLayerContainer(const bool bShowing);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaFullScreenQuestMapContent_C">();
	}
	static class UAthenaFullScreenQuestMapContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaFullScreenQuestMapContent_C>();
	}
};
static_assert(alignof(UAthenaFullScreenQuestMapContent_C) == 0x000008, "Wrong alignment on UAthenaFullScreenQuestMapContent_C");
static_assert(sizeof(UAthenaFullScreenQuestMapContent_C) == 0x000670, "Wrong size on UAthenaFullScreenQuestMapContent_C");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, UberGraphFrame) == 0x000638, "Member 'UAthenaFullScreenQuestMapContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, MapTransparency) == 0x000640, "Member 'UAthenaFullScreenQuestMapContent_C::MapTransparency' has a wrong offset!");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, ShowMap) == 0x000648, "Member 'UAthenaFullScreenQuestMapContent_C::ShowMap' has a wrong offset!");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, Disable) == 0x000650, "Member 'UAthenaFullScreenQuestMapContent_C::Disable' has a wrong offset!");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, Intro) == 0x000658, "Member 'UAthenaFullScreenQuestMapContent_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, Image_Punchards_) == 0x000660, "Member 'UAthenaFullScreenQuestMapContent_C::Image_Punchards_' has a wrong offset!");
static_assert(offsetof(UAthenaFullScreenQuestMapContent_C, SafeZone_1) == 0x000668, "Member 'UAthenaFullScreenQuestMapContent_C::SafeZone_1' has a wrong offset!");

}

