#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AthenaMapMarkerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_AthenaMapMarkerBase.B_AthenaMapMarkerBase_C
// 0x01C0 (0x06C0 - 0x0500)
class AB_AthenaMapMarkerBase_C : public AFortPlayerMarkerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PingMarkerProto;                                   // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Target;                                         // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E; // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E; // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E; // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E; // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OnProtoMarkerPlaced;                               // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseProtoMarker;                                   // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MIDProtoMarker;                                    // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFortWorldMarkerData                   MarkerData;                                        // 0x0540(0x0180)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_AthenaMapMarkerBase(int32 EntryPoint);
	void OnMarkerColorChanged(const struct FLinearColor& InColor);
	void OnMarkerPlaced();
	void OnProtoMarkerPlaced__FinishedFunc();
	void OnProtoMarkerPlaced__UpdateFunc();
	void OnSetupMarker(const struct FFortWorldMarkerData& MarkerData_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_AthenaMapMarkerBase_C">();
	}
	static class AB_AthenaMapMarkerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_AthenaMapMarkerBase_C>();
	}
};
static_assert(alignof(AB_AthenaMapMarkerBase_C) == 0x000008, "Wrong alignment on AB_AthenaMapMarkerBase_C");
static_assert(sizeof(AB_AthenaMapMarkerBase_C) == 0x0006C0, "Wrong size on AB_AthenaMapMarkerBase_C");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, UberGraphFrame) == 0x000500, "Member 'AB_AthenaMapMarkerBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, PingMarkerProto) == 0x000508, "Member 'AB_AthenaMapMarkerBase_C::PingMarkerProto' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, SM_Target) == 0x000510, "Member 'AB_AthenaMapMarkerBase_C::SM_Target' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E) == 0x000518, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_RampPow_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E) == 0x00051C, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_Pinch_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E) == 0x000520, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced_Glow_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E) == 0x000524, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced__Direction_83EEC58A4783B077FB03728C433B4B7E' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, OnProtoMarkerPlaced) == 0x000528, "Member 'AB_AthenaMapMarkerBase_C::OnProtoMarkerPlaced' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, bUseProtoMarker) == 0x000530, "Member 'AB_AthenaMapMarkerBase_C::bUseProtoMarker' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MIDProtoMarker) == 0x000538, "Member 'AB_AthenaMapMarkerBase_C::MIDProtoMarker' has a wrong offset!");
static_assert(offsetof(AB_AthenaMapMarkerBase_C, MarkerData) == 0x000540, "Member 'AB_AthenaMapMarkerBase_C::MarkerData' has a wrong offset!");

}

