#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_PartModifier_Generic

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SoundLibrary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.ActuallyChangedWeaponType
// 0x0001 (0x0001 - 0x0000)
struct B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType final
{
public:
	EFortItemType                                 New_Type;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType) == 0x000001, "Wrong alignment on B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType) == 0x000001, "Wrong size on B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType, New_Type) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_ActuallyChangedWeaponType::New_Type' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.DEBUG Print String
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_PartModifier_Generic_C_DEBUG_Print_String final
{
public:
	class FString                                 Input_String;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_DEBUG_Print_String) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_DEBUG_Print_String");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_DEBUG_Print_String) == 0x000010, "Wrong size on B_Athena_PartModifier_Generic_C_DEBUG_Print_String");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_DEBUG_Print_String, Input_String) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_DEBUG_Print_String::Input_String' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.ExecuteUbergraph_B_Athena_PartModifier_Generic
// 0x0208 (0x0208 - 0x0000)
struct B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetIdleFXSocketName_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_OldLocation;                    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldVelocity;                    // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_2;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortItemDefinition*              K2Node_CustomEvent_MontageItemDef_1;               // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PawnEmoting_1;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFortItemDefinition*              K2Node_CustomEvent_MontageItemDef;                 // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PawnEmoting;                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Event_NewType;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Event_OldType;                              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_CustomEvent_New_Type;                       // 0x00D2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_3;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Stat_Name_1;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stat_Value_2;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements; // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_State_Name;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stat_Value_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Stat_Name;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stat_Value;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_STAGE_Num_Being_Activated;      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NumPlayersLeft;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayersLeft                           CallFunc_GetPlayersLeft_ReturnValue;               // 0x0140(0x000C)(NoDestructor)
	TDelegate<void(int32 NumPlayersLeft)>         K2Node_CreateDelegate_OutputDelegate_2;            // 0x014C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Total_Players_Left;             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Select_Default;                             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_StatName;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements_1; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements_2; // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x018C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_Event_VehicleEntered;                       // 0x0198(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_2;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_3;        // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_4;    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayLibrarySound_Success;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_PlayLibrarySound_Output;                  // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic) == 0x000208, "Wrong size on B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, EntryPoint) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetIdleVFXComponent_ReturnValue) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetIdleVFXComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetIdleFXSocketName_ReturnValue) == 0x000018, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetIdleFXSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000028, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_bool_Option_B___If_false__use_Option_A_Variable) == 0x000029, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_bool_Option_B___If_false__use_Option_A_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000030, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000038, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Array_Index_Variable) == 0x000044, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_DeltaSeconds) == 0x000048, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_OldLocation) == 0x000050, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_OldLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_OldVelocity) == 0x000068, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_OldVelocity' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetAssociatedPlayerPawn_ReturnValue_1) == 0x000080, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetAssociatedPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Array_Index_Variable_1) == 0x000088, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetIdleVFXComponent_ReturnValue_1) == 0x000090, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetIdleVFXComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetAssociatedPlayerPawn_ReturnValue_2) == 0x000098, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetAssociatedPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1) == 0x0000A0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_MontageItemDef_1) == 0x0000B0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_MontageItemDef_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_PawnEmoting_1) == 0x0000B8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_PawnEmoting_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_MontageItemDef) == 0x0000C0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_MontageItemDef' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_PawnEmoting) == 0x0000C8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_PawnEmoting' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_Event_NewType) == 0x0000D0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_Event_NewType' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_Event_OldType) == 0x0000D1, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_Event_OldType' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_New_Type) == 0x0000D2, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_New_Type' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0000D3, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetAssociatedPlayerPawn_ReturnValue_3) == 0x0000D8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetAssociatedPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_Stat_Name_1) == 0x0000E0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_Stat_Name_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_Stat_Value_2) == 0x0000E4, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_Stat_Value_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Loop_Counter_Variable) == 0x0000E8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Array_Get_Item) == 0x0000EC, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Add_IntInt_ReturnValue) == 0x0000F4, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements) == 0x000104, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_State_Name) == 0x000108, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_State_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_Stat_Value_1) == 0x00010C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_Stat_Value_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_Stat_Name) == 0x000110, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_Stat_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_Stat_Value) == 0x000114, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_Stat_Value' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_STAGE_Num_Being_Activated) == 0x000118, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_STAGE_Num_Being_Activated' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Loop_Counter_Variable_1) == 0x00011C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Array_Index_Variable_2) == 0x000120, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Add_IntInt_ReturnValue_1) == 0x000124, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetGameState_ReturnValue) == 0x000128, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_DynamicCast_AsAthena_Game_State) == 0x000130, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_DynamicCast_AsAthena_Game_State' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_NumPlayersLeft) == 0x00013C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_NumPlayersLeft' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetPlayersLeft_ReturnValue) == 0x000140, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetPlayersLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CreateDelegate_OutputDelegate_2) == 0x00014C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x000158, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_Total_Players_Left) == 0x00015C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_Total_Players_Left' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Array_Get_Item_2) == 0x000164, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Array_Length_ReturnValue_1) == 0x000168, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Array_Length_ReturnValue_2) == 0x00016C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Less_IntInt_ReturnValue_1) == 0x000171, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_bool_Variable) == 0x000172, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_name_Variable) == 0x000174, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Variable) == 0x000178, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_Select_Default) == 0x00017C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_StatName) == 0x000180, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_StatName' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CustomEvent_StatValue) == 0x000184, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CustomEvent_StatValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements_1) == 0x000188, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements_2) == 0x000189, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Is_Stage_Stat_Requirements_Met_Passed_Requirements_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CreateDelegate_OutputDelegate_3) == 0x00018C, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_Event_VehicleEntered) == 0x000198, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_Event_VehicleEntered' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetIdleVFXComponent_ReturnValue_2) == 0x0001A8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetIdleVFXComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_IsInFrontend_ReturnValue) == 0x0001B0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetIdleVFXComponent_ReturnValue_3) == 0x0001B8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetIdleVFXComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, Temp_int_Loop_Counter_Variable_2) == 0x0001C0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001C4, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001C8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_GetAssociatedPlayerPawn_ReturnValue_4) == 0x0001D0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_GetAssociatedPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_PlayLibrarySound_Success) == 0x0001D8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_PlayLibrarySound_Success' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_PlayLibrarySound_Output) == 0x0001E0, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_PlayLibrarySound_Output' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_WatchCosmeticStat_ReturnValue) == 0x0001F8, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_WatchCosmeticStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Handle Potential New Weapon Type
// 0x0028 (0x0028 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type final
{
public:
	EFortItemType                                 Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x001C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type) == 0x000028, "Wrong size on B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, Type) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::Type' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000019, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_Map_Find_Value) == 0x00001C, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000024, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Hidden Hand Check
// 0x0070 (0x0070 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Hidden_Hand_Check final
{
public:
	TArray<class UFXSystemComponent*>             FX_Systems_associated_with_Hands;                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	const class AFortWeapon*                      New_Weapon;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AFortWeapon*                      Old_Weapon;                                        // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Only_Set_Niagara_Bool_Variable;                    // 0x0020(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isHandHidden;                                      // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1; // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_Hidden_Hand_Check");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check) == 0x000070, "Wrong size on B_Athena_PartModifier_Generic_C_Hidden_Hand_Check");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, FX_Systems_associated_with_Hands) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::FX_Systems_associated_with_Hands' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, New_Weapon) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::New_Weapon' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Old_Weapon) == 0x000018, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Old_Weapon' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Only_Set_Niagara_Bool_Variable) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Only_Set_Niagara_Bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, isHandHidden) == 0x000021, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::isHandHidden' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue) == 0x000023, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1) == 0x000025, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue_2) == 0x000030, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue_3) == 0x000034, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000039, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
