#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CreatureSoundLibraryContext

#include "Basic.hpp"

#include "SoundLibrary_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_CreatureSoundLibraryContext.B_CreatureSoundLibraryContext_C.PlaySound
// 0x0138 (0x0138 - 0x0000)
struct B_CreatureSoundLibraryContext_C_PlaySound final
{
public:
	class USoundBase*                             sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSoundLibraryPlaySoundResult           OutResults;                                        // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Wildlife_Parent_C*            K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput;          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetConverterPawn_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput_1;        // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1;       // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreatureSoundLibraryContext_C_PlaySound) == 0x000008, "Wrong alignment on B_CreatureSoundLibraryContext_C_PlaySound");
static_assert(sizeof(B_CreatureSoundLibraryContext_C_PlaySound) == 0x000138, "Wrong size on B_CreatureSoundLibraryContext_C_PlaySound");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, sound) == 0x000000, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::sound' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, OutResults) == 0x000008, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::OutResults' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, ReturnValue) == 0x000030, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, Temp_real_Variable) == 0x000038, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_MatchesTag_ReturnValue) == 0x000040, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, Temp_real_Variable_1) == 0x000048, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, Temp_byte_Variable) == 0x000058, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent) == 0x000060, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue) == 0x000069, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_GetTeamAffiliationForActorToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000070, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000078, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, K2Node_Select_Default) == 0x000080, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000090, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SetBoolParameter_self_CastInput) == 0x000098, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SetBoolParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_GetConverterPawn_ReturnValue) == 0x0000B0, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_GetConverterPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SetFloatParameter_self_CastInput) == 0x0000C8, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000D8, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_GetMovementComponent_ReturnValue) == 0x0000E0, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SetBoolParameter_self_CastInput_1) == 0x0000E8, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SetBoolParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000F8, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_VSize2D_ReturnValue) == 0x000108, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_MapRangeClamped_ReturnValue) == 0x000110, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000118, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast) == 0x000128, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x00012C, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_CreatureSoundLibraryContext_C_PlaySound, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x000130, "Member 'B_CreatureSoundLibraryContext_C_PlaySound::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");

}

