#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassBase

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "BattlePassBase_structs.hpp"
#include "BlueprintContext_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class BattlePassBase.BattlePassSubPageInterface
// 0x0000 (0x0028 - 0x0028)
class IBattlePassSubPageInterface final : public IInterface
{
public:
	void OnEnterSubPage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassSubPageInterface">();
	}
	static class IBattlePassSubPageInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattlePassSubPageInterface>();
	}
};
static_assert(alignof(IBattlePassSubPageInterface) == 0x000008, "Wrong alignment on IBattlePassSubPageInterface");
static_assert(sizeof(IBattlePassSubPageInterface) == 0x000028, "Wrong size on IBattlePassSubPageInterface");

// Class BattlePassBase.BattlePassLandingPageBase
// 0x0140 (0x04E8 - 0x03A8)
class UBattlePassLandingPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x110];                                    // 0x03A8(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassLandingPageButton*           LastHoveredPageButton;                             // 0x04B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroupBase*                 LandingPageButtonGroupBase;                        // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C8[0x20];                                     // 0x04C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassLandingPageBase">();
	}
	static class UBattlePassLandingPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageBase>();
	}
};
static_assert(alignof(UBattlePassLandingPageBase) == 0x000008, "Wrong alignment on UBattlePassLandingPageBase");
static_assert(sizeof(UBattlePassLandingPageBase) == 0x0004E8, "Wrong size on UBattlePassLandingPageBase");
static_assert(offsetof(UBattlePassLandingPageBase, LastHoveredPageButton) == 0x0004B8, "Member 'UBattlePassLandingPageBase::LastHoveredPageButton' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageBase, LandingPageButtonGroupBase) == 0x0004C0, "Member 'UBattlePassLandingPageBase::LandingPageButtonGroupBase' has a wrong offset!");

// Class BattlePassBase.BattlePassLandingPageButton
// 0x0280 (0x1660 - 0x13E0)
class UBattlePassLandingPageButton : public UCommonButtonBase
{
public:
	EBattlePassView                               SubPageType;                                       // 0x13E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBattlePassFeatures                           FeatureType;                                       // 0x13E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13E2[0x6];                                     // 0x13E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageEntryPreviewInfo PreviewInfo;                                       // 0x13E8(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bNeedsBattlePass;                                  // 0x1478(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1479[0x7];                                     // 0x1479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortChallengeBundleScheduleDefinition* DelayQuestSchedule;                                // 0x1480(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DelayDaysSinceSeasonStart;                         // 0x1488(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148C[0x4];                                     // 0x148C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    RequiredItem;                                      // 0x1490(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBangWrapper_NUI*                   BangWrapper;                                       // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsesTelemetry;                                    // 0x14A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14A1[0x3];                                     // 0x14A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              Telemetry_Size;                                    // 0x14A4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              Telemetry_Position;                                // 0x14AC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14B4[0x4];                                     // 0x14B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageButtonTexts      DefaultTexts;                                      // 0x14B8(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FBattlePassLandingPageButtonTexts      DelayedTexts;                                      // 0x1500(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FBattlePassLandingPageButtonTexts      SubscribedTexts;                                   // 0x1548(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FBattlePassLandingPageButtonDisplayBehaviorData DisplayBehaviorData;                               // 0x1590(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_15A8[0xB8];                                    // 0x15A8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDisplayDetailsUpdated(const struct FBattlePassLandingPageButtonDisplayDetails& NewDisplayDetails);
	void OnSetTileImageMaterial(class UMaterialInstance* Material);
	void OnShowDisplayDetails();
	void OnSubscriptionOwnershipUpdated(const bool bOwnsSubsciption);
	void OnSubscriptionTextureLoaded(class UTexture2D* Texture);

	const struct FBattlePassLandingPageButtonDisplayDetails GetBattlePassDisplayDetails() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassLandingPageButton">();
	}
	static class UBattlePassLandingPageButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageButton>();
	}
};
static_assert(alignof(UBattlePassLandingPageButton) == 0x000010, "Wrong alignment on UBattlePassLandingPageButton");
static_assert(sizeof(UBattlePassLandingPageButton) == 0x001660, "Wrong size on UBattlePassLandingPageButton");
static_assert(offsetof(UBattlePassLandingPageButton, SubPageType) == 0x0013E0, "Member 'UBattlePassLandingPageButton::SubPageType' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, FeatureType) == 0x0013E1, "Member 'UBattlePassLandingPageButton::FeatureType' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, PreviewInfo) == 0x0013E8, "Member 'UBattlePassLandingPageButton::PreviewInfo' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, bNeedsBattlePass) == 0x001478, "Member 'UBattlePassLandingPageButton::bNeedsBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DelayQuestSchedule) == 0x001480, "Member 'UBattlePassLandingPageButton::DelayQuestSchedule' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DelayDaysSinceSeasonStart) == 0x001488, "Member 'UBattlePassLandingPageButton::DelayDaysSinceSeasonStart' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, RequiredItem) == 0x001490, "Member 'UBattlePassLandingPageButton::RequiredItem' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, BangWrapper) == 0x001498, "Member 'UBattlePassLandingPageButton::BangWrapper' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, bUsesTelemetry) == 0x0014A0, "Member 'UBattlePassLandingPageButton::bUsesTelemetry' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, Telemetry_Size) == 0x0014A4, "Member 'UBattlePassLandingPageButton::Telemetry_Size' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, Telemetry_Position) == 0x0014AC, "Member 'UBattlePassLandingPageButton::Telemetry_Position' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DefaultTexts) == 0x0014B8, "Member 'UBattlePassLandingPageButton::DefaultTexts' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DelayedTexts) == 0x001500, "Member 'UBattlePassLandingPageButton::DelayedTexts' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, SubscribedTexts) == 0x001548, "Member 'UBattlePassLandingPageButton::SubscribedTexts' has a wrong offset!");
static_assert(offsetof(UBattlePassLandingPageButton, DisplayBehaviorData) == 0x001590, "Member 'UBattlePassLandingPageButton::DisplayBehaviorData' has a wrong offset!");

// Class BattlePassBase.FortBattlePassResourcesWidgetBase
// 0x0010 (0x02A0 - 0x0290)
class UFortBattlePassResourcesWidgetBase : public UFortGlobalSeasonResourceWidget
{
public:
	TSubclassOf<class UFortBattlePassResourceCounter> ResourceCounterClass;                              // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_ResourceCounters;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnShowMoreInfo(bool bShouldShowMoreInfo);
	void ShowResourcesInfoModal();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassResourcesWidgetBase">();
	}
	static class UFortBattlePassResourcesWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourcesWidgetBase>();
	}
};
static_assert(alignof(UFortBattlePassResourcesWidgetBase) == 0x000008, "Wrong alignment on UFortBattlePassResourcesWidgetBase");
static_assert(sizeof(UFortBattlePassResourcesWidgetBase) == 0x0002A0, "Wrong size on UFortBattlePassResourcesWidgetBase");
static_assert(offsetof(UFortBattlePassResourcesWidgetBase, ResourceCounterClass) == 0x000290, "Member 'UFortBattlePassResourcesWidgetBase::ResourceCounterClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourcesWidgetBase, EntryBox_ResourceCounters) == 0x000298, "Member 'UFortBattlePassResourcesWidgetBase::EntryBox_ResourceCounters' has a wrong offset!");

// Class BattlePassBase.BattlePassRewardPageBase
// 0x0108 (0x04B0 - 0x03A8)
class UBattlePassRewardPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x108];                                    // 0x03A8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassRewardPageBase">();
	}
	static class UBattlePassRewardPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassRewardPageBase>();
	}
};
static_assert(alignof(UBattlePassRewardPageBase) == 0x000008, "Wrong alignment on UBattlePassRewardPageBase");
static_assert(sizeof(UBattlePassRewardPageBase) == 0x0004B0, "Wrong size on UBattlePassRewardPageBase");

// Class BattlePassBase.FortBattlePassCustomSkinCategoryTile
// 0x00B8 (0x0320 - 0x0268)
class UFortBattlePassCustomSkinCategoryTile : public UUserWidget
{
public:
	uint8                                         Pad_268[0x20];                                     // 0x0268(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgressBar*                           ProgressBar;                                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Items;                         // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         Text_CategoryTitle;                                // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassTile*                    PreviewedTile;                                     // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OwnedRewards;                                      // 0x02A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AC[0x74];                                     // 0x02AC(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FocusTile(const int32 Index_0);
	void OnLockedProgressUpdated(const int32 CurrentlyOwnedBeforeCategory, const int32 TotalRewardsBeforeCategory, const float LockedProgress);
	void OnLockedStateChanged(const bool bCategoryLocked);
	void OnOwnedTilesUpdated(const int32 CurrentlyOwnedRewards, const int32 TotalRewards, const float CategoryProgress);
	void SetPreviewedTile(const int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCustomSkinCategoryTile">();
	}
	static class UFortBattlePassCustomSkinCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinCategoryTile>();
	}
};
static_assert(alignof(UFortBattlePassCustomSkinCategoryTile) == 0x000008, "Wrong alignment on UFortBattlePassCustomSkinCategoryTile");
static_assert(sizeof(UFortBattlePassCustomSkinCategoryTile) == 0x000320, "Wrong size on UFortBattlePassCustomSkinCategoryTile");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, ProgressBar) == 0x000288, "Member 'UFortBattlePassCustomSkinCategoryTile::ProgressBar' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, FortDynamicEntryBox_Items) == 0x000290, "Member 'UFortBattlePassCustomSkinCategoryTile::FortDynamicEntryBox_Items' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, Text_CategoryTitle) == 0x000298, "Member 'UFortBattlePassCustomSkinCategoryTile::Text_CategoryTitle' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, PreviewedTile) == 0x0002A0, "Member 'UFortBattlePassCustomSkinCategoryTile::PreviewedTile' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinCategoryTile, OwnedRewards) == 0x0002A8, "Member 'UFortBattlePassCustomSkinCategoryTile::OwnedRewards' has a wrong offset!");

// Class BattlePassBase.BattlePassUIGameFeatureAction
// 0x0078 (0x00A0 - 0x0028)
class UBattlePassUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   BattlePassScreenClass;                             // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   BattlePassResourceWidgetClass;                     // 0x0050(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   BattlePassInfoModalClass;                          // 0x0078(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassUIGameFeatureAction">();
	}
	static class UBattlePassUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassUIGameFeatureAction>();
	}
};
static_assert(alignof(UBattlePassUIGameFeatureAction) == 0x000008, "Wrong alignment on UBattlePassUIGameFeatureAction");
static_assert(sizeof(UBattlePassUIGameFeatureAction) == 0x0000A0, "Wrong size on UBattlePassUIGameFeatureAction");
static_assert(offsetof(UBattlePassUIGameFeatureAction, BattlePassScreenClass) == 0x000028, "Member 'UBattlePassUIGameFeatureAction::BattlePassScreenClass' has a wrong offset!");
static_assert(offsetof(UBattlePassUIGameFeatureAction, BattlePassResourceWidgetClass) == 0x000050, "Member 'UBattlePassUIGameFeatureAction::BattlePassResourceWidgetClass' has a wrong offset!");
static_assert(offsetof(UBattlePassUIGameFeatureAction, BattlePassInfoModalClass) == 0x000078, "Member 'UBattlePassUIGameFeatureAction::BattlePassInfoModalClass' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCustomSkinPageBase
// 0x01B8 (0x0560 - 0x03A8)
class UFortBattlePassCustomSkinPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x190];                                    // 0x03A8(0x0190)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Categories;                              // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Categories;                    // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassEnabledInputData*            EquipEnabledData;                                  // 0x0550(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCustomSkinPageBase">();
	}
	static class UFortBattlePassCustomSkinPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinPageBase>();
	}
};
static_assert(alignof(UFortBattlePassCustomSkinPageBase) == 0x000008, "Wrong alignment on UFortBattlePassCustomSkinPageBase");
static_assert(sizeof(UFortBattlePassCustomSkinPageBase) == 0x000560, "Wrong size on UFortBattlePassCustomSkinPageBase");
static_assert(offsetof(UFortBattlePassCustomSkinPageBase, ScrollBox_Categories) == 0x000538, "Member 'UFortBattlePassCustomSkinPageBase::ScrollBox_Categories' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinPageBase, FortDynamicEntryBox_Categories) == 0x000540, "Member 'UFortBattlePassCustomSkinPageBase::FortDynamicEntryBox_Categories' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCustomSkinPageBase, EquipEnabledData) == 0x000550, "Member 'UFortBattlePassCustomSkinPageBase::EquipEnabledData' has a wrong offset!");

// Class BattlePassBase.FortBattlePassBulkBuyPageBase
// 0x0188 (0x0530 - 0x03A8)
class UFortBattlePassBulkBuyPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x108];                                    // 0x03A8(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Addition;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       DynamicEntryBox_TilesEntries;                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_BottomButtons;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyLevels;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_ClaimReward;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x04E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E8[0x18];                                     // 0x04E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonItemDefinition*            SeasonItemDefinition;                              // 0x0500(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTile*                    FocusedReward;                                     // 0x0508(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_510[0x18];                                     // 0x0510(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Pages;                                   // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleUserScrolled(float ScrollAmount);
	void OnCostChanged(const int32 Cost);
	void OnPageRangeChanged(const int32 FromPage, const int32 ToPage);
	void OnRewardCountChanged(const int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassBulkBuyPageBase">();
	}
	static class UFortBattlePassBulkBuyPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassBulkBuyPageBase>();
	}
};
static_assert(alignof(UFortBattlePassBulkBuyPageBase) == 0x000008, "Wrong alignment on UFortBattlePassBulkBuyPageBase");
static_assert(sizeof(UFortBattlePassBulkBuyPageBase) == 0x000530, "Wrong size on UFortBattlePassBulkBuyPageBase");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_Addition) == 0x0004B0, "Member 'UFortBattlePassBulkBuyPageBase::Button_Addition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_Subtraction) == 0x0004B8, "Member 'UFortBattlePassBulkBuyPageBase::Button_Subtraction' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, DynamicEntryBox_TilesEntries) == 0x0004C0, "Member 'UFortBattlePassBulkBuyPageBase::DynamicEntryBox_TilesEntries' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Switcher_BottomButtons) == 0x0004C8, "Member 'UFortBattlePassBulkBuyPageBase::Switcher_BottomButtons' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_BuyLevels) == 0x0004D0, "Member 'UFortBattlePassBulkBuyPageBase::Button_BuyLevels' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, Button_ClaimReward) == 0x0004D8, "Member 'UFortBattlePassBulkBuyPageBase::Button_ClaimReward' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, SeasonData_BattleStar) == 0x0004E0, "Member 'UFortBattlePassBulkBuyPageBase::SeasonData_BattleStar' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, SeasonItemDefinition) == 0x000500, "Member 'UFortBattlePassBulkBuyPageBase::SeasonItemDefinition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, FocusedReward) == 0x000508, "Member 'UFortBattlePassBulkBuyPageBase::FocusedReward' has a wrong offset!");
static_assert(offsetof(UFortBattlePassBulkBuyPageBase, ScrollBox_Pages) == 0x000528, "Member 'UFortBattlePassBulkBuyPageBase::ScrollBox_Pages' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCheckBoxButton
// 0x0010 (0x13F0 - 0x13E0)
class UFortBattlePassCheckBoxButton : public UCommonButtonBase
{
public:
	uint8                                         Pad_13E0[0x10];                                    // 0x13E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnStateChanged(const bool bNewIsChecked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCheckBoxButton">();
	}
	static class UFortBattlePassCheckBoxButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCheckBoxButton>();
	}
};
static_assert(alignof(UFortBattlePassCheckBoxButton) == 0x000010, "Wrong alignment on UFortBattlePassCheckBoxButton");
static_assert(sizeof(UFortBattlePassCheckBoxButton) == 0x0013F0, "Wrong size on UFortBattlePassCheckBoxButton");

// Class BattlePassBase.FortBattlePassContext
// 0x0078 (0x00A8 - 0x0030)
class UFortBattlePassContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortPersistentResourceItemDefinition*> CustomizationPageSeasonalResources;                // 0x0038(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortPersistentResourceItemDefinition*> AllSeasonalResources;                              // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<ERewardPageType, struct FSeasonalResourceList> RewardPageSeasonalResources;                       // 0x0058(0x0050)(NativeAccessSpecifierPrivate)

public:
	bool CanPurchaseBattlePassLevel() const;
	class FText GetCurrentChapterAsText(const bool bFullText) const;
	class FText GetCurrentSeasonNumberAsText(const bool bFullText) const;
	class FText GetDefaultDisclaimerText() const;
	class FText GetLevelPurchaseDisclaimerText() const;
	TArray<struct FSeasonCurrencyMcpData> GetSeasonalCurrencies() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassContext">();
	}
	static class UFortBattlePassContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassContext>();
	}
};
static_assert(alignof(UFortBattlePassContext) == 0x000008, "Wrong alignment on UFortBattlePassContext");
static_assert(sizeof(UFortBattlePassContext) == 0x0000A8, "Wrong size on UFortBattlePassContext");
static_assert(offsetof(UFortBattlePassContext, CustomizationPageSeasonalResources) == 0x000038, "Member 'UFortBattlePassContext::CustomizationPageSeasonalResources' has a wrong offset!");
static_assert(offsetof(UFortBattlePassContext, AllSeasonalResources) == 0x000048, "Member 'UFortBattlePassContext::AllSeasonalResources' has a wrong offset!");
static_assert(offsetof(UFortBattlePassContext, RewardPageSeasonalResources) == 0x000058, "Member 'UFortBattlePassContext::RewardPageSeasonalResources' has a wrong offset!");

// Class BattlePassBase.FortBattlePassCurrencyPanel
// 0x0040 (0x02E0 - 0x02A0)
class UFortBattlePassCurrencyPanel final : public UFortBattlePassResourcesWidgetBase
{
public:
	class UHorizontalBox*                         HBox_BattleStarContainer;                          // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BattleStar;                                   // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HBox_CustomSkinContainer;                          // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_CustomSkin;                                   // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x20];                                     // 0x02C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassCurrencyPanel">();
	}
	static class UFortBattlePassCurrencyPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCurrencyPanel>();
	}
};
static_assert(alignof(UFortBattlePassCurrencyPanel) == 0x000008, "Wrong alignment on UFortBattlePassCurrencyPanel");
static_assert(sizeof(UFortBattlePassCurrencyPanel) == 0x0002E0, "Wrong size on UFortBattlePassCurrencyPanel");
static_assert(offsetof(UFortBattlePassCurrencyPanel, HBox_BattleStarContainer) == 0x0002A0, "Member 'UFortBattlePassCurrencyPanel::HBox_BattleStarContainer' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCurrencyPanel, Text_BattleStar) == 0x0002A8, "Member 'UFortBattlePassCurrencyPanel::Text_BattleStar' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCurrencyPanel, HBox_CustomSkinContainer) == 0x0002B0, "Member 'UFortBattlePassCurrencyPanel::HBox_CustomSkinContainer' has a wrong offset!");
static_assert(offsetof(UFortBattlePassCurrencyPanel, Text_CustomSkin) == 0x0002B8, "Member 'UFortBattlePassCurrencyPanel::Text_CustomSkin' has a wrong offset!");

// Class BattlePassBase.FortBattlePassDynamicIcon
// 0x0058 (0x02C0 - 0x0268)
class UFortBattlePassDynamicIcon : public UUserWidget
{
public:
	TSoftObjectPtr<class UObject>                 BattlePassDefaultIcon;                             // 0x0268(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObject>                 BattlePassOwnedIcon;                               // 0x0290(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                         LazyImage_BattlePassIcon;                          // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBattlePassInfoUpdated(const bool bOwnsBattlePass) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassDynamicIcon">();
	}
	static class UFortBattlePassDynamicIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassDynamicIcon>();
	}
};
static_assert(alignof(UFortBattlePassDynamicIcon) == 0x000008, "Wrong alignment on UFortBattlePassDynamicIcon");
static_assert(sizeof(UFortBattlePassDynamicIcon) == 0x0002C0, "Wrong size on UFortBattlePassDynamicIcon");
static_assert(offsetof(UFortBattlePassDynamicIcon, BattlePassDefaultIcon) == 0x000268, "Member 'UFortBattlePassDynamicIcon::BattlePassDefaultIcon' has a wrong offset!");
static_assert(offsetof(UFortBattlePassDynamicIcon, BattlePassOwnedIcon) == 0x000290, "Member 'UFortBattlePassDynamicIcon::BattlePassOwnedIcon' has a wrong offset!");
static_assert(offsetof(UFortBattlePassDynamicIcon, LazyImage_BattlePassIcon) == 0x0002B8, "Member 'UFortBattlePassDynamicIcon::LazyImage_BattlePassIcon' has a wrong offset!");

// Class BattlePassBase.FortBattlePassLevelCount
// 0x0010 (0x0278 - 0x0268)
class UFortBattlePassLevelCount : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_LevelCount;                                   // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassLevelCount">();
	}
	static class UFortBattlePassLevelCount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassLevelCount>();
	}
};
static_assert(alignof(UFortBattlePassLevelCount) == 0x000008, "Wrong alignment on UFortBattlePassLevelCount");
static_assert(sizeof(UFortBattlePassLevelCount) == 0x000278, "Wrong size on UFortBattlePassLevelCount");
static_assert(offsetof(UFortBattlePassLevelCount, Text_LevelCount) == 0x000268, "Member 'UFortBattlePassLevelCount::Text_LevelCount' has a wrong offset!");

// Class BattlePassBase.FortBattlePassPrerequisiteHeader
// 0x0008 (0x0270 - 0x0268)
class UFortBattlePassPrerequisiteHeader : public UUserWidget
{
public:
	class UTextBlock*                             Text_Prerequisite;                                 // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassPrerequisiteHeader">();
	}
	static class UFortBattlePassPrerequisiteHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassPrerequisiteHeader>();
	}
};
static_assert(alignof(UFortBattlePassPrerequisiteHeader) == 0x000008, "Wrong alignment on UFortBattlePassPrerequisiteHeader");
static_assert(sizeof(UFortBattlePassPrerequisiteHeader) == 0x000270, "Wrong size on UFortBattlePassPrerequisiteHeader");
static_assert(offsetof(UFortBattlePassPrerequisiteHeader, Text_Prerequisite) == 0x000268, "Member 'UFortBattlePassPrerequisiteHeader::Text_Prerequisite' has a wrong offset!");

// Class BattlePassBase.FortBattlePassPurchaseResourcesWidget
// 0x00C0 (0x0468 - 0x03A8)
class UFortBattlePassPurchaseResourcesWidget : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Addition;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BatchAddition;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BatchSubtraction;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_PurchaseButtons;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_Purchase;                                   // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ReloadMtx;                                  // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassCheckBoxButton*          CheckBox_Bundle;                                   // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentLevel;                                      // 0x0408(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOfferActive;                                    // 0x040C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentVBucks;                                     // 0x0410(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentBattleStars;                                // 0x0414(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BatchNum;                                          // 0x0418(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOfferUnavailable;                                 // 0x041C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBundleLevel;                                    // 0x0420(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxLevel;                                          // 0x0424(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxLevelPurchases;                                 // 0x0428(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BundleAmount;                                      // 0x042C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                    LevelPreviewItem;                                  // 0x0430(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemData_BattleStar*       BattleStarData;                                    // 0x0438(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x28];                                     // 0x0440(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& OfferId);
	void HandlePurchaseMultiComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const TArray<class FString>& OfferIdList);
	bool IsReloadMtxEnabled();
	void OnAmountChangeButtonClicked();
	void OnOfferUnavailable();
	void OnPurchaseAmountChanged(const int32 NewAmount, const int32 LevelsLeft);
	void OnTotalPriceChanged(const int32 NewPrice);
	void OnUpdatePageUnlockText(const class FText& PageUnlockText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassPurchaseResourcesWidget">();
	}
	static class UFortBattlePassPurchaseResourcesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassPurchaseResourcesWidget>();
	}
};
static_assert(alignof(UFortBattlePassPurchaseResourcesWidget) == 0x000008, "Wrong alignment on UFortBattlePassPurchaseResourcesWidget");
static_assert(sizeof(UFortBattlePassPurchaseResourcesWidget) == 0x000468, "Wrong size on UFortBattlePassPurchaseResourcesWidget");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Addition) == 0x0003B0, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Addition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_BatchAddition) == 0x0003B8, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_BatchAddition' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Subtraction) == 0x0003C0, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Subtraction' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_BatchSubtraction) == 0x0003C8, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_BatchSubtraction' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Switcher_PurchaseButtons) == 0x0003D0, "Member 'UFortBattlePassPurchaseResourcesWidget::Switcher_PurchaseButtons' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Purchase) == 0x0003D8, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Purchase' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_GetVBucks) == 0x0003E0, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_GetVBucks' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_ReloadMtx) == 0x0003E8, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_ReloadMtx' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_Back) == 0x0003F0, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_Back' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CheckBox_Bundle) == 0x0003F8, "Member 'UFortBattlePassPurchaseResourcesWidget::CheckBox_Bundle' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, Button_CloseMobile) == 0x000400, "Member 'UFortBattlePassPurchaseResourcesWidget::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentLevel) == 0x000408, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, bIsOfferActive) == 0x00040C, "Member 'UFortBattlePassPurchaseResourcesWidget::bIsOfferActive' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentVBucks) == 0x000410, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentVBucks' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, CurrentBattleStars) == 0x000414, "Member 'UFortBattlePassPurchaseResourcesWidget::CurrentBattleStars' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, BatchNum) == 0x000418, "Member 'UFortBattlePassPurchaseResourcesWidget::BatchNum' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, bOfferUnavailable) == 0x00041C, "Member 'UFortBattlePassPurchaseResourcesWidget::bOfferUnavailable' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, MaxBundleLevel) == 0x000420, "Member 'UFortBattlePassPurchaseResourcesWidget::MaxBundleLevel' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, MaxLevel) == 0x000424, "Member 'UFortBattlePassPurchaseResourcesWidget::MaxLevel' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, MaxLevelPurchases) == 0x000428, "Member 'UFortBattlePassPurchaseResourcesWidget::MaxLevelPurchases' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, BundleAmount) == 0x00042C, "Member 'UFortBattlePassPurchaseResourcesWidget::BundleAmount' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, LevelPreviewItem) == 0x000430, "Member 'UFortBattlePassPurchaseResourcesWidget::LevelPreviewItem' has a wrong offset!");
static_assert(offsetof(UFortBattlePassPurchaseResourcesWidget, BattleStarData) == 0x000438, "Member 'UFortBattlePassPurchaseResourcesWidget::BattleStarData' has a wrong offset!");

// Class BattlePassBase.FortBattlePassResourceCounter
// 0x0020 (0x02B0 - 0x0290)
class UFortBattlePassResourceCounter : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_ResourceName;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_ResourceIcon;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResourceCount;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPersistentResourceItemDefinition*  CurrentResource;                                   // 0x02A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassResourceCounter">();
	}
	static class UFortBattlePassResourceCounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourceCounter>();
	}
};
static_assert(alignof(UFortBattlePassResourceCounter) == 0x000008, "Wrong alignment on UFortBattlePassResourceCounter");
static_assert(sizeof(UFortBattlePassResourceCounter) == 0x0002B0, "Wrong size on UFortBattlePassResourceCounter");
static_assert(offsetof(UFortBattlePassResourceCounter, Text_ResourceName) == 0x000290, "Member 'UFortBattlePassResourceCounter::Text_ResourceName' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourceCounter, LazyImage_ResourceIcon) == 0x000298, "Member 'UFortBattlePassResourceCounter::LazyImage_ResourceIcon' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourceCounter, Text_ResourceCount) == 0x0002A0, "Member 'UFortBattlePassResourceCounter::Text_ResourceCount' has a wrong offset!");
static_assert(offsetof(UFortBattlePassResourceCounter, CurrentResource) == 0x0002A8, "Member 'UFortBattlePassResourceCounter::CurrentResource' has a wrong offset!");

// Class BattlePassBase.FortBattlePassRewardGrid
// 0x00D0 (0x0478 - 0x03A8)
class UFortBattlePassRewardGrid final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x68];                                     // 0x03A8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortBattlePassTileBase>    GridTileClass;                                     // 0x0410(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBattlePassTileBase>    GridEmptyTileClass;                                // 0x0418(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              GridCellPadding;                                   // 0x0420(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassRewardGridHeader*        PageHeader;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGridPanel*                             GridPanel_Rewards;                                 // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTileBase*                DefaultFocusTile;                                  // 0x0440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UCommonButtonBase>       LastFocusedTile;                                   // 0x0448(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x28];                                     // 0x0450(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPageSelected();
	void OnPageUnselected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassRewardGrid">();
	}
	static class UFortBattlePassRewardGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardGrid>();
	}
};
static_assert(alignof(UFortBattlePassRewardGrid) == 0x000008, "Wrong alignment on UFortBattlePassRewardGrid");
static_assert(sizeof(UFortBattlePassRewardGrid) == 0x000478, "Wrong size on UFortBattlePassRewardGrid");
static_assert(offsetof(UFortBattlePassRewardGrid, GridTileClass) == 0x000410, "Member 'UFortBattlePassRewardGrid::GridTileClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, GridEmptyTileClass) == 0x000418, "Member 'UFortBattlePassRewardGrid::GridEmptyTileClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, GridCellPadding) == 0x000420, "Member 'UFortBattlePassRewardGrid::GridCellPadding' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, PageHeader) == 0x000430, "Member 'UFortBattlePassRewardGrid::PageHeader' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, GridPanel_Rewards) == 0x000438, "Member 'UFortBattlePassRewardGrid::GridPanel_Rewards' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, DefaultFocusTile) == 0x000440, "Member 'UFortBattlePassRewardGrid::DefaultFocusTile' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardGrid, LastFocusedTile) == 0x000448, "Member 'UFortBattlePassRewardGrid::LastFocusedTile' has a wrong offset!");

// Class BattlePassBase.FortBattlePassRewardGridHeader
// 0x0008 (0x0270 - 0x0268)
class UFortBattlePassRewardGridHeader final : public UUserWidget
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBattlePassLevelSet(const int32 BattlePassLevel);
	void OnPageLocked(const int32 RequiredLevel, const int32 RequiredRewards, const bool IsTimeLocked, const struct FTimespan& TimeRemaining);
	void OnPageNumberSet(const int32 InPageNumber);
	void OnPageUnlocked(const int32 PurchasedRewards, const int32 TotalRewards);
	void OnSetPageCustomName(const class FText& CustomName);
	void OnSetPageType(const ERewardPageType PageType);

	int32 GetPageNumber() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassRewardGridHeader">();
	}
	static class UFortBattlePassRewardGridHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardGridHeader>();
	}
};
static_assert(alignof(UFortBattlePassRewardGridHeader) == 0x000008, "Wrong alignment on UFortBattlePassRewardGridHeader");
static_assert(sizeof(UFortBattlePassRewardGridHeader) == 0x000270, "Wrong size on UFortBattlePassRewardGridHeader");

// Class BattlePassBase.FortBattlePassRewardTrack
// 0x0090 (0x0438 - 0x03A8)
class UFortBattlePassRewardTrack : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x40];                                     // 0x03A8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortBattlePassTileBase>    RewardTileClass;                                   // 0x03E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBattlePassTileBase>    RewardEmptyTileClass;                              // 0x03F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBattlePassPrerequisiteHeader> PrerequisiteHeaderClass;                           // 0x03F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              GridCellPadding;                                   // 0x0400(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGridPanel*                             GridPanel_Rewards;                                 // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTileBase*                DefaultFocusTile;                                  // 0x0418(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UCommonButtonBase>       LastFocusedTile;                                   // 0x0420(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_428[0x10];                                     // 0x0428(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPageSelected();
	void OnPageUnselected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBattlePassRewardTrack">();
	}
	static class UFortBattlePassRewardTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardTrack>();
	}
};
static_assert(alignof(UFortBattlePassRewardTrack) == 0x000008, "Wrong alignment on UFortBattlePassRewardTrack");
static_assert(sizeof(UFortBattlePassRewardTrack) == 0x000438, "Wrong size on UFortBattlePassRewardTrack");
static_assert(offsetof(UFortBattlePassRewardTrack, RewardTileClass) == 0x0003E8, "Member 'UFortBattlePassRewardTrack::RewardTileClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardTrack, RewardEmptyTileClass) == 0x0003F0, "Member 'UFortBattlePassRewardTrack::RewardEmptyTileClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardTrack, PrerequisiteHeaderClass) == 0x0003F8, "Member 'UFortBattlePassRewardTrack::PrerequisiteHeaderClass' has a wrong offset!");
static_assert(offsetof(UFortBattlePassRewardTrack, GridCellPadding) == 0x000400, "Member 'UFortBattlePassRewardTrack::GridCellPadding' has a wrong offset!");
