#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPurchaseScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CrewUI_structs.hpp"


namespace SDK::Params
{

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ConfirmBundle_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BattlePassPurchaseScreen_C_BndEvt__BattlePassPurchaseScreen_Button_ToCrew_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.ExecuteUbergraph_BattlePassPurchaseScreen
// 0x00B8 (0x00B8 - 0x0000)
struct BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_NewBackground;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseState                      Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBattlePassSeasonHeading_C*             K2Node_DynamicCast_AsBattle_Pass_Season_Heading;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInteractable;                        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseState                      K2Node_Event_InCurrentState;                       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseState                      Temp_byte_Variable_3;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseState                      Temp_byte_Variable_4;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPurchaseNavButton_C*                   K2Node_DynamicCast_AsPurchase_Nav_Button;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_NotificationText;                     // 0x0078(0x0018)(ConstParm)
	bool                                          K2Node_Event_bShowNotification;                    // 0x0090(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x00A1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen) == 0x000008, "Wrong alignment on BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen");
static_assert(sizeof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen) == 0x0000B8, "Wrong size on BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, EntryPoint) == 0x000000, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_NewBackground) == 0x000008, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_NewBackground' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_bool_Variable) == 0x000018, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable) == 0x000019, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable_1) == 0x00001A, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_GetEndTime_ReturnValue) == 0x000028, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_DynamicCast_AsBattle_Pass_Season_Heading) == 0x000038, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_DynamicCast_AsBattle_Pass_Season_Heading' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable_2) == 0x000041, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_GetVisibility_ReturnValue) == 0x000042, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000043, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_bInteractable) == 0x000044, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_bInteractable' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_InCurrentState) == 0x000045, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_InCurrentState' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000046, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_IsDesignTime) == 0x000047, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable_3) == 0x000048, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Select_Default) == 0x000049, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable_4) == 0x00004A, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Select_Default_1) == 0x000050, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_DynamicCast_AsPurchase_Nav_Button) == 0x000060, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_DynamicCast_AsPurchase_Nav_Button' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_bool_Has_Been_Initd_Variable) == 0x000069, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable_5) == 0x00006A, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_bool_IsClosed_Variable) == 0x00006B, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_byte_Variable_6) == 0x00006C, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_SpawnSound2D_ReturnValue) == 0x000070, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_NotificationText) == 0x000078, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_NotificationText' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Event_bShowNotification) == 0x000090, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Event_bShowNotification' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, Temp_bool_Variable_1) == 0x000091, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Select_Default_2) == 0x0000A0, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_Select_Default_3) == 0x0000A1, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, K2Node_ComponentBoundEvent_InVisibility) == 0x0000A2, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000A8, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen, CallFunc_SpawnSound2D_ReturnValue_1) == 0x0000B0, "Member 'BattlePassPurchaseScreen_C_ExecuteUbergraph_BattlePassPurchaseScreen::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.OnDownloadBackgroundComplete
// 0x0008 (0x0008 - 0x0000)
struct BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete final
{
public:
	class UTexture2D*                             NewBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong alignment on BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete");
static_assert(sizeof(BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete) == 0x000008, "Wrong size on BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete, NewBackground) == 0x000000, "Member 'BattlePassPurchaseScreen_C_OnDownloadBackgroundComplete::NewBackground' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.OnPurchaseStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_C_OnPurchaseStateChanged final
{
public:
	EBattlePassPurchaseState                      InCurrentState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_OnPurchaseStateChanged) == 0x000001, "Wrong alignment on BattlePassPurchaseScreen_C_OnPurchaseStateChanged");
static_assert(sizeof(BattlePassPurchaseScreen_C_OnPurchaseStateChanged) == 0x000001, "Wrong size on BattlePassPurchaseScreen_C_OnPurchaseStateChanged");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnPurchaseStateChanged, InCurrentState) == 0x000000, "Member 'BattlePassPurchaseScreen_C_OnPurchaseStateChanged::InCurrentState' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.OnSetNavButtonNotificationText
// 0x0018 (0x0018 - 0x0000)
struct BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText) == 0x000008, "Wrong alignment on BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText");
static_assert(sizeof(BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText) == 0x000018, "Wrong size on BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText, NotificationText) == 0x000000, "Member 'BattlePassPurchaseScreen_C_OnSetNavButtonNotificationText::NotificationText' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.OnSetScreenInteractable
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_C_OnSetScreenInteractable final
{
public:
	bool                                          bInteractable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_OnSetScreenInteractable) == 0x000001, "Wrong alignment on BattlePassPurchaseScreen_C_OnSetScreenInteractable");
static_assert(sizeof(BattlePassPurchaseScreen_C_OnSetScreenInteractable) == 0x000001, "Wrong size on BattlePassPurchaseScreen_C_OnSetScreenInteractable");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnSetScreenInteractable, bInteractable) == 0x000000, "Member 'BattlePassPurchaseScreen_C_OnSetScreenInteractable::bInteractable' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.OnShowNavButtonNotification
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_C_OnShowNavButtonNotification final
{
public:
	bool                                          bShowNotification;                                 // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_OnShowNavButtonNotification) == 0x000001, "Wrong alignment on BattlePassPurchaseScreen_C_OnShowNavButtonNotification");
static_assert(sizeof(BattlePassPurchaseScreen_C_OnShowNavButtonNotification) == 0x000001, "Wrong size on BattlePassPurchaseScreen_C_OnShowNavButtonNotification");
static_assert(offsetof(BattlePassPurchaseScreen_C_OnShowNavButtonNotification, bShowNotification) == 0x000000, "Member 'BattlePassPurchaseScreen_C_OnShowNavButtonNotification::bShowNotification' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_PreConstruct) == 0x000001, "Wrong alignment on BattlePassPurchaseScreen_C_PreConstruct");
static_assert(sizeof(BattlePassPurchaseScreen_C_PreConstruct) == 0x000001, "Wrong size on BattlePassPurchaseScreen_C_PreConstruct");
static_assert(offsetof(BattlePassPurchaseScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BattlePassPurchaseScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BattlePassPurchaseScreen.BattlePassPurchaseScreen_C.SetMobileVisuals
// 0x0080 (0x0080 - 0x0000)
struct BattlePassPurchaseScreen_C_SetMobileVisuals final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_3;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassPurchaseScreen_C_SetMobileVisuals) == 0x000008, "Wrong alignment on BattlePassPurchaseScreen_C_SetMobileVisuals");
static_assert(sizeof(BattlePassPurchaseScreen_C_SetMobileVisuals) == 0x000080, "Wrong size on BattlePassPurchaseScreen_C_SetMobileVisuals");
static_assert(offsetof(BattlePassPurchaseScreen_C_SetMobileVisuals, Temp_byte_Variable) == 0x000000, "Member 'BattlePassPurchaseScreen_C_SetMobileVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassPurchaseScreen_C_SetMobileVisuals, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'BattlePassPurchaseScreen_C_SetMobileVisuals::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
