#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_RailConnector_GrindRail

#include "Basic.hpp"

#include "GrindRail_Connection_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RailConnectionOption_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_RailConnector_GrindRail.BGA_RailConnector_GrindRail_C.AddRailOptionsFromRail
// 0x0138 (0x0138 - 0x0000)
struct BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail final
{
public:
	class ABGA_GrindRail_C*                       Rail;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeOption_Success;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRailConnectionOption                  CallFunc_MakeOption_RailConnectionOption;          // 0x0038(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_MakeOption_Success_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRailConnectionOption                  CallFunc_MakeOption_RailConnectionOption_1;        // 0x0090(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSizeSquared_ReturnValue;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail) == 0x000008, "Wrong alignment on BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail");
static_assert(sizeof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail) == 0x000138, "Wrong size on BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, Rail) == 0x000000, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::Rail' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000008, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, Temp_int_Variable) == 0x000010, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_MakeOption_Success) == 0x000030, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_MakeOption_Success' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_MakeOption_RailConnectionOption) == 0x000038, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_MakeOption_RailConnectionOption' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_MakeOption_Success_1) == 0x000088, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_MakeOption_Success_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_MakeOption_RailConnectionOption_1) == 0x000090, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_MakeOption_RailConnectionOption_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_Array_Add_ReturnValue) == 0x0000E0, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000E8, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000100, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000118, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_VSizeSquared_ReturnValue) == 0x000120, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000128, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail, CallFunc_Array_Add_ReturnValue_1) == 0x000130, "Member 'BGA_RailConnector_GrindRail_C_AddRailOptionsFromRail::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BGA_RailConnector_GrindRail.BGA_RailConnector_GrindRail_C.CheckIfOptionsCanConnect
// 0x01A8 (0x01A8 - 0x0000)
struct BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect final
{
public:
	struct FRailConnectionOption                  EntryOption;                                       // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FRailConnectionOption                  ExitOption;                                        // 0x0050(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_1;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue_2;           // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABGA_GrindRail_C*                       K2Node_DynamicCast_AsBGA_Grind_Rail;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_GrindRail_C*                       K2Node_DynamicCast_AsBGA_Grind_Rail_1;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue_1;  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect) == 0x000008, "Wrong alignment on BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect");
static_assert(sizeof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect) == 0x0001A8, "Wrong size on BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, EntryOption) == 0x000000, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::EntryOption' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, ExitOption) == 0x000050, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::ExitOption' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, ReturnValue) == 0x0000A0, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Conv_IntToVector_ReturnValue) == 0x0000A8, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Conv_IntToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Conv_IntToVector_ReturnValue_1) == 0x0000C0, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Conv_IntToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Conv_IntToVector_ReturnValue_2) == 0x0000D8, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Conv_IntToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000F0, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000F8, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, K2Node_DynamicCast_AsBGA_Grind_Rail) == 0x000100, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::K2Node_DynamicCast_AsBGA_Grind_Rail' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, K2Node_DynamicCast_AsBGA_Grind_Rail_1) == 0x000110, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::K2Node_DynamicCast_AsBGA_Grind_Rail_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_GetDirectionAtSplinePoint_ReturnValue) == 0x000120, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_GetDirectionAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_GetDirectionAtSplinePoint_ReturnValue_1) == 0x000138, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_GetDirectionAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000150, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000168, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000180, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Dot_VectorVector_ReturnValue) == 0x000198, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'BGA_RailConnector_GrindRail_C_CheckIfOptionsCanConnect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BGA_RailConnector_GrindRail.BGA_RailConnector_GrindRail_C.ExecuteUbergraph_BGA_RailConnector_GrindRail
// 0x0370 (0x0370 - 0x0000)
struct BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABGA_GrindRail_C*                       CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABGA_GrindRail_C*                       K2Node_DynamicCast_AsBGA_Grind_Rail;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRailConnectionOption                  CallFunc_Array_Get_Item_2;                         // 0x0098(0x0050)(HasGetValueTypeHash)
	struct FRailConnectionOption                  CallFunc_GetOptions_Left;                          // 0x00E8(0x0050)(HasGetValueTypeHash)
	struct FRailConnectionOption                  CallFunc_GetOptions_Center;                        // 0x0138(0x0050)(HasGetValueTypeHash)
	struct FRailConnectionOption                  CallFunc_GetOptions_Right;                         // 0x0188(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetOptions_Found_Options;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_GrindRail_C*                       K2Node_DynamicCast_AsBGA_Grind_Rail_1;             // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrindRail_Connection                  K2Node_MakeStruct_GrindRail_Connection;            // 0x0208(0x0148)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_MakeStruct_ConnectionLocation_2_0B59101340934B78FA685DBB3072546E_ImplicitCast; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail) == 0x000008, "Wrong alignment on BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail");
static_assert(sizeof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail) == 0x000370, "Wrong size on BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, EntryPoint) == 0x000000, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_object_Variable) == 0x000008, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_MakeArray_Array) == 0x000048, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_SphereOverlapActors_OutActors) == 0x000058, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_SphereOverlapActors_ReturnValue) == 0x000068, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_Get_Item) == 0x000070, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_DynamicCast_AsBGA_Grind_Rail) == 0x000080, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_DynamicCast_AsBGA_Grind_Rail' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_AddUnique_ReturnValue) == 0x00008C, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_GetOptions_Left) == 0x0000E8, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_GetOptions_Left' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_GetOptions_Center) == 0x000138, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_GetOptions_Center' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_GetOptions_Right) == 0x000188, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_GetOptions_Right' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_GetOptions_Found_Options) == 0x0001D8, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_GetOptions_Found_Options' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0001E0, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Array_Length_ReturnValue_2) == 0x0001E8, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_DynamicCast_AsBGA_Grind_Rail_1) == 0x0001F0, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_DynamicCast_AsBGA_Grind_Rail_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Less_IntInt_ReturnValue) == 0x0001F9, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x0001FC, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_int_Loop_Counter_Variable_1) == 0x000200, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_MakeStruct_GrindRail_Connection) == 0x000208, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_MakeStruct_GrindRail_Connection' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Less_IntInt_ReturnValue_1) == 0x000350, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Add_IntInt_ReturnValue_1) == 0x000354, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, Temp_int_Loop_Counter_Variable_2) == 0x000358, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Less_IntInt_ReturnValue_2) == 0x00035C, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, CallFunc_Add_IntInt_ReturnValue_2) == 0x000360, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail, K2Node_MakeStruct_ConnectionLocation_2_0B59101340934B78FA685DBB3072546E_ImplicitCast) == 0x000368, "Member 'BGA_RailConnector_GrindRail_C_ExecuteUbergraph_BGA_RailConnector_GrindRail::K2Node_MakeStruct_ConnectionLocation_2_0B59101340934B78FA685DBB3072546E_ImplicitCast' has a wrong offset!");

// Function BGA_RailConnector_GrindRail.BGA_RailConnector_GrindRail_C.GetClosestSplinePoint
// 0x0038 (0x0038 - 0x0000)
struct BGA_RailConnector_GrindRail_C_GetClosestSplinePoint final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint) == 0x000008, "Wrong alignment on BGA_RailConnector_GrindRail_C_GetClosestSplinePoint");
static_assert(sizeof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint) == 0x000038, "Wrong size on BGA_RailConnector_GrindRail_C_GetClosestSplinePoint");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint, WorldLocation) == 0x000000, "Member 'BGA_RailConnector_GrindRail_C_GetClosestSplinePoint::WorldLocation' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint, Spline) == 0x000018, "Member 'BGA_RailConnector_GrindRail_C_GetClosestSplinePoint::Spline' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint, ReturnValue) == 0x000020, "Member 'BGA_RailConnector_GrindRail_C_GetClosestSplinePoint::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint, CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue) == 0x000024, "Member 'BGA_RailConnector_GrindRail_C_GetClosestSplinePoint::CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint, CallFunc_Round_ReturnValue) == 0x000028, "Member 'BGA_RailConnector_GrindRail_C_GetClosestSplinePoint::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetClosestSplinePoint, CallFunc_Round_A_ImplicitCast) == 0x000030, "Member 'BGA_RailConnector_GrindRail_C_GetClosestSplinePoint::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function BGA_RailConnector_GrindRail.BGA_RailConnector_GrindRail_C.GetOptions
// 0x0348 (0x0348 - 0x0000)
struct BGA_RailConnector_GrindRail_C_GetOptions final
{
public:
	struct FRailConnectionOption                  EntryOption;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FRailConnectionOption                  Left;                                              // 0x0050(0x0050)(Parm, OutParm, HasGetValueTypeHash)
	struct FRailConnectionOption                  Center;                                            // 0x00A0(0x0050)(Parm, OutParm, HasGetValueTypeHash)
	struct FRailConnectionOption                  Right;                                             // 0x00F0(0x0050)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Found_Options;                                     // 0x0140(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundOptions;                                      // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRailConnectionOption                  Best_Right_Option;                                 // 0x0148(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        Best_Right_Dot;                                    // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRailConnectionOption                  Best_Left_Option;                                  // 0x01A0(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        Best_Left_Dot;                                     // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRailConnectionOption                  Best_Center_Option;                                // 0x01F8(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        BestCenterDot;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRailConnectionOption                  CallFunc_Array_Get_Item;                           // 0x02B0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue_1;            // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfOptionsCanConnect_ReturnValue;     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_RailConnector_GrindRail_C_GetOptions) == 0x000008, "Wrong alignment on BGA_RailConnector_GrindRail_C_GetOptions");
static_assert(sizeof(BGA_RailConnector_GrindRail_C_GetOptions) == 0x000348, "Wrong size on BGA_RailConnector_GrindRail_C_GetOptions");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, EntryOption) == 0x000000, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::EntryOption' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Left) == 0x000050, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Left' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Center) == 0x0000A0, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Center' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Right) == 0x0000F0, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Right' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Found_Options) == 0x000140, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Found_Options' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, FoundOptions) == 0x000141, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::FoundOptions' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Best_Right_Option) == 0x000148, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Best_Right_Option' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Best_Right_Dot) == 0x000198, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Best_Right_Dot' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Best_Left_Option) == 0x0001A0, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Best_Left_Option' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Best_Left_Dot) == 0x0001F0, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Best_Left_Dot' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Best_Center_Option) == 0x0001F8, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Best_Center_Option' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, BestCenterDot) == 0x000248, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::BestCenterDot' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Temp_int_Array_Index_Variable) == 0x000250, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_NegateVector_ReturnValue) == 0x000258, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, Temp_int_Loop_Counter_Variable) == 0x000270, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Vector_Normal2D_ReturnValue) == 0x000278, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Cross_VectorVector_ReturnValue) == 0x000290, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Add_IntInt_ReturnValue) == 0x0002A8, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Array_Length_ReturnValue) == 0x0002AC, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Array_Get_Item) == 0x0002B0, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000300, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Vector_Normal2D_ReturnValue_1) == 0x000308, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Vector_Normal2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_CheckIfOptionsCanConnect_ReturnValue) == 0x000320, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_CheckIfOptionsCanConnect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Dot_VectorVector_ReturnValue) == 0x000328, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000330, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000331, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000338, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_RailConnector_GrindRail_C_GetOptions, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000340, "Member 'BGA_RailConnector_GrindRail_C_GetOptions::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BGA_RailConnector_GrindRail.BGA_RailConnector_GrindRail_C.MakeOption
// 0x0198 (0x0198 - 0x0000)
struct BGA_RailConnector_GrindRail_C_MakeOption final
{
public:
	class ABGA_GrindRail_C*                       TheRail;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ThePoint;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TheDirection;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRailConnectionOption                  RailConnectionOption;                              // 0x0018(0x0050)(Parm, OutParm, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABGA_GrindRail_C>        CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0110(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FRailConnectionOption                  K2Node_MakeStruct_RailConnectionOption;            // 0x0138(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
