#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_WithGravity_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_WithGravity_Parent.BGA_Athena_WithGravity_Parent_C
// 0x02C0 (0x0CF0 - 0x0A30)
class ABGA_Athena_WithGravity_Parent_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWaterInteractionComponent*         FortWaterInteraction;                              // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ResumeGravSimOnBegin;                              // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResumeSimulation;                                 // 0x0A51(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A52[0x6];                                      // 0x0A52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             NullHit;                                           // 0x0A58(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                GravImpact_Loc;                                    // 0x0B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravHitNormal;                                     // 0x0B50(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GravMaxSlope;                                      // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckForBounce;                                    // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForcedBounceExtraZ;                                // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForcedBounceCurrentCount;                          // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForcedBounceMult;                                  // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         GravFoundBuildingOnDied;                           // 0x0B90(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          RepCollision;                                      // 0x0BA0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                AdditionalBounceObject;                            // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ForcedBounceMaxCount;                              // 0x0BB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceBounce;                                       // 0x0BB4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CountNonForceBounces;                              // 0x0BB5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB6[0x2];                                      // 0x0BB6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BounceExtraZ;                                      // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BounceMult;                                        // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldAttach;                                      // 0x0BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC9[0x7];                                      // 0x0BC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToNotAttachTo;                               // 0x0BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          DontAttachToOthersOfThisClass;                     // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugText;                                         // 0x0BE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldNotReattach;                                 // 0x0BE2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockStoppingSim;                                  // 0x0BE3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeactivatePawnAndVehicleCollisionOnStop;           // 0x0BE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowReattachmentToActors;                         // 0x0BE5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE6[0x2];                                      // 0x0BE6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             StopSimHitResult;                                  // 0x0BE8(0x00E0)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                StopSimServerLocation;                             // 0x0CC8(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        BounceAwayFromLocation_MinSpeed;                   // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BounceOffTires;                                    // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttachedWasDestroyed();
	void AttachToBindedActor(class UPrimitiveComponent* AttachComp);
	void BaseDestroyed(class AActor* DestroyedActor);
	void BaseDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void BounceBGA();
	void BounceBGAAwayFromLocation(const struct FVector& LocationToBounceAwayFrom);
	void CheckForSameClassToBounce(class AActor* Hit, bool* HitSameClass);
	void ExecuteUbergraph_BGA_Athena_WithGravity_Parent(int32 EntryPoint);
	void ForceBounceBGA();
	void HandleBinding(class AActor* Actor, class UPrimitiveComponent* HitComp);
	void Impulse(double DelayBeforeImpulse, double DelayBeforeCollision, const struct FVector& ImpulseOrigin, const struct FVector& ImpulseAmount, bool SetCollisionAfterImpulse);
	void Init(const struct FVector& GravHitNormal_0);
	void OnAttach(class AActor* AttachedActor);
	void OnRep_bResumeSimulation();
	void OnRep_RepCollision();
	void OnRep_StopLocation();
	void OnRep_StopSimServerLocation();
	void OnUnderneathPhysicsObjectAwakeChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);
	void PlayHitFX(const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void RestartSimulation();
	void SlidingDoorOpened();
	void SpawnFXSounds();
	void StopSim(const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_WithGravity_Parent_C">();
	}
	static class ABGA_Athena_WithGravity_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_WithGravity_Parent_C>();
	}
};
static_assert(alignof(ABGA_Athena_WithGravity_Parent_C) == 0x000008, "Wrong alignment on ABGA_Athena_WithGravity_Parent_C");
static_assert(sizeof(ABGA_Athena_WithGravity_Parent_C) == 0x000CF0, "Wrong size on ABGA_Athena_WithGravity_Parent_C");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, UberGraphFrame) == 0x000A30, "Member 'ABGA_Athena_WithGravity_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, FortWaterInteraction) == 0x000A38, "Member 'ABGA_Athena_WithGravity_Parent_C::FortWaterInteraction' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, StaticMesh) == 0x000A40, "Member 'ABGA_Athena_WithGravity_Parent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ProjectileMovement) == 0x000A48, "Member 'ABGA_Athena_WithGravity_Parent_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ResumeGravSimOnBegin) == 0x000A50, "Member 'ABGA_Athena_WithGravity_Parent_C::ResumeGravSimOnBegin' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, bResumeSimulation) == 0x000A51, "Member 'ABGA_Athena_WithGravity_Parent_C::bResumeSimulation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, NullHit) == 0x000A58, "Member 'ABGA_Athena_WithGravity_Parent_C::NullHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravImpact_Loc) == 0x000B38, "Member 'ABGA_Athena_WithGravity_Parent_C::GravImpact_Loc' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravHitNormal) == 0x000B50, "Member 'ABGA_Athena_WithGravity_Parent_C::GravHitNormal' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravMaxSlope) == 0x000B68, "Member 'ABGA_Athena_WithGravity_Parent_C::GravMaxSlope' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, CheckForBounce) == 0x000B70, "Member 'ABGA_Athena_WithGravity_Parent_C::CheckForBounce' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceExtraZ) == 0x000B78, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceExtraZ' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceCurrentCount) == 0x000B80, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceCurrentCount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceMult) == 0x000B88, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceMult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, GravFoundBuildingOnDied) == 0x000B90, "Member 'ABGA_Athena_WithGravity_Parent_C::GravFoundBuildingOnDied' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, RepCollision) == 0x000BA0, "Member 'ABGA_Athena_WithGravity_Parent_C::RepCollision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, AdditionalBounceObject) == 0x000BA8, "Member 'ABGA_Athena_WithGravity_Parent_C::AdditionalBounceObject' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForcedBounceMaxCount) == 0x000BB0, "Member 'ABGA_Athena_WithGravity_Parent_C::ForcedBounceMaxCount' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ForceBounce) == 0x000BB4, "Member 'ABGA_Athena_WithGravity_Parent_C::ForceBounce' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, CountNonForceBounces) == 0x000BB5, "Member 'ABGA_Athena_WithGravity_Parent_C::CountNonForceBounces' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceExtraZ) == 0x000BB8, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceExtraZ' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceMult) == 0x000BC0, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceMult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ShouldAttach) == 0x000BC8, "Member 'ABGA_Athena_WithGravity_Parent_C::ShouldAttach' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ActorsToNotAttachTo) == 0x000BD0, "Member 'ABGA_Athena_WithGravity_Parent_C::ActorsToNotAttachTo' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, DontAttachToOthersOfThisClass) == 0x000BE0, "Member 'ABGA_Athena_WithGravity_Parent_C::DontAttachToOthersOfThisClass' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, DebugText) == 0x000BE1, "Member 'ABGA_Athena_WithGravity_Parent_C::DebugText' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, ShouldNotReattach) == 0x000BE2, "Member 'ABGA_Athena_WithGravity_Parent_C::ShouldNotReattach' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BlockStoppingSim) == 0x000BE3, "Member 'ABGA_Athena_WithGravity_Parent_C::BlockStoppingSim' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, DeactivatePawnAndVehicleCollisionOnStop) == 0x000BE4, "Member 'ABGA_Athena_WithGravity_Parent_C::DeactivatePawnAndVehicleCollisionOnStop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, AllowReattachmentToActors) == 0x000BE5, "Member 'ABGA_Athena_WithGravity_Parent_C::AllowReattachmentToActors' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, StopSimHitResult) == 0x000BE8, "Member 'ABGA_Athena_WithGravity_Parent_C::StopSimHitResult' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, StopSimServerLocation) == 0x000CC8, "Member 'ABGA_Athena_WithGravity_Parent_C::StopSimServerLocation' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceAwayFromLocation_MinSpeed) == 0x000CE0, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceAwayFromLocation_MinSpeed' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_WithGravity_Parent_C, BounceOffTires) == 0x000CE8, "Member 'ABGA_Athena_WithGravity_Parent_C::BounceOffTires' has a wrong offset!");

}

