#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_GrindRail

#include "Basic.hpp"

#include "GrindRail_Connection_structs.hpp"
#include "GrindRailRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GrindRail_Booster_Directional_structs.hpp"
#include "ColorSelect_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "RailConnectionOption_structs.hpp"
#include "Engine_structs.hpp"
#include "GleefulRake_BoosterMode_structs.hpp"
#include "GrindRail_ResourceSpawns_structs.hpp"
#include "GrindRail_ResourceSpawns_Type_structs.hpp"


namespace SDK::Params
{

// Function BGA_GrindRail.BGA_GrindRail_C.AddBoosterModel
// 0x05F0 (0x05F0 - 0x0000)
struct BGA_GrindRail_C_AddBoosterModel final
{
public:
	struct FGrindRail_Booster_Directional         Booster;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_Index_0;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      NewLocalVar_0;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         BoosterMeshes_0;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     Transforms;                                        // 0x0030(0x0010)(Edit, BlueprintVisible)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_1;         // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_2;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_3;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_4;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_5;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BoosterLengthToSplineLength_Length_Along_Spline__cm_; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue; // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGleefulRake_BoosterMode                      Temp_byte_Variable;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_6;         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMod_Remainder;                           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0390(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BoosterLengthToSplineLength_Length_Along_Spline__cm__1; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGleefulRake_BoosterMode                      Temp_byte_Variable_1;                              // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCustomDataValue_ReturnValue_7;         // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1; // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_2;         // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_3;         // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue_1;       // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0560(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast; // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast; // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast_1; // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast_2; // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GrindRail_C_AddBoosterModel) == 0x000010, "Wrong alignment on BGA_GrindRail_C_AddBoosterModel");
static_assert(sizeof(BGA_GrindRail_C_AddBoosterModel) == 0x0005F0, "Wrong size on BGA_GrindRail_C_AddBoosterModel");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Booster) == 0x000000, "Member 'BGA_GrindRail_C_AddBoosterModel::Booster' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Array_Index_0) == 0x000018, "Member 'BGA_GrindRail_C_AddBoosterModel::Array_Index_0' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, NewLocalVar_0) == 0x000020, "Member 'BGA_GrindRail_C_AddBoosterModel::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, BoosterMeshes_0) == 0x000028, "Member 'BGA_GrindRail_C_AddBoosterModel::BoosterMeshes_0' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Transforms) == 0x000030, "Member 'BGA_GrindRail_C_AddBoosterModel::Transforms' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, BaseMesh) == 0x000040, "Member 'BGA_GrindRail_C_AddBoosterModel::BaseMesh' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000048, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000060, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000070, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000074, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000078, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue) == 0x00007C, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_1) == 0x00007D, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000080, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_2) == 0x000084, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000090, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_3) == 0x0000A0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_4) == 0x0000A1, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0000C0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000CC, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_5) == 0x0000D0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_real_Variable) == 0x0000D8, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_real_Variable_1) == 0x0000E0, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_int_Variable) == 0x0000E8, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0000F0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Array_Add_ReturnValue_1) == 0x000100, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000108, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000110, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_BoosterLengthToSplineLength_Length_Along_Spline__cm_) == 0x000128, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_BoosterLengthToSplineLength_Length_Along_Spline__cm_' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_real_Variable_2) == 0x000130, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000138, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue) == 0x000150, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Cross_VectorVector_ReturnValue) == 0x000168, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000180, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000198, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001B0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_RotateAngleAxis_ReturnValue) == 0x0001C8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Normal_ReturnValue) == 0x0001E0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001F8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000200, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_RandomFloatInRange_ReturnValue) == 0x000218, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000220, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000238, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000250, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_byte_Variable) == 0x000268, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_int_Variable_1) == 0x00026C, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, K2Node_Select_Default) == 0x000270, "Member 'BGA_GrindRail_C_AddBoosterModel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000278, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_6) == 0x000280, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_FMod_Remainder) == 0x000288, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_FMod_ReturnValue) == 0x000290, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000298, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_FClamp_ReturnValue) == 0x0002A0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0002A8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0002B0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeRotator_ReturnValue) == 0x0002B8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0002D0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_ComposeRotators_ReturnValue) == 0x0002D8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0002F0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002F8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x000300, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000318, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_real_Variable_3) == 0x000330, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_VectorVector_ReturnValue) == 0x000338, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000350, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000368, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000380, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeTransform_ReturnValue) == 0x000390, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_BoosterLengthToSplineLength_Length_Along_Spline__cm__1) == 0x0003F0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_BoosterLengthToSplineLength_Length_Along_Spline__cm__1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_AddInstance_ReturnValue) == 0x0003F8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Array_Add_ReturnValue_2) == 0x0003FC, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_real_Variable_4) == 0x000400, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000408, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Round_ReturnValue) == 0x000410, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000418, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_real_Variable_5) == 0x000430, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, Temp_byte_Variable_1) == 0x000438, "Member 'BGA_GrindRail_C_AddBoosterModel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeVector_ReturnValue_1) == 0x000440, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, K2Node_Select_Default_1) == 0x000458, "Member 'BGA_GrindRail_C_AddBoosterModel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_ReturnValue_7) == 0x000460, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1) == 0x000468, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Cross_VectorVector_ReturnValue_2) == 0x000480, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Cross_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Cross_VectorVector_ReturnValue_3) == 0x000498, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Cross_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x0004B0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x0004C8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Normal_ReturnValue_1) == 0x0004E0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0004F8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeRotationFromAxes_ReturnValue_1) == 0x000510, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeRotationFromAxes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000528, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_ComposeRotators_ReturnValue_1) == 0x000540, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeTransform_ReturnValue_1) == 0x000560, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_Array_Add_ReturnValue_3) == 0x0005C0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_AddInstance_ReturnValue_1) == 0x0005C4, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast) == 0x0005C8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0005CC, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0005D0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast_1) == 0x0005D4, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0005D8, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0005DC, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0005E0, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddBoosterModel, CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast_2) == 0x0005E4, "Member 'BGA_GrindRail_C_AddBoosterModel::CallFunc_SetCustomDataValue_CustomDataValue_ImplicitCast_2' has a wrong offset!");

// Function BGA_GrindRail.BGA_GrindRail_C.AddInteractionRailMeshComponent
// 0x0080 (0x0080 - 0x0000)
struct BGA_GrindRail_C_AddInteractionRailMeshComponent final
{
public:
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GrindRail_C_AddInteractionRailMeshComponent) == 0x000010, "Wrong alignment on BGA_GrindRail_C_AddInteractionRailMeshComponent");
static_assert(sizeof(BGA_GrindRail_C_AddInteractionRailMeshComponent) == 0x000080, "Wrong size on BGA_GrindRail_C_AddInteractionRailMeshComponent");
static_assert(offsetof(BGA_GrindRail_C_AddInteractionRailMeshComponent, SplineMeshComponent) == 0x000000, "Member 'BGA_GrindRail_C_AddInteractionRailMeshComponent::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddInteractionRailMeshComponent, Temp_struct_Variable) == 0x000010, "Member 'BGA_GrindRail_C_AddInteractionRailMeshComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddInteractionRailMeshComponent, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BGA_GrindRail_C_AddInteractionRailMeshComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddInteractionRailMeshComponent, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BGA_GrindRail_C_AddInteractionRailMeshComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddInteractionRailMeshComponent, CallFunc_SetStaticMesh_ReturnValue) == 0x000079, "Member 'BGA_GrindRail_C_AddInteractionRailMeshComponent::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BGA_GrindRail.BGA_GrindRail_C.AddRailConnection
// 0x01D8 (0x01D8 - 0x0000)
struct BGA_GrindRail_C_AddRailConnection final
{
public:
	struct FGrindRail_Connection                  NewConnection;                                     // 0x0000(0x0148)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GrindRail_C_AddRailConnection) == 0x000008, "Wrong alignment on BGA_GrindRail_C_AddRailConnection");
static_assert(sizeof(BGA_GrindRail_C_AddRailConnection) == 0x0001D8, "Wrong size on BGA_GrindRail_C_AddRailConnection");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, NewConnection) == 0x000000, "Member 'BGA_GrindRail_C_AddRailConnection::NewConnection' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000150, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Conv_IntToString_ReturnValue) == 0x000160, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_GetDisplayName_ReturnValue) == 0x000170, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Concat_StrStr_ReturnValue) == 0x000180, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Array_Add_ReturnValue) == 0x000190, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000198, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001A8, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001B8, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddRailConnection, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001C8, "Member 'BGA_GrindRail_C_AddRailConnection::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function BGA_GrindRail.BGA_GrindRail_C.AddSolidRailMeshComponent
// 0x0080 (0x0080 - 0x0000)
struct BGA_GrindRail_C_AddSolidRailMeshComponent final
{
public:
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_GrindRail_C_AddSolidRailMeshComponent) == 0x000010, "Wrong alignment on BGA_GrindRail_C_AddSolidRailMeshComponent");
static_assert(sizeof(BGA_GrindRail_C_AddSolidRailMeshComponent) == 0x000080, "Wrong size on BGA_GrindRail_C_AddSolidRailMeshComponent");
static_assert(offsetof(BGA_GrindRail_C_AddSolidRailMeshComponent, SplineMeshComponent) == 0x000000, "Member 'BGA_GrindRail_C_AddSolidRailMeshComponent::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddSolidRailMeshComponent, Temp_struct_Variable) == 0x000010, "Member 'BGA_GrindRail_C_AddSolidRailMeshComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddSolidRailMeshComponent, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'BGA_GrindRail_C_AddSolidRailMeshComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddSolidRailMeshComponent, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BGA_GrindRail_C_AddSolidRailMeshComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_GrindRail_C_AddSolidRailMeshComponent, CallFunc_SetStaticMesh_ReturnValue) == 0x000079, "Member 'BGA_GrindRail_C_AddSolidRailMeshComponent::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BGA_GrindRail.BGA_GrindRail_C.AddTip
// 0x0660 (0x0660 - 0x0000)
struct BGA_GrindRail_C_AddTip final
{
public:
	bool                                          EndTip_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyUpdateSpline;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            TipMesh_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TipRotation;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        TipDistanceAlongSpline;                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGrindRail_TipComponent_C*              NewComp;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABGA_RailConnector_GrindRail_C*         Connector;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TipConnectorDirection;                             // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TipConnectorLocation;                              // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
