#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoarRidableComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CreatureBaseRidableComponent_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BoarRidableComponent.BoarRidableComponent_C
// 0x0050 (0x0BC0 - 0x0B70)
class UBoarRidableComponent_C final : public UCreatureBaseRidableComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BoarRidableComponent_C;             // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundBase*                             BurtChargeStartSound;                              // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ChargeSoundComp;                                   // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        SprintCooldDownTime;                               // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GESprintImpactPawn;                                // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SprintImpactGameplayCueTag;                        // 0x0B98(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GESprintImpactVehicle;                             // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SprintChargeImpact_Default_CueTag;                 // 0x0BA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SprintChargeImpact_Pawn_CueTag;                    // 0x0BAC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SprintChargeImpact_DestroyBuild_CueTag;            // 0x0BB0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BoarRidableComponent(int32 EntryPoint);
	void HandleAbilityStarted();
	void HandleRiderStartedRiding(class URiderComponent* Rider);
	void HandleRiderStoppedRiding(class URiderComponent* Rider);
	void OnReaction(class UObject* Object, const struct FHitResult& HitResult);
	void OnReactionEvent(const class AActor* HitActor, const bool bFromAsyncSweepBox, EFCollisionReactionType CollisionReactionType, const bool bIsFirstContinuousReactionOnDelayableActor, const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BoarRidableComponent_C">();
	}
	static class UBoarRidableComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoarRidableComponent_C>();
	}
};
static_assert(alignof(UBoarRidableComponent_C) == 0x000010, "Wrong alignment on UBoarRidableComponent_C");
static_assert(sizeof(UBoarRidableComponent_C) == 0x000BC0, "Wrong size on UBoarRidableComponent_C");
static_assert(offsetof(UBoarRidableComponent_C, UberGraphFrame_BoarRidableComponent_C) == 0x000B70, "Member 'UBoarRidableComponent_C::UberGraphFrame_BoarRidableComponent_C' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, BurtChargeStartSound) == 0x000B78, "Member 'UBoarRidableComponent_C::BurtChargeStartSound' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, ChargeSoundComp) == 0x000B80, "Member 'UBoarRidableComponent_C::ChargeSoundComp' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, SprintCooldDownTime) == 0x000B88, "Member 'UBoarRidableComponent_C::SprintCooldDownTime' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, GESprintImpactPawn) == 0x000B90, "Member 'UBoarRidableComponent_C::GESprintImpactPawn' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, SprintImpactGameplayCueTag) == 0x000B98, "Member 'UBoarRidableComponent_C::SprintImpactGameplayCueTag' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, GESprintImpactVehicle) == 0x000BA0, "Member 'UBoarRidableComponent_C::GESprintImpactVehicle' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, SprintChargeImpact_Default_CueTag) == 0x000BA8, "Member 'UBoarRidableComponent_C::SprintChargeImpact_Default_CueTag' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, SprintChargeImpact_Pawn_CueTag) == 0x000BAC, "Member 'UBoarRidableComponent_C::SprintChargeImpact_Pawn_CueTag' has a wrong offset!");
static_assert(offsetof(UBoarRidableComponent_C, SprintChargeImpact_DestroyBuild_CueTag) == 0x000BB0, "Member 'UBoarRidableComponent_C::SprintChargeImpact_DestroyBuild_CueTag' has a wrong offset!");

}

