#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoarRidingPlayerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x021F (0x0220 - 0x0001)
struct BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1446;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1447;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1448;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1449;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1450;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1451;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1452;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1453;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1454;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1455;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1456;                              // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1457;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1458;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1459;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1460;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1461;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1462;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1463;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1464;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1465;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1466;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1467;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1468;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1469;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1470;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1471;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1472;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1473;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1474;                               // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1475;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1476;                              // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1477;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1478;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1479;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1480;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1481;                              // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               __EnumProperty_1482;                               // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1483;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1484;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1485;                             // 0x00DC(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1486;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1487;                                // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1488;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1489;                               // 0x0114(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1490;                               // 0x0115(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1491;                              // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1492;                              // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1493;                               // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1494;                               // 0x0121(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1495;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1496;                                 // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1497;                               // 0x0138(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1498;                               // 0x0139(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1499;                               // 0x013A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1500;                              // 0x0140(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1501;                               // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1502;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1503;                               // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1504;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1505;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1506;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1507;                             // 0x0168(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1508;                               // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1509;                               // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0188(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0208(0x0018)()
};
static_assert(alignof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000220, "Wrong size on BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1446) == 0x000004, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1446' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1447) == 0x000008, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1447' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1448) == 0x000010, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1448' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1449) == 0x000018, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1449' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1450) == 0x00001C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1450' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1451) == 0x000020, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1451' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1452) == 0x000024, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1452' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1453) == 0x000028, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1453' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1454) == 0x00002C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1454' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1455) == 0x000030, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1455' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1456) == 0x000038, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1456' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1457) == 0x000048, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1457' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1458) == 0x00004C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1458' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1459) == 0x000050, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1459' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1460) == 0x000054, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1460' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1461) == 0x000058, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1461' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1462) == 0x00005C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1462' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1463) == 0x000060, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1463' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1464) == 0x000064, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1464' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1465) == 0x000068, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1465' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1466) == 0x00006C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1466' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1467) == 0x000070, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1467' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1468) == 0x000074, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1468' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1469) == 0x000078, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1469' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1470) == 0x00007C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1470' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1471) == 0x000080, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1471' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1472) == 0x000084, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1472' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1473) == 0x000088, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1473' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1474) == 0x00008C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1474' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1475) == 0x000090, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1475' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1476) == 0x0000A0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1476' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1477) == 0x0000B0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1477' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1478) == 0x0000B4, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1478' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1479) == 0x0000B8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1479' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1480) == 0x0000BC, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1480' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1481) == 0x0000C0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1481' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1482) == 0x0000D0, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1482' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1483) == 0x0000D4, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1483' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1484) == 0x0000D8, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1484' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1485) == 0x0000DC, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1485' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1486) == 0x000108, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1486' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1487) == 0x00010C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1487' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1488) == 0x000110, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1488' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1489) == 0x000114, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1489' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1490) == 0x000115, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1490' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1491) == 0x000118, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1491' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1492) == 0x00011C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1492' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1493) == 0x000120, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1493' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1494) == 0x000121, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1494' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1495) == 0x000128, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1495' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1496) == 0x000130, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1496' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1497) == 0x000138, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1497' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1498) == 0x000139, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1498' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1499) == 0x00013A, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1499' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1500) == 0x000140, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1500' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1501) == 0x000150, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1501' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1502) == 0x000154, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1502' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1503) == 0x000158, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1503' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1504) == 0x00015C, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1504' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1505) == 0x000160, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1505' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1506) == 0x000164, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1506' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1507) == 0x000168, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1507' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1508) == 0x000180, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1508' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1509) == 0x000184, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1509' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000188, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000208, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct BoarRidingPlayerLayerAnimBP.BoarRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x008F (0x0090 - 0x0001)
struct BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1;                                 // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_2;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0023(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x0063(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_26;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_28;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_31;                                 // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_32;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_34;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_36;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_38;                                 // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000090, "Wrong size on BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'BoarRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
