#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionMapPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionMapPanel.BP_AthenaCollectionMapPanel_C.ExecuteUbergraph_BP_AthenaCollectionMapPanel
// 0x0030 (0x0030 - 0x0000)
struct BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel) == 0x000008, "Wrong alignment on BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel");
static_assert(sizeof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel) == 0x000030, "Wrong size on BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel");
static_assert(offsetof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000018, "Member 'BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel, CallFunc_IsInZone_ReturnValue) == 0x000028, "Member 'BP_AthenaCollectionMapPanel_C_ExecuteUbergraph_BP_AthenaCollectionMapPanel::CallFunc_IsInZone_ReturnValue' has a wrong offset!");

}

