#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionMapPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaCollectionMapPanel.BP_AthenaCollectionMapPanel_C
// 0x0028 (0x0578 - 0x0550)
class UBP_AthenaCollectionMapPanel_C final : public UAthenaFullScreenMapBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_89;                                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_AthenaCollectionMapControlsWidget_C* BP_AthenaCollectionMapControlsWidget;              // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapFalloff;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_BP_AthenaCollectionMapPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaCollectionMapPanel_C">();
	}
	static class UBP_AthenaCollectionMapPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaCollectionMapPanel_C>();
	}
};
static_assert(alignof(UBP_AthenaCollectionMapPanel_C) == 0x000008, "Wrong alignment on UBP_AthenaCollectionMapPanel_C");
static_assert(sizeof(UBP_AthenaCollectionMapPanel_C) == 0x000578, "Wrong size on UBP_AthenaCollectionMapPanel_C");
static_assert(offsetof(UBP_AthenaCollectionMapPanel_C, UberGraphFrame) == 0x000550, "Member 'UBP_AthenaCollectionMapPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionMapPanel_C, Intro) == 0x000558, "Member 'UBP_AthenaCollectionMapPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionMapPanel_C, BackgroundBlur_89) == 0x000560, "Member 'UBP_AthenaCollectionMapPanel_C::BackgroundBlur_89' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionMapPanel_C, BP_AthenaCollectionMapControlsWidget) == 0x000568, "Member 'UBP_AthenaCollectionMapPanel_C::BP_AthenaCollectionMapControlsWidget' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionMapPanel_C, MapFalloff) == 0x000570, "Member 'UBP_AthenaCollectionMapPanel_C::MapFalloff' has a wrong offset!");

}

