#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Athena_Environmental_ZipLine_Spline

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Athena_Environmental_ZipLine_Spline.BP_Athena_Environmental_ZipLine_Spline_C
// 0x0128 (0x0E68 - 0x0D40)
class ABP_Athena_Environmental_ZipLine_Spline_C final : public AFortAthenaSplineZipline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       EndPointInteractSphere;                            // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       StartPointInteractSphere;                          // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SplineStaticMesh;                                  // 0x0D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TangentSmoothStrength;                             // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoSmoothTangents;                                // 0x0D68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               ForwardMeshAxis;                                   // 0x0D69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6A[0x6];                                      // 0x0D6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MotorOffset;                                       // 0x0D70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         PoleA;                                             // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABuildingActor*                         PoleB;                                             // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                PoleASocketLocation;                               // 0x0D98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PoleBSocketLocation;                               // 0x0DB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LowerPointID;                                      // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HigherPointID;                                     // 0x0DCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HigherEndLocation;                                 // 0x0DD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LowerEndLocation;                                  // 0x0DE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AutoLinearFactorLow;                               // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoLinearFactorHigh;                              // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoSplineTangentLengthCoef;                       // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoSplineTangentHorizCoef;                        // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        AutoSplineTangentVertCoef;                         // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_Set_Spline_Ends;                              // 0x0E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_Set_Spline_Mids;                              // 0x0E29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_E2A[0x6];                                      // 0x0E2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       SplineMaterials;                                   // 0x0E30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  BlockInteractTags;                                 // 0x0E40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TilingDivisor;                                     // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddSplineMeshSegment(class USplineMeshComponent** SplineMeshSegment);
	void AutoSmoothTanget(const struct FVector& Tangent, const struct FVector& PointA, const struct FVector& PointB, struct FVector* SmoothedTangent);
	void Calc_Auto_Location_At_Alpha(double InAlpha, bool DrawDebug, struct FVector* PointLocation);
	void CalculatePositionOfPoles();
	void ExecuteUbergraph_BP_Athena_Environmental_ZipLine_Spline(int32 EntryPoint);
	void GetAutoHorizAndVertVectors(const struct FVector& highVector, const struct FVector& LowVector, struct FVector* VertVec, struct FVector* HorizVec);
	void HandlePoleDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void PlayerAttachedToZipline(class AFortPlayerPawn* PlayerPawn);
	void PlayerDetachedFromZipline(class AFortPlayerPawn* PlayerPawn);
	void ReceiveBeginPlay();
	void SetCableTilingBySplineLength(class UMeshComponent* Target);
	void SetInteractionCollision();
	void SetSplinePositionAndTangent(bool SetPosition, bool SetTangent, int32 ID);
	void UserConstructionScript();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Athena_Environmental_ZipLine_Spline_C">();
	}
	static class ABP_Athena_Environmental_ZipLine_Spline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Athena_Environmental_ZipLine_Spline_C>();
	}
};
static_assert(alignof(ABP_Athena_Environmental_ZipLine_Spline_C) == 0x000008, "Wrong alignment on ABP_Athena_Environmental_ZipLine_Spline_C");
static_assert(sizeof(ABP_Athena_Environmental_ZipLine_Spline_C) == 0x000E68, "Wrong size on ABP_Athena_Environmental_ZipLine_Spline_C");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, UberGraphFrame) == 0x000D40, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, EndPointInteractSphere) == 0x000D48, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::EndPointInteractSphere' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, StartPointInteractSphere) == 0x000D50, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::StartPointInteractSphere' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, SplineStaticMesh) == 0x000D58, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::SplineStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, TangentSmoothStrength) == 0x000D60, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::TangentSmoothStrength' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, AutoSmoothTangents) == 0x000D68, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::AutoSmoothTangents' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, ForwardMeshAxis) == 0x000D69, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::ForwardMeshAxis' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, MotorOffset) == 0x000D70, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::MotorOffset' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, PoleA) == 0x000D88, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::PoleA' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, PoleB) == 0x000D90, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::PoleB' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, PoleASocketLocation) == 0x000D98, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::PoleASocketLocation' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, PoleBSocketLocation) == 0x000DB0, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::PoleBSocketLocation' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, LowerPointID) == 0x000DC8, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::LowerPointID' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, HigherPointID) == 0x000DCC, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::HigherPointID' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, HigherEndLocation) == 0x000DD0, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::HigherEndLocation' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, LowerEndLocation) == 0x000DE8, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::LowerEndLocation' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, AutoLinearFactorLow) == 0x000E00, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::AutoLinearFactorLow' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, AutoLinearFactorHigh) == 0x000E08, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::AutoLinearFactorHigh' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, AutoSplineTangentLengthCoef) == 0x000E10, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::AutoSplineTangentLengthCoef' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, AutoSplineTangentHorizCoef) == 0x000E18, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::AutoSplineTangentHorizCoef' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, AutoSplineTangentVertCoef) == 0x000E20, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::AutoSplineTangentVertCoef' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, Auto_Set_Spline_Ends) == 0x000E28, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::Auto_Set_Spline_Ends' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, Auto_Set_Spline_Mids) == 0x000E29, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::Auto_Set_Spline_Mids' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, SplineMaterials) == 0x000E30, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::SplineMaterials' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, BlockInteractTags) == 0x000E40, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::BlockInteractTags' has a wrong offset!");
static_assert(offsetof(ABP_Athena_Environmental_ZipLine_Spline_C, TilingDivisor) == 0x000E60, "Member 'ABP_Athena_Environmental_ZipLine_Spline_C::TilingDivisor' has a wrong offset!");

}

