#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollection_ProgressPlayerEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollection_ProgressPlayerEntry.BP_AthenaCollection_ProgressPlayerEntry_C.BP_OnPlayerProgressInitialized
// 0x000C (0x000C - 0x0000)
struct BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized final
{
public:
	bool                                          bIsLocalPlayer;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumCollected;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumToCollect;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized) == 0x000004, "Wrong alignment on BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized");
static_assert(sizeof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized) == 0x00000C, "Wrong size on BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized, bIsLocalPlayer) == 0x000000, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized::bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized, NumCollected) == 0x000004, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized::NumCollected' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized, NumToCollect) == 0x000008, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnPlayerProgressInitialized::NumToCollect' has a wrong offset!");

// Function BP_AthenaCollection_ProgressPlayerEntry.BP_AthenaCollection_ProgressPlayerEntry_C.BP_OnShowPlayerInfoSet
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet final
{
public:
	bool                                          bShowPlayerInfo;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet) == 0x000001, "Wrong alignment on BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet");
static_assert(sizeof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet) == 0x000001, "Wrong size on BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet, bShowPlayerInfo) == 0x000000, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_BP_OnShowPlayerInfoSet::bShowPlayerInfo' has a wrong offset!");

// Function BP_AthenaCollection_ProgressPlayerEntry.BP_AthenaCollection_ProgressPlayerEntry_C.ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry
// 0x0290 (0x0290 - 0x0000)
struct BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLocalPlayer;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NumCollected;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumToCollect;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0110(0x0050)(HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0200(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0218(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x022C(0x0014)()
	bool                                          K2Node_Event_bShowPlayerInfo;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable;                                // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_1;                              // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default_1;                           // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_247[0x1];                                      // 0x0247(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0250(0x0014)()
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_4;                           // 0x0267(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_5;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry) == 0x000008, "Wrong alignment on BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry");
static_assert(sizeof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry) == 0x000290, "Wrong size on BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, EntryPoint) == 0x000000, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_bool_Variable) == 0x000004, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_bool_Variable_1) == 0x000005, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_bool_Variable_2) == 0x000006, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_struct_Variable) == 0x000008, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_struct_Variable_1) == 0x000018, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Event_bIsLocalPlayer) == 0x000028, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Event_bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Event_NumCollected) == 0x00002C, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Event_NumCollected' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Event_NumToCollect) == 0x000030, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Event_NumToCollect' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_GetEndTime_ReturnValue) == 0x000040, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000A0, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Divide_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000108, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeStruct_FormatArgumentData_2) == 0x000110, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Select_Default) == 0x000160, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeArray_Array) == 0x000170, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000180, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Format_ReturnValue) == 0x000188, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001A0, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeArray_Array_1) == 0x0001F0, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_Format_ReturnValue_1) == 0x000200, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeStruct_SlateColor) == 0x000218, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_MakeStruct_SlateColor_1) == 0x00022C, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Event_bShowPlayerInfo) == 0x000240, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Event_bShowPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_bool_Variable_3) == 0x000241, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_byte_Variable) == 0x000242, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_byte_Variable_1) == 0x000243, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_bool_Variable_4) == 0x000244, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Select_Default_1) == 0x000245, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_bool_Variable_5) == 0x000246, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Select_Default_2) == 0x000248, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Select_Default_3) == 0x000250, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_byte_Variable_2) == 0x000264, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, Temp_byte_Variable_3) == 0x000265, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Event_IsDesignTime) == 0x000266, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Select_Default_4) == 0x000267, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000268, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, K2Node_Select_Default_5) == 0x000270, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_IsMobileGame_ReturnValue) == 0x000278, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_SelectFloat_ReturnValue) == 0x000280, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000288, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_ExecuteUbergraph_BP_AthenaCollection_ProgressPlayerEntry::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function BP_AthenaCollection_ProgressPlayerEntry.BP_AthenaCollection_ProgressPlayerEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct");
static_assert(sizeof(BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct) == 0x000001, "Wrong size on BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct");
static_assert(offsetof(BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AthenaCollection_ProgressPlayerEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

