#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionScreenInfoOverlayCharacterServices

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CharacterCollectionMapScreen_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AthenaCollectionScreenInfoOverlayCharacterServices.BP_AthenaCollectionScreenInfoOverlayCharacterServices_C
// 0x0098 (0x05B0 - 0x0518)
class UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C final : public UCollectionNPCServiceInfoOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReloadInfo;                                        // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_118;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RadialBloom;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestionMark;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Descriptions;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Locations;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_AllInfos;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Current_location;                                  // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_location;                                    // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocationTrackerColor;                              // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocationTrackerColor_Complete;                     // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           State;                                             // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LocationRGBA2_Base;                                // 0x058C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocationRGBA2_Hover;                               // 0x059C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnCollectedStateSet(EFortCollectedState CollectedState);
	void BP_OnLocationsFoundSet_1(int32 NumFound, int32 NumAvailable, bool bAllFound);
	void ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AthenaCollectionScreenInfoOverlayCharacterServices_C">();
	}
	static class UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C>();
	}
};
static_assert(alignof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C) == 0x000008, "Wrong alignment on UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C");
static_assert(sizeof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C) == 0x0005B0, "Wrong size on UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, UberGraphFrame) == 0x000518, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, ReloadInfo) == 0x000520, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::ReloadInfo' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, Image_64) == 0x000528, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::Image_64' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, Image_118) == 0x000530, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::Image_118' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, Image_RadialBloom) == 0x000538, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::Image_RadialBloom' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, QuestionMark) == 0x000540, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::QuestionMark' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, SizeBox_Descriptions) == 0x000548, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::SizeBox_Descriptions' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, Switcher_Locations) == 0x000550, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::Switcher_Locations' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, VerticalBox_AllInfos) == 0x000558, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::VerticalBox_AllInfos' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, Current_location) == 0x000560, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::Current_location' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, Total_location) == 0x000564, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::Total_location' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, LocationTrackerColor) == 0x000568, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::LocationTrackerColor' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, LocationTrackerColor_Complete) == 0x000578, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::LocationTrackerColor_Complete' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, State) == 0x000588, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::State' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, LocationRGBA2_Base) == 0x00058C, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::LocationRGBA2_Base' has a wrong offset!");
static_assert(offsetof(UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C, LocationRGBA2_Hover) == 0x00059C, "Member 'UBP_AthenaCollectionScreenInfoOverlayCharacterServices_C::LocationRGBA2_Hover' has a wrong offset!");

}

