#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionScreenInfoOverlayCharacterServices

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionScreenInfoOverlayCharacterServices.BP_AthenaCollectionScreenInfoOverlayCharacterServices_C.BP_OnCollectedStateSet
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet final
{
public:
	EFortCollectedState                           CollectedState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet) == 0x000001, "Wrong alignment on BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet");
static_assert(sizeof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet) == 0x000001, "Wrong size on BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet, CollectedState) == 0x000000, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnCollectedStateSet::CollectedState' has a wrong offset!");

// Function BP_AthenaCollectionScreenInfoOverlayCharacterServices.BP_AthenaCollectionScreenInfoOverlayCharacterServices_C.BP_OnLocationsFoundSet_1
// 0x000C (0x000C - 0x0000)
struct BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1 final
{
public:
	int32                                         NumFound;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumAvailable;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllFound;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1) == 0x000004, "Wrong alignment on BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1");
static_assert(sizeof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1) == 0x00000C, "Wrong size on BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1, NumFound) == 0x000000, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1::NumFound' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1, NumAvailable) == 0x000004, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1::NumAvailable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1, bAllFound) == 0x000008, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_BP_OnLocationsFoundSet_1::bAllFound' has a wrong offset!");

// Function BP_AthenaCollectionScreenInfoOverlayCharacterServices.BP_AthenaCollectionScreenInfoOverlayCharacterServices_C.ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices
// 0x0030 (0x0030 - 0x0000)
struct BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumFound;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumAvailable;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAllFound;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_3;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           K2Node_Event_CollectedState;                       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices) == 0x000008, "Wrong alignment on BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices");
static_assert(sizeof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices) == 0x000030, "Wrong size on BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Event_NumFound) == 0x000004, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Event_NumFound' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Event_NumAvailable) == 0x000008, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Event_NumAvailable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Event_bAllFound) == 0x00000C, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Event_bAllFound' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable) == 0x00000D, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_bool_Variable) == 0x00000E, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_1) == 0x00000F, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_2) == 0x000010, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_3) == 0x000011, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_4) == 0x000012, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_5) == 0x000013, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_6) == 0x000014, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_7) == 0x000015, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_8) == 0x000016, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_9) == 0x000017, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_10) == 0x000018, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_11) == 0x000019, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_12) == 0x00001A, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_13) == 0x00001B, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001C, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Select_Default) == 0x00001D, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Select_Default_1) == 0x00001E, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Event_CollectedState) == 0x00001F, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Event_CollectedState' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_byte_Variable_14) == 0x000020, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, Temp_bool_Variable_1) == 0x000021, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, K2Node_Select_Default_2) == 0x000022, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'BP_AthenaCollectionScreenInfoOverlayCharacterServices_C_ExecuteUbergraph_BP_AthenaCollectionScreenInfoOverlayCharacterServices::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

