#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionPlayerProgressTrack

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionPlayerProgressTrack.BP_AthenaCollectionPlayerProgressTrack_C.BP_OnPlayerProgressEntriesCreated
// 0x0018 (0x0018 - 0x0000)
struct BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated final
{
public:
	TArray<class UAthenaCollectionPlayerProgress*> PlayerProgressEntries;                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         NumToCollect;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated) == 0x000008, "Wrong alignment on BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated");
static_assert(sizeof(BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated) == 0x000018, "Wrong size on BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated, PlayerProgressEntries) == 0x000000, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated::PlayerProgressEntries' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated, NumToCollect) == 0x000010, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_BP_OnPlayerProgressEntriesCreated::NumToCollect' has a wrong offset!");

// Function BP_AthenaCollectionPlayerProgressTrack.BP_AthenaCollectionPlayerProgressTrack_C.ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack
// 0x00C8 (0x00C8 - 0x0000)
struct BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthenaCollectionPlayerProgress*> K2Node_Event_PlayerProgressEntries;                // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_Event_NumToCollect;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCollectionPlayerProgress*        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumCollected_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_ReturnValue;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumCollected_ReturnValue_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack) == 0x000008, "Wrong alignment on BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack");
static_assert(sizeof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack) == 0x0000C8, "Wrong size on BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, Temp_bool_Variable) == 0x000004, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, K2Node_Event_PlayerProgressEntries) == 0x000008, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::K2Node_Event_PlayerProgressEntries' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, K2Node_Event_NumToCollect) == 0x000018, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::K2Node_Event_NumToCollect' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x000030, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_GetNumCollected_ReturnValue) == 0x000058, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_GetNumCollected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_IsLocalPlayer_ReturnValue) == 0x00005C, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_IsLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_GetNumCollected_ReturnValue_1) == 0x000064, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_GetNumCollected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000070, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000078, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, Temp_int_Variable) == 0x000080, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_AddChildToUniformGrid_ReturnValue_1) == 0x000088, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_AddChildToUniformGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, K2Node_Select_Default) == 0x000090, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000094, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, K2Node_Event_IsDesignTime) == 0x000098, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000B8, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000C0, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_ExecuteUbergraph_BP_AthenaCollectionPlayerProgressTrack::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_AthenaCollectionPlayerProgressTrack.BP_AthenaCollectionPlayerProgressTrack_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct) == 0x000001, "Wrong alignment on BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct");
static_assert(sizeof(BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct) == 0x000001, "Wrong size on BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct");
static_assert(offsetof(BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_AthenaCollectionPlayerProgressTrack_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

