#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaQuestPanelControlsWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaQuestPanelControlsWidget.BP_AthenaQuestPanelControlsWidget_C.BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_AthenaQuestPanelControlsWidget_C_BndEvt__BP_AthenaQuestPanelControlsWidget_Button_PinSelectedQuest_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_AthenaQuestPanelControlsWidget.BP_AthenaQuestPanelControlsWidget_C.BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_AthenaQuestPanelControlsWidget_C_BndEvt__Button_QuestNPCIcons_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_AthenaQuestPanelControlsWidget.BP_AthenaQuestPanelControlsWidget_C.BP_OnSortTypeTextChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged final
{
public:
	class FText                                   TypeText;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged) == 0x000008, "Wrong alignment on BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged");
static_assert(sizeof(BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged) == 0x000018, "Wrong size on BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged, TypeText) == 0x000000, "Member 'BP_AthenaQuestPanelControlsWidget_C_BP_OnSortTypeTextChanged::TypeText' has a wrong offset!");

// Function BP_AthenaQuestPanelControlsWidget.BP_AthenaQuestPanelControlsWidget_C.ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget
// 0x0058 (0x0058 - 0x0000)
struct BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_TypeText;                             // 0x0008(0x0018)(ConstParm)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget) == 0x000008, "Wrong alignment on BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget");
static_assert(sizeof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget) == 0x000058, "Wrong size on BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, EntryPoint) == 0x000000, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, K2Node_Event_TypeText) == 0x000008, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::K2Node_Event_TypeText' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base) == 0x000030, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget, CallFunc_Contains_ReturnValue) == 0x000050, "Member 'BP_AthenaQuestPanelControlsWidget_C_ExecuteUbergraph_BP_AthenaQuestPanelControlsWidget::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_AthenaQuestPanelControlsWidget.BP_AthenaQuestPanelControlsWidget_C.Set Mobile Visuals
// 0x0138 (0x0138 - 0x0000)
struct BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_3;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_2;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_4;                              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_4;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_3;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_4;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_6;                              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_real_Variable_7;                              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_6;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_5;             // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_6;             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_7;             // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_8;             // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_9;             // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_10;            // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals) == 0x000008, "Wrong alignment on BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals");
static_assert(sizeof(BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals) == 0x000138, "Wrong size on BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals, Temp_bool_Variable) == 0x000000, "Member 'BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals, Temp_byte_Variable) == 0x000001, "Member 'BP_AthenaQuestPanelControlsWidget_C_Set_Mobile_Visuals::Temp_byte_Variable' has a wrong offset!");
