#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionScreenMapCharacter

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionScreenMapCharacter.BP_AthenaCollectionScreenMapCharacter_C.ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter
// 0x0018 (0x0018 - 0x0000)
struct BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AthenaCollectionPlayerProgressTrack_C* K2Node_CustomEvent_PlayerProgressContainer;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter) == 0x000008, "Wrong alignment on BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter");
static_assert(sizeof(BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter) == 0x000018, "Wrong size on BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter");
static_assert(offsetof(BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter, K2Node_CustomEvent_PlayerProgressContainer) == 0x000008, "Member 'BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter::K2Node_CustomEvent_PlayerProgressContainer' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'BP_AthenaCollectionScreenMapCharacter_C_ExecuteUbergraph_BP_AthenaCollectionScreenMapCharacter::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function BP_AthenaCollectionScreenMapCharacter.BP_AthenaCollectionScreenMapCharacter_C.PlayerProgressContainer_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0 final
{
public:
	class UBP_AthenaCollectionPlayerProgressTrack_C* PlayerProgressContainer_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0) == 0x000008, "Wrong alignment on BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0");
static_assert(sizeof(BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0) == 0x000008, "Wrong size on BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0");
static_assert(offsetof(BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0, PlayerProgressContainer_0) == 0x000000, "Member 'BP_AthenaCollectionScreenMapCharacter_C_PlayerProgressContainer_Event_0::PlayerProgressContainer_0' has a wrong offset!");

}

