#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AthenaCollectionListEntryCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_AthenaCollectionListEntryCharacter.BP_AthenaCollectionListEntryCharacter_C.BP_OnCollectionStateSet
// 0x0001 (0x0001 - 0x0000)
struct BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet final
{
public:
	EFortCollectedState                           CollectedState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet) == 0x000001, "Wrong alignment on BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet");
static_assert(sizeof(BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet) == 0x000001, "Wrong size on BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet, CollectedState) == 0x000000, "Member 'BP_AthenaCollectionListEntryCharacter_C_BP_OnCollectionStateSet::CollectedState' has a wrong offset!");

// Function BP_AthenaCollectionListEntryCharacter.BP_AthenaCollectionListEntryCharacter_C.ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter
// 0x01B0 (0x01B0 - 0x0000)
struct BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_13;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_10;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           K2Node_Event_CollectedState;                       // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x00C8(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue_2;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00F8(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x010C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0120(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_6;                           // 0x0134(0x0014)()
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_7;                           // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           Temp_byte_Variable_23;                             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter) == 0x000008, "Wrong alignment on BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter");
static_assert(sizeof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter) == 0x0001B0, "Wrong size on BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, EntryPoint) == 0x000000, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable) == 0x000004, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_1) == 0x000005, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_2) == 0x000006, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_3) == 0x000007, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_4) == 0x000008, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_5) == 0x000009, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_6) == 0x00000A, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_7) == 0x00000B, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_8) == 0x00000C, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_9) == 0x00000D, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_10) == 0x00000E, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_11) == 0x00000F, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_12) == 0x000010, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_bool_Variable) == 0x000011, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_bool_Variable_1) == 0x000012, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_bool_Variable_2) == 0x000013, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_13) == 0x000014, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable) == 0x000018, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_1) == 0x000020, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_2) == 0x000028, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_3) == 0x000030, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_4) == 0x000038, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_5) == 0x000040, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_6) == 0x000048, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_7) == 0x000050, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_8) == 0x000058, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_9) == 0x000060, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_bool_Variable_3) == 0x000068, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_10) == 0x000070, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_real_Variable_11) == 0x000078, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_bool_Variable_4) == 0x000080, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_14) == 0x000081, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_15) == 0x000082, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default) == 0x000083, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_PlayAnimationForward_ReturnValue) == 0x000088, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_GetSelected_ReturnValue) == 0x000090, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_GetSelected_ReturnValue_1) == 0x000092, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_IsUsingTouch_ReturnValue) == 0x000093, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_Not_PreBool_ReturnValue_1) == 0x000094, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_BooleanAND_ReturnValue) == 0x000095, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Event_CollectedState) == 0x000096, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Event_CollectedState' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000097, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_1) == 0x000098, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000099, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_BooleanOR_ReturnValue) == 0x00009A, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_2) == 0x0000A0, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000A8, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000B0, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_3) == 0x0000B8, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_16) == 0x0000C0, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_4) == 0x0000C8, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_17) == 0x0000E0, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_5) == 0x0000E4, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_GetSelected_ReturnValue_2) == 0x0000F4, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_GetSelected_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_MakeStruct_SlateColor) == 0x0000F8, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_MakeStruct_SlateColor_1) == 0x00010C, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_MakeStruct_SlateColor_2) == 0x000120, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_6) == 0x000134, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_18) == 0x000148, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_19) == 0x000149, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000150, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_20) == 0x000158, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_7) == 0x00015C, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_21) == 0x00016C, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000170, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_22) == 0x000178, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, Temp_byte_Variable_23) == 0x000179, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, K2Node_Select_Default_8) == 0x00017A, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000180, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000188, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000190, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000198, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0001A0, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001A8, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001AC, "Member 'BP_AthenaCollectionListEntryCharacter_C_ExecuteUbergraph_BP_AthenaCollectionListEntryCharacter::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_AthenaCollectionListEntryCharacter.BP_AthenaCollectionListEntryCharacter_C.Update Hover Parameter
// 0x0120 (0x0120 - 0x0000)
struct BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter final
{
public:
	double                                        Temp_real_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_4;                           // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter) == 0x000008, "Wrong alignment on BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter");
static_assert(sizeof(BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter) == 0x000120, "Wrong size on BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter, Temp_real_Variable) == 0x000000, "Member 'BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter, Temp_bool_Variable) == 0x000008, "Member 'BP_AthenaCollectionListEntryCharacter_C_Update_Hover_Parameter::Temp_bool_Variable' has a wrong offset!");
