#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldableButton_BuyLevel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldDecreased
// 0x0004 (0x0004 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased) == 0x000004, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldDecreased::HoldPercentage' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldEnded
// 0x0008 (0x0008 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded) == 0x000008, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldEnded::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldIncreased
// 0x0004 (0x0004 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased) == 0x000004, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldIncreased::HoldPercentage' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.BP_OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted) == 0x000004, "Wrong alignment on BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted) == 0x000008, "Wrong size on BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted, HoldPercentage) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted::HoldPercentage' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'BP_HoldableButton_BuyLevel_C_BP_OnHoldStarted::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.ExecuteUbergraph_BP_HoldableButton_BuyLevel
// 0x01A0 (0x01A0 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage_3;                     // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation_1;       // 0x002C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_2;                     // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation;         // 0x0034(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_1;                     // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage;                       // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput_1;       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x00A8(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel) == 0x000008, "Wrong alignment on BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel) == 0x0001A0, "Wrong size on BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, EntryPoint) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_2) == 0x000012, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_3) == 0x000013, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_4) == 0x000014, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage_3) == 0x000028, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage_3' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_bInUseSecondaryHoldAnimation_1) == 0x00002C, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_bInUseSecondaryHoldAnimation_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage_2) == 0x000030, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_bInUseSecondaryHoldAnimation) == 0x000034, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_bInUseSecondaryHoldAnimation' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000035, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage_1) == 0x000038, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SetFloatParameter_self_CastInput) == 0x000040, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SetFloatParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_HoldPercentage) == 0x000050, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_HoldPercentage' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SetFloatParameter_self_CastInput_1) == 0x000058, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SetFloatParameter_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Event_IsDesignTime) == 0x000068, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GetEndTime_ReturnValue) == 0x00006C, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GetEndTime_ReturnValue_1) == 0x000070, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000090, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_MakeStruct_SlateFontInfo) == 0x0000A8, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_IsValid_ReturnValue_5) == 0x000100, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_MakeVector2D_ReturnValue) == 0x000108, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, Temp_byte_Variable) == 0x000124, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, Temp_byte_Variable_1) == 0x000125, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000128, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, Temp_bool_Variable) == 0x000130, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_ReturnValue_2) == 0x000138, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, K2Node_Select_Default) == 0x000140, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000148, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000150, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000158, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000160, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000168, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x000170, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000180, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000188, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000190, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast) == 0x000194, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000198, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00019C, "Member 'BP_HoldableButton_BuyLevel_C_ExecuteUbergraph_BP_HoldableButton_BuyLevel::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_HoldableButton_BuyLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HoldableButton_BuyLevel_C_PreConstruct) == 0x000001, "Wrong alignment on BP_HoldableButton_BuyLevel_C_PreConstruct");
static_assert(sizeof(BP_HoldableButton_BuyLevel_C_PreConstruct) == 0x000001, "Wrong size on BP_HoldableButton_BuyLevel_C_PreConstruct");
static_assert(offsetof(BP_HoldableButton_BuyLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_HoldableButton_BuyLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

