#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HoldableButton_BuyLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HoldableButton_BuyLevel.BP_HoldableButton_BuyLevel_C
// 0x00C0 (0x1540 - 0x1480)
class UBP_HoldableButton_BuyLevel_C final : public UFortHoldableButton
{
public:
	uint8                                         Pad_1478[0x8];                                     // 0x1478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x1488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x1490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Button_text;                                       // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Subtitle;                                     // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    UnbindedInputActionWidget;                         // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x14C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        In_Width_Override;                                 // 0x14E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HoldProgressDMI;                                   // 0x14F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Size;                                              // 0x14F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_14FC[0x4];                                     // 0x14FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        In_Height_Override;                                // 0x1500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAudioComponent*                        FillingSoundAudioComponent;                        // 0x1508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillingSoundOverride;                              // 0x1510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillCompleteSoundOverride;                         // 0x1518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReleaseSound;                                      // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool IsHolding)> HoldActionProgress;                                // 0x1528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             Press_Sound;                                       // 0x1538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BP_HoldableButton_BuyLevel(int32 EntryPoint);
	void FillComplete();
	void PlayFillSound();
	void PreConstruct(bool IsDesignTime);
	void StopFillSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HoldableButton_BuyLevel_C">();
	}
	static class UBP_HoldableButton_BuyLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HoldableButton_BuyLevel_C>();
	}
};
static_assert(alignof(UBP_HoldableButton_BuyLevel_C) == 0x000010, "Wrong alignment on UBP_HoldableButton_BuyLevel_C");
static_assert(sizeof(UBP_HoldableButton_BuyLevel_C) == 0x001540, "Wrong size on UBP_HoldableButton_BuyLevel_C");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, UberGraphFrame) == 0x001480, "Member 'UBP_HoldableButton_BuyLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldCompleted) == 0x001488, "Member 'UBP_HoldableButton_BuyLevel_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldProgress) == 0x001490, "Member 'UBP_HoldableButton_BuyLevel_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Hover) == 0x001498, "Member 'UBP_HoldableButton_BuyLevel_C::Hover' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Button_text) == 0x0014A0, "Member 'UBP_HoldableButton_BuyLevel_C::Button_text' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Image_material) == 0x0014A8, "Member 'UBP_HoldableButton_BuyLevel_C::Image_material' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, SizeBox_0) == 0x0014B0, "Member 'UBP_HoldableButton_BuyLevel_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Text_Subtitle) == 0x0014B8, "Member 'UBP_HoldableButton_BuyLevel_C::Text_Subtitle' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, UnbindedInputActionWidget) == 0x0014C0, "Member 'UBP_HoldableButton_BuyLevel_C::UnbindedInputActionWidget' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, In_Text) == 0x0014C8, "Member 'UBP_HoldableButton_BuyLevel_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, In_Width_Override) == 0x0014E0, "Member 'UBP_HoldableButton_BuyLevel_C::In_Width_Override' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Material) == 0x0014E8, "Member 'UBP_HoldableButton_BuyLevel_C::Material' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldProgressDMI) == 0x0014F0, "Member 'UBP_HoldableButton_BuyLevel_C::HoldProgressDMI' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Size) == 0x0014F8, "Member 'UBP_HoldableButton_BuyLevel_C::Size' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, In_Height_Override) == 0x001500, "Member 'UBP_HoldableButton_BuyLevel_C::In_Height_Override' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, FillingSoundAudioComponent) == 0x001508, "Member 'UBP_HoldableButton_BuyLevel_C::FillingSoundAudioComponent' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, FillingSoundOverride) == 0x001510, "Member 'UBP_HoldableButton_BuyLevel_C::FillingSoundOverride' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, FillCompleteSoundOverride) == 0x001518, "Member 'UBP_HoldableButton_BuyLevel_C::FillCompleteSoundOverride' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, ReleaseSound) == 0x001520, "Member 'UBP_HoldableButton_BuyLevel_C::ReleaseSound' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, HoldActionProgress) == 0x001528, "Member 'UBP_HoldableButton_BuyLevel_C::HoldActionProgress' has a wrong offset!");
static_assert(offsetof(UBP_HoldableButton_BuyLevel_C, Press_Sound) == 0x001538, "Member 'UBP_HoldableButton_BuyLevel_C::Press_Sound' has a wrong offset!");

}

