#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerPawn_Athena_Phoebe

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C.AssignCosmeticVariant
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant final
{
public:
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant");
static_assert(sizeof(BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant) == 0x000018, "Wrong size on BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000000, "Member 'BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000008, "Member 'BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_PlayerPawn_Athena_Phoebe_C_AssignCosmeticVariant::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C.ComputeCosmeticVariantID
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID final
{
public:
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAIServicePlayerBots*             CallFunc_GetAIServicePlayerBots_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FetchNextCustomBotCosmeticVariantID_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID");
static_assert(sizeof(BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID) == 0x000018, "Wrong size on BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID, CallFunc_Less_IntInt_ReturnValue) == 0x000000, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID, CallFunc_GetAIServicePlayerBots_ReturnValue) == 0x000008, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID::CallFunc_GetAIServicePlayerBots_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID, CallFunc_FetchNextCustomBotCosmeticVariantID_ReturnValue) == 0x000010, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID::CallFunc_FetchNextCustomBotCosmeticVariantID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ComputeCosmeticVariantID::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C.ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe
// 0x0058 (0x0058 - 0x0000)
struct BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_LaunchVelocity;                       // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bXYOverride;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bZOverride;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_Event_Pawn;                                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe");
static_assert(sizeof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe) == 0x000058, "Wrong size on BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, EntryPoint) == 0x000000, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000010, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, K2Node_Event_LaunchVelocity) == 0x000020, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::K2Node_Event_LaunchVelocity' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, K2Node_Event_bXYOverride) == 0x000038, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::K2Node_Event_bXYOverride' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, K2Node_Event_bZOverride) == 0x000039, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::K2Node_Event_bZOverride' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, CallFunc_GetBlackboard_ReturnValue) == 0x000040, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, K2Node_Event_Pawn) == 0x000048, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe, CallFunc_HasAuthority_ReturnValue) == 0x000050, "Member 'BP_PlayerPawn_Athena_Phoebe_C_ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C.OnCharacterCustomizationCompleted
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted");
static_assert(sizeof(BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted) == 0x000008, "Wrong size on BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted, Pawn) == 0x000000, "Member 'BP_PlayerPawn_Athena_Phoebe_C_OnCharacterCustomizationCompleted::Pawn' has a wrong offset!");

// Function BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C.OnLaunched
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerPawn_Athena_Phoebe_C_OnLaunched final
{
public:
	struct FVector                                LaunchVelocity;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bXYOverride;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bZOverride;                                        // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerPawn_Athena_Phoebe_C_OnLaunched) == 0x000008, "Wrong alignment on BP_PlayerPawn_Athena_Phoebe_C_OnLaunched");
static_assert(sizeof(BP_PlayerPawn_Athena_Phoebe_C_OnLaunched) == 0x000020, "Wrong size on BP_PlayerPawn_Athena_Phoebe_C_OnLaunched");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_OnLaunched, LaunchVelocity) == 0x000000, "Member 'BP_PlayerPawn_Athena_Phoebe_C_OnLaunched::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_OnLaunched, bXYOverride) == 0x000018, "Member 'BP_PlayerPawn_Athena_Phoebe_C_OnLaunched::bXYOverride' has a wrong offset!");
static_assert(offsetof(BP_PlayerPawn_Athena_Phoebe_C_OnLaunched, bZOverride) == 0x000019, "Member 'BP_PlayerPawn_Athena_Phoebe_C_OnLaunched::bZOverride' has a wrong offset!");

}

