#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialTooltip

#include "Basic.hpp"

#include "BattlePassBase_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_TutorialTooltip.BP_TutorialTooltip_C
// 0x0160 (0x0400 - 0x02A0)
class UBP_TutorialTooltip_C final : public UFortBattlePassTutorialTooltip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       burstLoop;                                         // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxcontent;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            In_Brush;                                          // 0x02F0(0x00C0)(Edit, BlueprintVisible, ExposeOnSpawn)
	EHorizontalAlignment                          In_Horizontal_Alignment;                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVerticalAlignment                            In_Vertical_Alignment;                             // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       In_Transform;                                      // 0x03B8(0x0038)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                          Show_Icon;                                         // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Right;                                             // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TutorialTooltip(int32 EntryPoint);
	void HideTooltip();
	void PreConstruct(bool IsDesignTime);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TutorialTooltip_C">();
	}
	static class UBP_TutorialTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TutorialTooltip_C>();
	}
};
static_assert(alignof(UBP_TutorialTooltip_C) == 0x000010, "Wrong alignment on UBP_TutorialTooltip_C");
static_assert(sizeof(UBP_TutorialTooltip_C) == 0x000400, "Wrong size on UBP_TutorialTooltip_C");
static_assert(offsetof(UBP_TutorialTooltip_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_TutorialTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, burstLoop) == 0x0002A8, "Member 'UBP_TutorialTooltip_C::burstLoop' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, Show) == 0x0002B0, "Member 'UBP_TutorialTooltip_C::Show' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, HorizontalBoxcontent) == 0x0002B8, "Member 'UBP_TutorialTooltip_C::HorizontalBoxcontent' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, Icon) == 0x0002C0, "Member 'UBP_TutorialTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, Image_Arrow) == 0x0002C8, "Member 'UBP_TutorialTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, In_Text) == 0x0002D0, "Member 'UBP_TutorialTooltip_C::In_Text' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, In_Brush) == 0x0002F0, "Member 'UBP_TutorialTooltip_C::In_Brush' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, In_Horizontal_Alignment) == 0x0003B0, "Member 'UBP_TutorialTooltip_C::In_Horizontal_Alignment' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, In_Vertical_Alignment) == 0x0003B1, "Member 'UBP_TutorialTooltip_C::In_Vertical_Alignment' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, In_Transform) == 0x0003B8, "Member 'UBP_TutorialTooltip_C::In_Transform' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, Show_Icon) == 0x0003F0, "Member 'UBP_TutorialTooltip_C::Show_Icon' has a wrong offset!");
static_assert(offsetof(UBP_TutorialTooltip_C, Right) == 0x0003F8, "Member 'UBP_TutorialTooltip_C::Right' has a wrong offset!");

}

