#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS24_SeasonalDataWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS24_SeasonalDataWidget.BPS24_SeasonalDataWidget_C
// 0x0058 (0x02E8 - 0x0290)
class UBPS24_SeasonalDataWidget_C final : public UFortSeasonDataWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_392;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RaceTrack;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CurrentLevel;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Level;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_5stars;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     Bp_Material;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_Bp_Owned;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          OwnsBattlePass;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBPLevelForRewards;                              // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Value;                                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS24_SeasonalDataWidget(int32 EntryPoint);
	void OnBattlePassOwned();
	void OnLevelChanged();
	void OnProgressUpdated();
	void OnSuperCharged();
	void PreConstruct(bool IsDesignTime);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS24_SeasonalDataWidget_C">();
	}
	static class UBPS24_SeasonalDataWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS24_SeasonalDataWidget_C>();
	}
};
static_assert(alignof(UBPS24_SeasonalDataWidget_C) == 0x000008, "Wrong alignment on UBPS24_SeasonalDataWidget_C");
static_assert(sizeof(UBPS24_SeasonalDataWidget_C) == 0x0002E8, "Wrong size on UBPS24_SeasonalDataWidget_C");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, UberGraphFrame) == 0x000290, "Member 'UBPS24_SeasonalDataWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, Image_392) == 0x000298, "Member 'UBPS24_SeasonalDataWidget_C::Image_392' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, Image_RaceTrack) == 0x0002A0, "Member 'UBPS24_SeasonalDataWidget_C::Image_RaceTrack' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, RichText_CurrentLevel) == 0x0002A8, "Member 'UBPS24_SeasonalDataWidget_C::RichText_CurrentLevel' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, RichText_Level) == 0x0002B0, "Member 'UBPS24_SeasonalDataWidget_C::RichText_Level' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, VerticalBox_5stars) == 0x0002B8, "Member 'UBPS24_SeasonalDataWidget_C::VerticalBox_5stars' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, Bp_Material) == 0x0002C0, "Member 'UBPS24_SeasonalDataWidget_C::Bp_Material' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, On_Bp_Owned) == 0x0002C8, "Member 'UBPS24_SeasonalDataWidget_C::On_Bp_Owned' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, OwnsBattlePass) == 0x0002D8, "Member 'UBPS24_SeasonalDataWidget_C::OwnsBattlePass' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, MaxBPLevelForRewards) == 0x0002DC, "Member 'UBPS24_SeasonalDataWidget_C::MaxBPLevelForRewards' has a wrong offset!");
static_assert(offsetof(UBPS24_SeasonalDataWidget_C, Value) == 0x0002E0, "Member 'UBPS24_SeasonalDataWidget_C::Value' has a wrong offset!");

}

