#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS24_AboutModal_Pip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS24_AboutModal_Pip.BPS24_AboutModal_Pip_C
// 0x0040 (0x1420 - 0x13E0)
class UBPS24_AboutModal_Pip_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x13E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x13F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PIP;                                               // 0x13F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x1400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1401[0x7];                                     // 0x1401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ClickedOnPip;                                      // 0x1408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_BPS24_AboutModal_Pip(int32 EntryPoint);
	void Is_Focused(bool Is_Focused_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS24_AboutModal_Pip_C">();
	}
	static class UBPS24_AboutModal_Pip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS24_AboutModal_Pip_C>();
	}
};
static_assert(alignof(UBPS24_AboutModal_Pip_C) == 0x000010, "Wrong alignment on UBPS24_AboutModal_Pip_C");
static_assert(sizeof(UBPS24_AboutModal_Pip_C) == 0x001420, "Wrong size on UBPS24_AboutModal_Pip_C");
static_assert(offsetof(UBPS24_AboutModal_Pip_C, UberGraphFrame) == 0x0013E0, "Member 'UBPS24_AboutModal_Pip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS24_AboutModal_Pip_C, Hover) == 0x0013E8, "Member 'UBPS24_AboutModal_Pip_C::Hover' has a wrong offset!");
static_assert(offsetof(UBPS24_AboutModal_Pip_C, Select) == 0x0013F0, "Member 'UBPS24_AboutModal_Pip_C::Select' has a wrong offset!");
static_assert(offsetof(UBPS24_AboutModal_Pip_C, PIP) == 0x0013F8, "Member 'UBPS24_AboutModal_Pip_C::PIP' has a wrong offset!");
static_assert(offsetof(UBPS24_AboutModal_Pip_C, IsFocused) == 0x001400, "Member 'UBPS24_AboutModal_Pip_C::IsFocused' has a wrong offset!");
static_assert(offsetof(UBPS24_AboutModal_Pip_C, ClickedOnPip) == 0x001408, "Member 'UBPS24_AboutModal_Pip_C::ClickedOnPip' has a wrong offset!");

}

