#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Burt_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0227 (0x0228 - 0x0001)
struct Burt_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1121;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1122;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1123;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1124;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1125;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1126;                              // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1127;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1128;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1129;                              // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_1130;                              // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1131;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1132;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1133;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1134;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1135;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1136;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1137;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1138;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1139;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1140;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1141;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1142;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1143;                              // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1144;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1145;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1146;                               // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1147;                              // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1148;                              // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1149;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1150;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1151;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1152;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1153;                               // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1154;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1155;                               // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1156;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1157;                              // 0x00D8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_1158;                               // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1159;                                 // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1160;                               // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1161;                               // 0x00F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1162;                              // 0x0100(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               __EnumProperty_1163;                               // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1164;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1165;                               // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1166;                               // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1167;                               // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1168;                              // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1169;                             // 0x0128(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1170;                              // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1171;                               // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1172;                               // 0x0159(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1173;                               // 0x015A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1174;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1175;                                // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1176;                               // 0x0164(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1177;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1178;                               // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1179;                                // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1180;                             // 0x0178(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0210(0x0018)()
};
static_assert(alignof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Burt_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000228, "Wrong size on Burt_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1121) == 0x000004, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1121' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1122) == 0x000008, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1122' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1123) == 0x00000C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1123' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1124) == 0x000010, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1124' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1125) == 0x000014, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1125' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1126) == 0x000018, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1126' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1127) == 0x000028, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1127' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1128) == 0x00002C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1128' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1129) == 0x000030, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1129' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1130) == 0x000040, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1130' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1131) == 0x000044, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1131' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1132) == 0x000048, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1132' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1133) == 0x00004C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1133' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1134) == 0x000050, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1134' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1135) == 0x000054, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1135' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1136) == 0x000058, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1136' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1137) == 0x00005C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1137' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1138) == 0x000060, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1138' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1139) == 0x000064, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1139' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1140) == 0x000068, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1140' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1141) == 0x00006C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1141' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1142) == 0x000070, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1142' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1143) == 0x000078, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1143' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1144) == 0x000088, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1144' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1145) == 0x00008C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1145' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1146) == 0x000090, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1146' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1147) == 0x000098, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1147' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1148) == 0x0000A8, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1148' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1149) == 0x0000B8, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1149' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1150) == 0x0000BC, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1150' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1151) == 0x0000C0, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1151' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1152) == 0x0000C4, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1152' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1153) == 0x0000C8, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1153' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1154) == 0x0000CC, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1154' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1155) == 0x0000D0, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1155' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1156) == 0x0000D4, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1156' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1157) == 0x0000D8, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1157' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1158) == 0x0000E8, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1158' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1159) == 0x0000F0, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1159' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1160) == 0x0000F8, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1160' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1161) == 0x0000F9, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1161' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1162) == 0x000100, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1162' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1163) == 0x000110, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1163' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1164) == 0x000114, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1164' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1165) == 0x000118, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1165' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1166) == 0x00011C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1166' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1167) == 0x000120, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1167' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1168) == 0x000124, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1168' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1169) == 0x000128, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1169' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1170) == 0x000154, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1170' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1171) == 0x000158, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1171' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1172) == 0x000159, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1172' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1173) == 0x00015A, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1173' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1174) == 0x00015C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1174' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1175) == 0x000160, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1175' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1176) == 0x000164, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1176' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1177) == 0x000168, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1177' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1178) == 0x00016C, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1178' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1179) == 0x000170, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1179' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1180) == 0x000178, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1180' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000190, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000210, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Burt_AnimBP.Burt_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0067 (0x0068 - 0x0001)
struct Burt_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x002B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_17;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_20;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_21;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_22;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_26;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Burt_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Burt_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Burt_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000068, "Wrong size on Burt_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Burt_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'Burt_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
