#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CategoryButton.CategoryButton_C
// 0x00B0 (0x1490 - 0x13E0)
class UCategoryButton_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseWarningIcon;                                  // 0x13E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x13F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Dim;                                               // 0x13F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSelect;                                          // 0x1400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnWarning;                                         // 0x1408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x1410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDiamondStatePip_C*                     DiamondStatePip;                                   // 0x1418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DisabledIcon;                                      // 0x1420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dim;                                         // 0x1428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Icon;                                    // 0x1430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x1438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x1440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x1448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Hovered;                                        // 0x1449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWarningOn;                                       // 0x144A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144B[0x5];                                     // 0x144B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Warning_Message;                                   // 0x1450(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TitleText;                                         // 0x1468(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Pad_Left;                                          // 0x1480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pad_Right;                                         // 0x1481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_CategoryButton(int32 EntryPoint);
	void PlayClickedEvents();
	void PreConstruct(bool IsDesignTime);
	void ResetState();
	void SetHovered(bool IsHovered_0);
	void SetSafeZonePadding(bool Pad_Left_0, bool Pad_Right_0);
	void SetSelected(bool IsSelected_0);
	void SetTitleText(const class FText& TitleText_0);
	void SetWarningStatus(bool WarningOn, const class FText& WarningMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CategoryButton_C">();
	}
	static class UCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCategoryButton_C>();
	}
};
static_assert(alignof(UCategoryButton_C) == 0x000010, "Wrong alignment on UCategoryButton_C");
static_assert(sizeof(UCategoryButton_C) == 0x001490, "Wrong size on UCategoryButton_C");
static_assert(offsetof(UCategoryButton_C, UberGraphFrame) == 0x0013E0, "Member 'UCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, PulseWarningIcon) == 0x0013E8, "Member 'UCategoryButton_C::PulseWarningIcon' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Reset) == 0x0013F0, "Member 'UCategoryButton_C::Reset' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Dim) == 0x0013F8, "Member 'UCategoryButton_C::Dim' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, OnSelect) == 0x001400, "Member 'UCategoryButton_C::OnSelect' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, OnWarning) == 0x001408, "Member 'UCategoryButton_C::OnWarning' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, OnHover) == 0x001410, "Member 'UCategoryButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, DiamondStatePip) == 0x001418, "Member 'UCategoryButton_C::DiamondStatePip' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, DisabledIcon) == 0x001420, "Member 'UCategoryButton_C::DisabledIcon' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Image_Dim) == 0x001428, "Member 'UCategoryButton_C::Image_Dim' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, NamedSlot_Icon) == 0x001430, "Member 'UCategoryButton_C::NamedSlot_Icon' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, SafeZone) == 0x001438, "Member 'UCategoryButton_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Text_Title) == 0x001440, "Member 'UCategoryButton_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, IsSelected) == 0x001448, "Member 'UCategoryButton_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Is_Hovered) == 0x001449, "Member 'UCategoryButton_C::Is_Hovered' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, IsWarningOn) == 0x00144A, "Member 'UCategoryButton_C::IsWarningOn' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Warning_Message) == 0x001450, "Member 'UCategoryButton_C::Warning_Message' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, TitleText) == 0x001468, "Member 'UCategoryButton_C::TitleText' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Pad_Left) == 0x001480, "Member 'UCategoryButton_C::Pad_Left' has a wrong offset!");
static_assert(offsetof(UCategoryButton_C, Pad_Right) == 0x001481, "Member 'UCategoryButton_C::Pad_Right' has a wrong offset!");

}

