#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCollectionMapScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// ScriptStruct CharacterCollectionMapScreen.NPCServiceData
// 0x0040 (0x0040 - 0x0000)
struct FNPCServiceData final
{
public:
	class FText                                   Name;                                              // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0018(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNPCServiceData) == 0x000008, "Wrong alignment on FNPCServiceData");
static_assert(sizeof(FNPCServiceData) == 0x000040, "Wrong size on FNPCServiceData");
static_assert(offsetof(FNPCServiceData, Name) == 0x000000, "Member 'FNPCServiceData::Name' has a wrong offset!");
static_assert(offsetof(FNPCServiceData, Icon) == 0x000018, "Member 'FNPCServiceData::Icon' has a wrong offset!");

// ScriptStruct CharacterCollectionMapScreen.NPCServiceWidgetData
// 0x0050 (0x0050 - 0x0000)
struct FNPCServiceWidgetData final
{
public:
	struct FNPCServiceData                        ServiceData;                                       // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UFortResourceItemDefinition*            CostResource;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CostAmount;                                        // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNPCServiceWidgetData) == 0x000008, "Wrong alignment on FNPCServiceWidgetData");
static_assert(sizeof(FNPCServiceWidgetData) == 0x000050, "Wrong size on FNPCServiceWidgetData");
static_assert(offsetof(FNPCServiceWidgetData, ServiceData) == 0x000000, "Member 'FNPCServiceWidgetData::ServiceData' has a wrong offset!");
static_assert(offsetof(FNPCServiceWidgetData, CostResource) == 0x000040, "Member 'FNPCServiceWidgetData::CostResource' has a wrong offset!");
static_assert(offsetof(FNPCServiceWidgetData, CostAmount) == 0x000048, "Member 'FNPCServiceWidgetData::CostAmount' has a wrong offset!");

// ScriptStruct CharacterCollectionMapScreen.NPCServiceDataRow
// 0x0068 (0x0070 - 0x0008)
struct FNPCServiceDataRow final : public FTableRowBase
{
public:
	struct FGameplayTagContainer                  ServiceTags;                                       // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                   PricingKey;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCServiceData                        ServiceData;                                       // 0x0030(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNPCServiceDataRow) == 0x000008, "Wrong alignment on FNPCServiceDataRow");
static_assert(sizeof(FNPCServiceDataRow) == 0x000070, "Wrong size on FNPCServiceDataRow");
static_assert(offsetof(FNPCServiceDataRow, ServiceTags) == 0x000008, "Member 'FNPCServiceDataRow::ServiceTags' has a wrong offset!");
static_assert(offsetof(FNPCServiceDataRow, PricingKey) == 0x000028, "Member 'FNPCServiceDataRow::PricingKey' has a wrong offset!");
static_assert(offsetof(FNPCServiceDataRow, ServiceData) == 0x000030, "Member 'FNPCServiceDataRow::ServiceData' has a wrong offset!");

// ScriptStruct CharacterCollectionMapScreen.NPCSpecializationDataRow
// 0x0048 (0x0050 - 0x0008)
struct FNPCSpecializationDataRow final : public FTableRowBase
{
public:
	class FName                                   PricingKey;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCServiceData                        ServiceData;                                       // 0x0010(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNPCSpecializationDataRow) == 0x000008, "Wrong alignment on FNPCSpecializationDataRow");
static_assert(sizeof(FNPCSpecializationDataRow) == 0x000050, "Wrong size on FNPCSpecializationDataRow");
static_assert(offsetof(FNPCSpecializationDataRow, PricingKey) == 0x000008, "Member 'FNPCSpecializationDataRow::PricingKey' has a wrong offset!");
static_assert(offsetof(FNPCSpecializationDataRow, ServiceData) == 0x000010, "Member 'FNPCSpecializationDataRow::ServiceData' has a wrong offset!");

// ScriptStruct CharacterCollectionMapScreen.CollectionScreenServiceData
// 0x0070 (0x0070 - 0x0000)
struct FCollectionScreenServiceData final
{
public:
	class UDataTable*                             ServiceDataTable;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             SpecializationDataTable;                           // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SeasonDataTableServicesTag;                        // 0x0010(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SeasonDataTableSalesTag;                           // 0x0014(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NpcPricingKeyRemapsTag;                            // 0x0018(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveTable*                            ItemCostTable;                                     // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveTable*                            ServiceCostTable;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AllowedServiceTagsForIcon;                         // 0x0030(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpecializationTagRoot;                             // 0x0050(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ItemNameAndCountFmt;                               // 0x0058(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCollectionScreenServiceData) == 0x000008, "Wrong alignment on FCollectionScreenServiceData");
static_assert(sizeof(FCollectionScreenServiceData) == 0x000070, "Wrong size on FCollectionScreenServiceData");
static_assert(offsetof(FCollectionScreenServiceData, ServiceDataTable) == 0x000000, "Member 'FCollectionScreenServiceData::ServiceDataTable' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, SpecializationDataTable) == 0x000008, "Member 'FCollectionScreenServiceData::SpecializationDataTable' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, SeasonDataTableServicesTag) == 0x000010, "Member 'FCollectionScreenServiceData::SeasonDataTableServicesTag' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, SeasonDataTableSalesTag) == 0x000014, "Member 'FCollectionScreenServiceData::SeasonDataTableSalesTag' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, NpcPricingKeyRemapsTag) == 0x000018, "Member 'FCollectionScreenServiceData::NpcPricingKeyRemapsTag' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, ItemCostTable) == 0x000020, "Member 'FCollectionScreenServiceData::ItemCostTable' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, ServiceCostTable) == 0x000028, "Member 'FCollectionScreenServiceData::ServiceCostTable' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, AllowedServiceTagsForIcon) == 0x000030, "Member 'FCollectionScreenServiceData::AllowedServiceTagsForIcon' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, SpecializationTagRoot) == 0x000050, "Member 'FCollectionScreenServiceData::SpecializationTagRoot' has a wrong offset!");
static_assert(offsetof(FCollectionScreenServiceData, ItemNameAndCountFmt) == 0x000058, "Member 'FCollectionScreenServiceData::ItemNameAndCountFmt' has a wrong offset!");

}

