#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chooser

#include "Basic.hpp"


namespace SDK::Params
{

// Function Chooser.ChooserFunctionLibrary.EvaluateChooser
// 0x0020 (0x0020 - 0x0000)
struct ChooserFunctionLibrary_EvaluateChooser final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UChooserTable*                    ChooserTable;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChooserFunctionLibrary_EvaluateChooser) == 0x000008, "Wrong alignment on ChooserFunctionLibrary_EvaluateChooser");
static_assert(sizeof(ChooserFunctionLibrary_EvaluateChooser) == 0x000020, "Wrong size on ChooserFunctionLibrary_EvaluateChooser");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooser, ContextObject) == 0x000000, "Member 'ChooserFunctionLibrary_EvaluateChooser::ContextObject' has a wrong offset!");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooser, ChooserTable) == 0x000008, "Member 'ChooserFunctionLibrary_EvaluateChooser::ChooserTable' has a wrong offset!");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooser, ObjectClass) == 0x000010, "Member 'ChooserFunctionLibrary_EvaluateChooser::ObjectClass' has a wrong offset!");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooser, ReturnValue) == 0x000018, "Member 'ChooserFunctionLibrary_EvaluateChooser::ReturnValue' has a wrong offset!");

// Function Chooser.ChooserFunctionLibrary.EvaluateChooserMulti
// 0x0028 (0x0028 - 0x0000)
struct ChooserFunctionLibrary_EvaluateChooserMulti final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UChooserTable*                    ChooserTable;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChooserFunctionLibrary_EvaluateChooserMulti) == 0x000008, "Wrong alignment on ChooserFunctionLibrary_EvaluateChooserMulti");
static_assert(sizeof(ChooserFunctionLibrary_EvaluateChooserMulti) == 0x000028, "Wrong size on ChooserFunctionLibrary_EvaluateChooserMulti");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooserMulti, ContextObject) == 0x000000, "Member 'ChooserFunctionLibrary_EvaluateChooserMulti::ContextObject' has a wrong offset!");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooserMulti, ChooserTable) == 0x000008, "Member 'ChooserFunctionLibrary_EvaluateChooserMulti::ChooserTable' has a wrong offset!");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooserMulti, ObjectClass) == 0x000010, "Member 'ChooserFunctionLibrary_EvaluateChooserMulti::ObjectClass' has a wrong offset!");
static_assert(offsetof(ChooserFunctionLibrary_EvaluateChooserMulti, ReturnValue) == 0x000018, "Member 'ChooserFunctionLibrary_EvaluateChooserMulti::ReturnValue' has a wrong offset!");

}

