#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfirmationWindow

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ConfirmationWindow.ConfirmationWindow_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ConfirmationWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.ConfigureConfirmationButton
// 0x0140 (0x0140 - 0x0000)
struct ConfirmationWindow_C_ConfigureConfirmationButton final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfirmationDialogAction              Action;                                            // 0x0010(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bSimpleConfirm;                                    // 0x0100(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            CTAButton;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetInputAction_ReturnValue;               // 0x0128(0x0010)(NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInputPriority_ReturnValue;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationWindow_C_ConfigureConfirmationButton) == 0x000010, "Wrong alignment on ConfirmationWindow_C_ConfigureConfirmationButton");
static_assert(sizeof(ConfirmationWindow_C_ConfigureConfirmationButton) == 0x000140, "Wrong size on ConfirmationWindow_C_ConfigureConfirmationButton");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, Button) == 0x000000, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::Button' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, Action) == 0x000010, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::Action' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, bSimpleConfirm) == 0x000100, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::bSimpleConfirm' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, CTAButton) == 0x000108, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::CTAButton' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, CallFunc_GetContext_ReturnValue) == 0x000110, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base) == 0x000118, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, CallFunc_GetInputAction_ReturnValue) == 0x000128, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::CallFunc_GetInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, CallFunc_TextIsEmpty_ReturnValue) == 0x000138, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ConfigureConfirmationButton, CallFunc_GetInputPriority_ReturnValue) == 0x00013C, "Member 'ConfirmationWindow_C_ConfigureConfirmationButton::CallFunc_GetInputPriority_ReturnValue' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.ConfigureDeclineButton
// 0x0008 (0x0008 - 0x0000)
struct ConfirmationWindow_C_ConfigureDeclineButton final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationWindow_C_ConfigureDeclineButton) == 0x000008, "Wrong alignment on ConfirmationWindow_C_ConfigureDeclineButton");
static_assert(sizeof(ConfirmationWindow_C_ConfigureDeclineButton) == 0x000008, "Wrong size on ConfirmationWindow_C_ConfigureDeclineButton");
static_assert(offsetof(ConfirmationWindow_C_ConfigureDeclineButton, Button) == 0x000000, "Member 'ConfirmationWindow_C_ConfigureDeclineButton::Button' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.ExecuteUbergraph_ConfirmationWindow
// 0x01F0 (0x01F0 - 0x0000)
struct ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDialogDescription_NUI             CallFunc_GetConfirmationDescription_ReturnValue;   // 0x0050(0x0160)(ConstParm, ContainsInstancedReference)
	class UCommonButtonBase*                      K2Node_Event_Button;                               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow) == 0x000010, "Wrong alignment on ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow");
static_assert(sizeof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow) == 0x0001F0, "Wrong size on ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, EntryPoint) == 0x000000, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, Temp_bool_Variable) == 0x000004, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_GetAllEntries_ReturnValue) == 0x000008, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, Temp_real_Variable) == 0x000018, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, Temp_real_Variable_1) == 0x000028, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, Temp_int_Array_Index_Variable) == 0x000030, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_Array_Get_Item) == 0x000038, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base) == 0x000040, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_GetConfirmationDescription_ReturnValue) == 0x000050, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_GetConfirmationDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, K2Node_Event_Button) == 0x0001B0, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::K2Node_Event_Button' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, K2Node_ComponentBoundEvent_Button) == 0x0001B8, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_IsMobileGame_ReturnValue) == 0x0001C0, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, K2Node_Event_IsDesignTime) == 0x0001C1, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, Temp_int_Loop_Counter_Variable) == 0x0001C4, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, K2Node_Select_Default) == 0x0001C8, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_Add_IntInt_ReturnValue) == 0x0001D4, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001D8, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x0001E0, "Member 'ConfirmationWindow_C_ExecuteUbergraph_ConfirmationWindow::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.GetInputAction
// 0x0050 (0x0050 - 0x0000)
struct ConfirmationWindow_C_GetInputAction final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInputAction;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0020(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    Temp_struct_Variable;                              // 0x0030(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x0040(0x0010)(NoDestructor)
};
static_assert(alignof(ConfirmationWindow_C_GetInputAction) == 0x000008, "Wrong alignment on ConfirmationWindow_C_GetInputAction");
static_assert(sizeof(ConfirmationWindow_C_GetInputAction) == 0x000050, "Wrong size on ConfirmationWindow_C_GetInputAction");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, RowName) == 0x000000, "Member 'ConfirmationWindow_C_GetInputAction::RowName' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, UseInputAction) == 0x000004, "Member 'ConfirmationWindow_C_GetInputAction::UseInputAction' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, ReturnValue) == 0x000008, "Member 'ConfirmationWindow_C_GetInputAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, Temp_bool_Variable) == 0x000018, "Member 'ConfirmationWindow_C_GetInputAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, K2Node_MakeStruct_DataTableRowHandle) == 0x000020, "Member 'ConfirmationWindow_C_GetInputAction::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, Temp_struct_Variable) == 0x000030, "Member 'ConfirmationWindow_C_GetInputAction::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_GetInputAction, K2Node_Select_Default) == 0x000040, "Member 'ConfirmationWindow_C_GetInputAction::K2Node_Select_Default' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.Handle Configure Decline Button
// 0x01B0 (0x01B0 - 0x0000)
struct ConfirmationWindow_C_Handle_Configure_Decline_Button final
{
public:
	class UCommonButtonBase*                      New_Button;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            CTAButton;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDialogDescription_NUI             CallFunc_GetConfirmationDescription_ReturnValue;   // 0x0030(0x0160)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_GetInputPriority_ReturnValue;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0198(0x0010)(NoDestructor)
};
static_assert(alignof(ConfirmationWindow_C_Handle_Configure_Decline_Button) == 0x000010, "Wrong alignment on ConfirmationWindow_C_Handle_Configure_Decline_Button");
static_assert(sizeof(ConfirmationWindow_C_Handle_Configure_Decline_Button) == 0x0001B0, "Wrong size on ConfirmationWindow_C_Handle_Configure_Decline_Button");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, New_Button) == 0x000000, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::New_Button' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, CTAButton) == 0x000008, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::CTAButton' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base) == 0x000018, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, CallFunc_GetConfirmationDescription_ReturnValue) == 0x000030, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::CallFunc_GetConfirmationDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, CallFunc_GetInputPriority_ReturnValue) == 0x000190, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::CallFunc_GetInputPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_Handle_Configure_Decline_Button, K2Node_MakeStruct_DataTableRowHandle) == 0x000198, "Member 'ConfirmationWindow_C_Handle_Configure_Decline_Button::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.PlayShowSound
// 0x0170 (0x0170 - 0x0000)
struct ConfirmationWindow_C_PlayShowSound final
{
public:
	struct FFortDialogDescription_NUI             CallFunc_GetConfirmationDescription_ReturnValue;   // 0x0000(0x0160)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationWindow_C_PlayShowSound) == 0x000010, "Wrong alignment on ConfirmationWindow_C_PlayShowSound");
static_assert(sizeof(ConfirmationWindow_C_PlayShowSound) == 0x000170, "Wrong size on ConfirmationWindow_C_PlayShowSound");
static_assert(offsetof(ConfirmationWindow_C_PlayShowSound, CallFunc_GetConfirmationDescription_ReturnValue) == 0x000000, "Member 'ConfirmationWindow_C_PlayShowSound::CallFunc_GetConfirmationDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_PlayShowSound, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'ConfirmationWindow_C_PlayShowSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ConfirmationWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConfirmationWindow_C_PreConstruct) == 0x000001, "Wrong alignment on ConfirmationWindow_C_PreConstruct");
static_assert(sizeof(ConfirmationWindow_C_PreConstruct) == 0x000001, "Wrong size on ConfirmationWindow_C_PreConstruct");
static_assert(offsetof(ConfirmationWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ConfirmationWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ConfirmationWindow.ConfirmationWindow_C.TapToClose
// 0x03E0 (0x03E0 - 0x0000)
struct ConfirmationWindow_C_TapToClose final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0190(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_PointerEvent_IsTouchEvent_ReturnValue;    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B0(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0270(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x0328(0x00B8)()
};
static_assert(alignof(ConfirmationWindow_C_TapToClose) == 0x000008, "Wrong alignment on ConfirmationWindow_C_TapToClose");
static_assert(sizeof(ConfirmationWindow_C_TapToClose) == 0x0003E0, "Wrong size on ConfirmationWindow_C_TapToClose");
static_assert(offsetof(ConfirmationWindow_C_TapToClose, MyGeometry) == 0x000000, "Member 'ConfirmationWindow_C_TapToClose::MyGeometry' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_TapToClose, MouseEvent) == 0x000040, "Member 'ConfirmationWindow_C_TapToClose::MouseEvent' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_TapToClose, ReturnValue) == 0x0000D8, "Member 'ConfirmationWindow_C_TapToClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(ConfirmationWindow_C_TapToClose, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000190, "Member 'ConfirmationWindow_C_TapToClose::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
