#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConvertedMarkerInfo

#include "Basic.hpp"

#include "FortniteAI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConvertedMarkerInfo.ConvertedMarkerInfo_C
// 0x0120 (0x03B0 - 0x0290)
class UConvertedMarkerInfo_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Avatar;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Command;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              ImageSwitcher;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquadMarker;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DBNOPulseTimer;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RelevantPlaylistTags;                              // 0x02C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsTalking;                                        // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowBackgroundOverridden;                         // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnemyVersion;                                     // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon_Move;                                         // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_Hold;                                         // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_BackToMe;                                     // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_Revive;                                       // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_Attack;                                       // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ConvertedMarkerInfo(int32 EntryPoint);
	void InitNPCCommandIcon(const struct FLinearColor& Color);
	void InitPlayerIconState(class AFortPlayerStateAthena* PSA);
	void OnLoaded_25BCEE7642585A8BD6CE1CAFC70FEAF3(class UObject* Loaded);
	void OnLoaded_68559753464A154900ECA9BC6BB940C0(class UObject* Loaded);
	void OverrideShowBackground(bool bShowBackground);
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundVisibility(bool bOverride, bool bBackgroundVisible);
	void UpdateCommandIcon(EPingCommandType PingCommand, const struct FLinearColor& Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConvertedMarkerInfo_C">();
	}
	static class UConvertedMarkerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConvertedMarkerInfo_C>();
	}
};
static_assert(alignof(UConvertedMarkerInfo_C) == 0x000008, "Wrong alignment on UConvertedMarkerInfo_C");
static_assert(sizeof(UConvertedMarkerInfo_C) == 0x0003B0, "Wrong size on UConvertedMarkerInfo_C");
static_assert(offsetof(UConvertedMarkerInfo_C, UberGraphFrame) == 0x000290, "Member 'UConvertedMarkerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Image_Avatar) == 0x000298, "Member 'UConvertedMarkerInfo_C::Image_Avatar' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Image_Command) == 0x0002A0, "Member 'UConvertedMarkerInfo_C::Image_Command' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, ImageSwitcher) == 0x0002A8, "Member 'UConvertedMarkerInfo_C::ImageSwitcher' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, SquadMarker) == 0x0002B0, "Member 'UConvertedMarkerInfo_C::SquadMarker' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, DBNOPulseTimer) == 0x0002B8, "Member 'UConvertedMarkerInfo_C::DBNOPulseTimer' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, RelevantPlaylistTags) == 0x0002C0, "Member 'UConvertedMarkerInfo_C::RelevantPlaylistTags' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, bIsTalking) == 0x0002E0, "Member 'UConvertedMarkerInfo_C::bIsTalking' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, bShowBackgroundOverridden) == 0x0002E1, "Member 'UConvertedMarkerInfo_C::bShowBackgroundOverridden' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, bEnemyVersion) == 0x0002E2, "Member 'UConvertedMarkerInfo_C::bEnemyVersion' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Icon_Move) == 0x0002E8, "Member 'UConvertedMarkerInfo_C::Icon_Move' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Icon_Hold) == 0x000310, "Member 'UConvertedMarkerInfo_C::Icon_Hold' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Icon_BackToMe) == 0x000338, "Member 'UConvertedMarkerInfo_C::Icon_BackToMe' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Icon_Revive) == 0x000360, "Member 'UConvertedMarkerInfo_C::Icon_Revive' has a wrong offset!");
static_assert(offsetof(UConvertedMarkerInfo_C, Icon_Attack) == 0x000388, "Member 'UConvertedMarkerInfo_C::Icon_Attack' has a wrong offset!");

}

