#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticLoadoutCard

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.ExecuteUbergraph_CosmeticLoadoutCard
// 0x0350 (0x0350 - 0x0000)
struct CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLoadoutCardType                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFortLoadoutCardType                          Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0080(0x0018)()
	class UObject*                                Temp_object_Variable_6;                            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable_1;         // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_A_Execution_Happened_Variable_1;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_A_Execution_Happened_Variable_2;         // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable_2;         // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAthenaItemWrapDefinition*              CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x00E8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue_1;       // 0x0118(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue_2;       // 0x0148(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue_3;       // 0x0178(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x01AC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable_3;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_A_Execution_Happened_Variable_3;         // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_7;                            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0210(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0228(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0240(0x0018)()
	class UObject*                                Temp_object_Variable_8;                            // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0270(0x0058)(HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_9;                            // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_10;                           // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_5;                           // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterPreviewImage_ReturnValue;     // 0x0320(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard");
static_assert(sizeof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard) == 0x000350, "Wrong size on CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, EntryPoint) == 0x000000, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_byte_Variable) == 0x000004, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable) == 0x000008, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_1) == 0x000010, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_2) == 0x000018, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_3) == 0x000020, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_byte_Variable_1) == 0x000028, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_text_Variable) == 0x000030, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_text_Variable_1) == 0x000048, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_Variable) == 0x000060, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_byte_Variable_2) == 0x000061, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_byte_Variable_3) == 0x000062, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_Variable_1) == 0x000063, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_4) == 0x000068, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_5) == 0x000070, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_Variable_2) == 0x000078, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_text_Variable_2) == 0x000080, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_6) == 0x000098, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_B_Execution_Happened_Variable) == 0x0000A0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_A_Execution_Happened_Variable) == 0x0000A1, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_B_Execution_Happened_Variable_1) == 0x0000A2, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_B_Execution_Happened_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_BooleanAND_ReturnValue) == 0x0000A3, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_A_Execution_Happened_Variable_1) == 0x0000A4, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_A_Execution_Happened_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_A_Execution_Happened_Variable_2) == 0x0000A5, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_A_Execution_Happened_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A6, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_B_Execution_Happened_Variable_2) == 0x0000A7, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_B_Execution_Happened_Variable_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_BooleanAND_ReturnValue_2) == 0x0000A8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CustomEvent_Loaded_4) == 0x0000B0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x0000E8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000110, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_IsValid_ReturnValue_1) == 0x000111, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_GetSmallPreviewImage_ReturnValue_1) == 0x000118, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_GetSmallPreviewImage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_GetSmallPreviewImage_ReturnValue_2) == 0x000148, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_GetSmallPreviewImage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_IsValid_ReturnValue_3) == 0x000170, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_GetSmallPreviewImage_ReturnValue_3) == 0x000178, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_GetSmallPreviewImage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001AC, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_B_Execution_Happened_Variable_3) == 0x0001B8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_B_Execution_Happened_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_A_Execution_Happened_Variable_3) == 0x0001B9, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_A_Execution_Happened_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_BooleanAND_ReturnValue_3) == 0x0001BA, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_real_Variable) == 0x0001C0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_real_Variable_1) == 0x0001C8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_bool_Variable_3) == 0x0001D0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_7) == 0x0001D8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CustomEvent_Loaded) == 0x0001E0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001E8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Select_Default) == 0x0001F0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Select_Default_1) == 0x0001F8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Select_Default_2) == 0x000200, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000208, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_Conv_StringToText_ReturnValue) == 0x000210, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Select_Default_3) == 0x000228, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Select_Default_4) == 0x000240, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_8) == 0x000258, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000260, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CustomEvent_Loaded_1) == 0x000268, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_MakeStruct_SlateFontInfo) == 0x000270, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Event_IsDesignTime) == 0x0002C8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_9) == 0x0002D0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_MakeStruct_Margin) == 0x0002D8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CustomEvent_Loaded_2) == 0x0002E8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, Temp_object_Variable_10) == 0x0002F0, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_CustomEvent_Loaded_3) == 0x0002F8, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_IsInSubGame_ReturnValue) == 0x000300, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_IsInSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, K2Node_Select_Default_5) == 0x000308, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_PlayAnimationForward_ReturnValue) == 0x000310, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000318, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_GetCharacterPreviewImage_ReturnValue) == 0x000320, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_GetCharacterPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000348, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00034C, "Member 'CosmeticLoadoutCard_C_ExecuteUbergraph_CosmeticLoadoutCard::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.Get First Item
// 0x0018 (0x0018 - 0x0000)
struct CosmeticLoadoutCard_C_Get_First_Item final
{
public:
	TArray<class UFortItemDefinition*>            inArray;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UFortItemDefinition*                    Result;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_Get_First_Item) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_Get_First_Item");
static_assert(sizeof(CosmeticLoadoutCard_C_Get_First_Item) == 0x000018, "Wrong size on CosmeticLoadoutCard_C_Get_First_Item");
static_assert(offsetof(CosmeticLoadoutCard_C_Get_First_Item, inArray) == 0x000000, "Member 'CosmeticLoadoutCard_C_Get_First_Item::inArray' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_Get_First_Item, Result) == 0x000010, "Member 'CosmeticLoadoutCard_C_Get_First_Item::Result' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.IsBlank
// 0x0002 (0x0002 - 0x0000)
struct CosmeticLoadoutCard_C_IsBlank final
{
public:
	bool                                          Blank;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_IsBlank) == 0x000001, "Wrong alignment on CosmeticLoadoutCard_C_IsBlank");
static_assert(sizeof(CosmeticLoadoutCard_C_IsBlank) == 0x000002, "Wrong size on CosmeticLoadoutCard_C_IsBlank");
static_assert(offsetof(CosmeticLoadoutCard_C_IsBlank, Blank) == 0x000000, "Member 'CosmeticLoadoutCard_C_IsBlank::Blank' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_IsBlank, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'CosmeticLoadoutCard_C_IsBlank::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.OnLoaded_1E2615E24358EA93BCC3BBB4925113EE
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE");
static_assert(sizeof(CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE");
static_assert(offsetof(CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE, Loaded) == 0x000000, "Member 'CosmeticLoadoutCard_C_OnLoaded_1E2615E24358EA93BCC3BBB4925113EE::Loaded' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.OnLoaded_720B049647023D90A92C789B29FB1060
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060");
static_assert(sizeof(CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060");
static_assert(offsetof(CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060, Loaded) == 0x000000, "Member 'CosmeticLoadoutCard_C_OnLoaded_720B049647023D90A92C789B29FB1060::Loaded' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.OnLoaded_9C1753664F831A575C95389EB3050D6D
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D");
static_assert(sizeof(CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D");
static_assert(offsetof(CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D, Loaded) == 0x000000, "Member 'CosmeticLoadoutCard_C_OnLoaded_9C1753664F831A575C95389EB3050D6D::Loaded' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55");
static_assert(sizeof(CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55");
static_assert(offsetof(CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55, Loaded) == 0x000000, "Member 'CosmeticLoadoutCard_C_OnLoaded_B0945C234A1D7EE9DB994DA20F20FC55::Loaded' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.OnLoaded_C53A1CD444E6E41E6696819693452D69
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69");
static_assert(sizeof(CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69");
static_assert(offsetof(CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69, Loaded) == 0x000000, "Member 'CosmeticLoadoutCard_C_OnLoaded_C53A1CD444E6E41E6696819693452D69::Loaded' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.PlayHoverForward
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_PlayHoverForward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_PlayHoverForward) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_PlayHoverForward");
static_assert(sizeof(CosmeticLoadoutCard_C_PlayHoverForward) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_PlayHoverForward");
static_assert(offsetof(CosmeticLoadoutCard_C_PlayHoverForward, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'CosmeticLoadoutCard_C_PlayHoverForward::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.PlayHoverReverse
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_PlayHoverReverse final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_PlayHoverReverse) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_PlayHoverReverse");
static_assert(sizeof(CosmeticLoadoutCard_C_PlayHoverReverse) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_PlayHoverReverse");
static_assert(offsetof(CosmeticLoadoutCard_C_PlayHoverReverse, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'CosmeticLoadoutCard_C_PlayHoverReverse::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.PlaySelectedForward
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_PlaySelectedForward final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_PlaySelectedForward) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_PlaySelectedForward");
static_assert(sizeof(CosmeticLoadoutCard_C_PlaySelectedForward) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_PlaySelectedForward");
static_assert(offsetof(CosmeticLoadoutCard_C_PlaySelectedForward, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'CosmeticLoadoutCard_C_PlaySelectedForward::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.PlaySelectedReverse
// 0x0008 (0x0008 - 0x0000)
struct CosmeticLoadoutCard_C_PlaySelectedReverse final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_PlaySelectedReverse) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_PlaySelectedReverse");
static_assert(sizeof(CosmeticLoadoutCard_C_PlaySelectedReverse) == 0x000008, "Wrong size on CosmeticLoadoutCard_C_PlaySelectedReverse");
static_assert(offsetof(CosmeticLoadoutCard_C_PlaySelectedReverse, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'CosmeticLoadoutCard_C_PlaySelectedReverse::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CosmeticLoadoutCard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_PreConstruct) == 0x000001, "Wrong alignment on CosmeticLoadoutCard_C_PreConstruct");
static_assert(sizeof(CosmeticLoadoutCard_C_PreConstruct) == 0x000001, "Wrong size on CosmeticLoadoutCard_C_PreConstruct");
static_assert(offsetof(CosmeticLoadoutCard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CosmeticLoadoutCard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CosmeticLoadoutCard.CosmeticLoadoutCard_C.UpdateLoadoutSlotVisuals
// 0x0038 (0x0038 - 0x0000)
struct CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals final
{
public:
	class FName                                   PreviewImageTextureParameterName;                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DefaultSwitchScalarName;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             DefaultTexture;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals) == 0x000008, "Wrong alignment on CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals");
static_assert(sizeof(CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals) == 0x000038, "Wrong size on CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals");
static_assert(offsetof(CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals, PreviewImageTextureParameterName) == 0x000000, "Member 'CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals::PreviewImageTextureParameterName' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals, DefaultSwitchScalarName) == 0x000004, "Member 'CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals::DefaultSwitchScalarName' has a wrong offset!");
static_assert(offsetof(CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals, Object) == 0x000008, "Member 'CosmeticLoadoutCard_C_UpdateLoadoutSlotVisuals::Object' has a wrong offset!");
