#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CosmeticNotification.CosmeticNotification_C
// 0x0040 (0x0340 - 0x0300)
class UCosmeticNotification_C final : public UFortNotificationEntry_LevelUp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Content;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Reward_Glow;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlare;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Mobile;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsQuestCosmetic;                                  // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateQuestRewardVisuals(const class UFortItemDefinition* RewardItem, EFortRarity QuestRarity);
	void UpdateLevelUpVisuals(const class UFortItemDefinition* RewardItem);
	void StartNotificationOutro();
	void StartNotificationIntro();
	void SetStyle_QuestCosmetic(EFortRarity Rarity);
	void SetStyle_LevelUp();
	void PreConstruct(bool IsDesignTime);
	void OnOutroFinished();
	void OnIntroFinished();
	void ExecuteUbergraph_CosmeticNotification(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CosmeticNotification_C">();
	}
	static class UCosmeticNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticNotification_C>();
	}
};
static_assert(alignof(UCosmeticNotification_C) == 0x000008, "Wrong alignment on UCosmeticNotification_C");
static_assert(sizeof(UCosmeticNotification_C) == 0x000340, "Wrong size on UCosmeticNotification_C");
static_assert(offsetof(UCosmeticNotification_C, UberGraphFrame) == 0x000300, "Member 'UCosmeticNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, Outro) == 0x000308, "Member 'UCosmeticNotification_C::Outro' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, Intro) == 0x000310, "Member 'UCosmeticNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, CommonBorder_Content) == 0x000318, "Member 'UCosmeticNotification_C::CommonBorder_Content' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, Reward_Glow) == 0x000320, "Member 'UCosmeticNotification_C::Reward_Glow' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, RewardFlare) == 0x000328, "Member 'UCosmeticNotification_C::RewardFlare' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, ScaleBox_Mobile) == 0x000330, "Member 'UCosmeticNotification_C::ScaleBox_Mobile' has a wrong offset!");
static_assert(offsetof(UCosmeticNotification_C, bIsQuestCosmetic) == 0x000338, "Member 'UCosmeticNotification_C::bIsQuestCosmetic' has a wrong offset!");

}

