#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_CinematicSequence

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CRD_CinematicSequence_structs.hpp"


namespace SDK
{

// Class CRD_CinematicSequence.CinematicSequenceDeviceBase
// 0x0048 (0x0F40 - 0x0EF8)
class ACinematicSequenceDeviceBase final : public ABuildingProp
{
public:
	uint8                                         Pad_EF8[0x20];                                     // 0x0EF8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Sequence;                                          // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0F20(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerController*                  InstigatingController;                             // 0x0F28(0x0008)(BlueprintVisible, Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         InstigatingTeam;                                   // 0x0F30(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F31[0x3];                                      // 0x0F31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bLoopPlayback : 1;                                 // 0x0F34(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRestoreState : 1;                                 // 0x0F34(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAutoPlay : 1;                                     // 0x0F34(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_F35[0x3];                                      // 0x0F35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EFortMinigameState                            AutoPlayMinigameState;                             // 0x0F38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECinematicSequenceVisibility                  Visibility;                                        // 0x0F39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLevelSequenceActorAlwaysRelevant;                 // 0x0F3A(0x0001)(Edit, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F3B[0x5];                                      // 0x0F3B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSequencePlayerCreated(class ULevelSequencePlayer* Player);
	void Pause();
	void Play();
	void Stop();

	class UMovieSceneSequencePlayer* GetSequencePlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CinematicSequenceDeviceBase">();
	}
	static class ACinematicSequenceDeviceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACinematicSequenceDeviceBase>();
	}
};
static_assert(alignof(ACinematicSequenceDeviceBase) == 0x000008, "Wrong alignment on ACinematicSequenceDeviceBase");
static_assert(sizeof(ACinematicSequenceDeviceBase) == 0x000F40, "Wrong size on ACinematicSequenceDeviceBase");
static_assert(offsetof(ACinematicSequenceDeviceBase, Sequence) == 0x000F18, "Member 'ACinematicSequenceDeviceBase::Sequence' has a wrong offset!");
static_assert(offsetof(ACinematicSequenceDeviceBase, LevelSequenceActor) == 0x000F20, "Member 'ACinematicSequenceDeviceBase::LevelSequenceActor' has a wrong offset!");
static_assert(offsetof(ACinematicSequenceDeviceBase, InstigatingController) == 0x000F28, "Member 'ACinematicSequenceDeviceBase::InstigatingController' has a wrong offset!");
static_assert(offsetof(ACinematicSequenceDeviceBase, InstigatingTeam) == 0x000F30, "Member 'ACinematicSequenceDeviceBase::InstigatingTeam' has a wrong offset!");
static_assert(offsetof(ACinematicSequenceDeviceBase, AutoPlayMinigameState) == 0x000F38, "Member 'ACinematicSequenceDeviceBase::AutoPlayMinigameState' has a wrong offset!");
static_assert(offsetof(ACinematicSequenceDeviceBase, Visibility) == 0x000F39, "Member 'ACinematicSequenceDeviceBase::Visibility' has a wrong offset!");
static_assert(offsetof(ACinematicSequenceDeviceBase, bLevelSequenceActorAlwaysRelevant) == 0x000F3A, "Member 'ACinematicSequenceDeviceBase::bLevelSequenceActorAlwaysRelevant' has a wrong offset!");

}

