#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_CinematicSequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function CRD_CinematicSequence.CinematicSequenceDeviceBase.HandleSequencePlayerCreated
// 0x0008 (0x0008 - 0x0000)
struct CinematicSequenceDeviceBase_HandleSequencePlayerCreated final
{
public:
	class ULevelSequencePlayer*                   Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CinematicSequenceDeviceBase_HandleSequencePlayerCreated) == 0x000008, "Wrong alignment on CinematicSequenceDeviceBase_HandleSequencePlayerCreated");
static_assert(sizeof(CinematicSequenceDeviceBase_HandleSequencePlayerCreated) == 0x000008, "Wrong size on CinematicSequenceDeviceBase_HandleSequencePlayerCreated");
static_assert(offsetof(CinematicSequenceDeviceBase_HandleSequencePlayerCreated, Player) == 0x000000, "Member 'CinematicSequenceDeviceBase_HandleSequencePlayerCreated::Player' has a wrong offset!");

// Function CRD_CinematicSequence.CinematicSequenceDeviceBase.GetSequencePlayer
// 0x0008 (0x0008 - 0x0000)
struct CinematicSequenceDeviceBase_GetSequencePlayer final
{
public:
	class UMovieSceneSequencePlayer*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CinematicSequenceDeviceBase_GetSequencePlayer) == 0x000008, "Wrong alignment on CinematicSequenceDeviceBase_GetSequencePlayer");
static_assert(sizeof(CinematicSequenceDeviceBase_GetSequencePlayer) == 0x000008, "Wrong size on CinematicSequenceDeviceBase_GetSequencePlayer");
static_assert(offsetof(CinematicSequenceDeviceBase_GetSequencePlayer, ReturnValue) == 0x000000, "Member 'CinematicSequenceDeviceBase_GetSequencePlayer::ReturnValue' has a wrong offset!");

}

