#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_ClassSelectorUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CRD_ClassSelectorRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CRD_ClassSelectorUI.ClassSelectorLoadoutContainer
// 0x0048 (0x02D8 - 0x0290)
class UClassSelectorLoadoutContainer final : public UCommonUserWidget
{
public:
	class UWrapBox*                               WrapBox;                                           // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaItemElementWidgetBase> EntryWidgetClass;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaItemElementWidgetBase*>   EntryWidgets;                                      // 0x02A0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                    PreviewItemDef;                                    // 0x02B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumPreviewEntries;                                 // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BC[0x1C];                                     // 0x02BC(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorLoadoutContainer">();
	}
	static class UClassSelectorLoadoutContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorLoadoutContainer>();
	}
};
static_assert(alignof(UClassSelectorLoadoutContainer) == 0x000008, "Wrong alignment on UClassSelectorLoadoutContainer");
static_assert(sizeof(UClassSelectorLoadoutContainer) == 0x0002D8, "Wrong size on UClassSelectorLoadoutContainer");
static_assert(offsetof(UClassSelectorLoadoutContainer, WrapBox) == 0x000290, "Member 'UClassSelectorLoadoutContainer::WrapBox' has a wrong offset!");
static_assert(offsetof(UClassSelectorLoadoutContainer, EntryWidgetClass) == 0x000298, "Member 'UClassSelectorLoadoutContainer::EntryWidgetClass' has a wrong offset!");
static_assert(offsetof(UClassSelectorLoadoutContainer, EntryWidgets) == 0x0002A0, "Member 'UClassSelectorLoadoutContainer::EntryWidgets' has a wrong offset!");
static_assert(offsetof(UClassSelectorLoadoutContainer, PreviewItemDef) == 0x0002B0, "Member 'UClassSelectorLoadoutContainer::PreviewItemDef' has a wrong offset!");
static_assert(offsetof(UClassSelectorLoadoutContainer, NumPreviewEntries) == 0x0002B8, "Member 'UClassSelectorLoadoutContainer::NumPreviewEntries' has a wrong offset!");

// Class CRD_ClassSelectorUI.ClassSelectorTabButtons
// 0x00B8 (0x0348 - 0x0290)
class UClassSelectorTabButtons final : public UCommonUserWidget
{
public:
	class UCommonActionWidget*                    LeftActionWidget;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActionWidget*                    RightActionWidget;                                 // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             TabButtonsScrollBox;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      LeftButton;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      RightButton;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    LeftInputAction;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    RightInputAction;                                  // 0x02D0(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectorTeamTile*>         TabButtons;                                        // 0x02E8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UClassSelectorTeamTile>     TabButtonClass;                                    // 0x02F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                TabButtonPadding;                                  // 0x0300(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           DesignerPreviewTabNames;                           // 0x0318(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         ButtonScrollAmount;                                // 0x0328(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x1C];                                     // 0x032C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTabButtons">();
	}
	static class UClassSelectorTabButtons* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTabButtons>();
	}
};
static_assert(alignof(UClassSelectorTabButtons) == 0x000008, "Wrong alignment on UClassSelectorTabButtons");
static_assert(sizeof(UClassSelectorTabButtons) == 0x000348, "Wrong size on UClassSelectorTabButtons");
static_assert(offsetof(UClassSelectorTabButtons, LeftActionWidget) == 0x000290, "Member 'UClassSelectorTabButtons::LeftActionWidget' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, RightActionWidget) == 0x000298, "Member 'UClassSelectorTabButtons::RightActionWidget' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, TabButtonsScrollBox) == 0x0002A0, "Member 'UClassSelectorTabButtons::TabButtonsScrollBox' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, LeftButton) == 0x0002A8, "Member 'UClassSelectorTabButtons::LeftButton' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, RightButton) == 0x0002B0, "Member 'UClassSelectorTabButtons::RightButton' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, LeftInputAction) == 0x0002B8, "Member 'UClassSelectorTabButtons::LeftInputAction' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, RightInputAction) == 0x0002D0, "Member 'UClassSelectorTabButtons::RightInputAction' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, TabButtons) == 0x0002E8, "Member 'UClassSelectorTabButtons::TabButtons' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, TabButtonClass) == 0x0002F8, "Member 'UClassSelectorTabButtons::TabButtonClass' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, TabButtonPadding) == 0x000300, "Member 'UClassSelectorTabButtons::TabButtonPadding' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, DesignerPreviewTabNames) == 0x000318, "Member 'UClassSelectorTabButtons::DesignerPreviewTabNames' has a wrong offset!");
static_assert(offsetof(UClassSelectorTabButtons, ButtonScrollAmount) == 0x000328, "Member 'UClassSelectorTabButtons::ButtonScrollAmount' has a wrong offset!");

// Class CRD_ClassSelectorUI.ClassSelectorTeamInfoWidget
// 0x0018 (0x0280 - 0x0268)
class UClassSelectorTeamInfoWidget final : public UUserWidget
{
public:
	class UCommonTextBlock*                       TeamName;                                          // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       TeamCountText;                                     // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       TeamDescription;                                   // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTeamInfoWidget">();
	}
	static class UClassSelectorTeamInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTeamInfoWidget>();
	}
};
static_assert(alignof(UClassSelectorTeamInfoWidget) == 0x000008, "Wrong alignment on UClassSelectorTeamInfoWidget");
static_assert(sizeof(UClassSelectorTeamInfoWidget) == 0x000280, "Wrong size on UClassSelectorTeamInfoWidget");
static_assert(offsetof(UClassSelectorTeamInfoWidget, TeamName) == 0x000268, "Member 'UClassSelectorTeamInfoWidget::TeamName' has a wrong offset!");
static_assert(offsetof(UClassSelectorTeamInfoWidget, TeamCountText) == 0x000270, "Member 'UClassSelectorTeamInfoWidget::TeamCountText' has a wrong offset!");
static_assert(offsetof(UClassSelectorTeamInfoWidget, TeamDescription) == 0x000278, "Member 'UClassSelectorTeamInfoWidget::TeamDescription' has a wrong offset!");

// Class CRD_ClassSelectorUI.CreativeClassSelectorButton
// 0x0040 (0x1420 - 0x13E0)
class UCreativeClassSelectorButton : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                       ButtonTextBlock;                                   // 0x13E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActionWidget*                    ActionWidget;                                      // 0x13E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonText;                                        // 0x13F0(0x0018)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    buttonInputAction;                                 // 0x1408(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bAutoCapitalize;                                   // 0x1418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1419[0x7];                                     // 0x1419(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassSelectorButton">();
	}
	static class UCreativeClassSelectorButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassSelectorButton>();
	}
};
static_assert(alignof(UCreativeClassSelectorButton) == 0x000010, "Wrong alignment on UCreativeClassSelectorButton");
static_assert(sizeof(UCreativeClassSelectorButton) == 0x001420, "Wrong size on UCreativeClassSelectorButton");
static_assert(offsetof(UCreativeClassSelectorButton, ButtonTextBlock) == 0x0013E0, "Member 'UCreativeClassSelectorButton::ButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelectorButton, ActionWidget) == 0x0013E8, "Member 'UCreativeClassSelectorButton::ActionWidget' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelectorButton, ButtonText) == 0x0013F0, "Member 'UCreativeClassSelectorButton::ButtonText' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelectorButton, buttonInputAction) == 0x001408, "Member 'UCreativeClassSelectorButton::buttonInputAction' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelectorButton, bAutoCapitalize) == 0x001418, "Member 'UCreativeClassSelectorButton::bAutoCapitalize' has a wrong offset!");

// Class CRD_ClassSelectorUI.ClassSelectorTeamTile
// 0x00B0 (0x14D0 - 0x1420)
class UClassSelectorTeamTile final : public UCreativeClassSelectorButton
{
public:
	uint8                                         Pad_1420[0x90];                                    // 0x1420(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             PlayerCount;                                       // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       TeamIconImage;                                     // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C0[0x10];                                    // 0x14C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerCountSet(int32 NewPlayerCount);
	void OnTeamColorIndexSet(int32 TeamColorIndex);
	void OnTeamIconSet(const struct FCreativeIconOption& NewTeamIcon);
	void OnTeamSet(const struct FMinigameTeam& NewTeamData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTeamTile">();
	}
	static class UClassSelectorTeamTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTeamTile>();
	}
};
static_assert(alignof(UClassSelectorTeamTile) == 0x000010, "Wrong alignment on UClassSelectorTeamTile");
static_assert(sizeof(UClassSelectorTeamTile) == 0x0014D0, "Wrong size on UClassSelectorTeamTile");
static_assert(offsetof(UClassSelectorTeamTile, PlayerCount) == 0x0014B0, "Member 'UClassSelectorTeamTile::PlayerCount' has a wrong offset!");
static_assert(offsetof(UClassSelectorTeamTile, TeamIconImage) == 0x0014B8, "Member 'UClassSelectorTeamTile::TeamIconImage' has a wrong offset!");

// Class CRD_ClassSelectorUI.ClassSelectorTeamTiles
// 0x0048 (0x02D8 - 0x0290)
class UClassSelectorTeamTiles final : public UCommonUserWidget
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectorTeamTile*>         TeamTiles;                                         // 0x0298(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUniformGridPanel*                      RootPanel;                                         // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UClassSelectorTeamTile>     EntryClass;                                        // 0x02B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DesignerPreviewEntries;                            // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BC[0x1C];                                     // 0x02BC(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTeamTiles">();
	}
	static class UClassSelectorTeamTiles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTeamTiles>();
	}
};
static_assert(alignof(UClassSelectorTeamTiles) == 0x000008, "Wrong alignment on UClassSelectorTeamTiles");
static_assert(sizeof(UClassSelectorTeamTiles) == 0x0002D8, "Wrong size on UClassSelectorTeamTiles");
static_assert(offsetof(UClassSelectorTeamTiles, TeamTiles) == 0x000298, "Member 'UClassSelectorTeamTiles::TeamTiles' has a wrong offset!");
static_assert(offsetof(UClassSelectorTeamTiles, RootPanel) == 0x0002A8, "Member 'UClassSelectorTeamTiles::RootPanel' has a wrong offset!");
static_assert(offsetof(UClassSelectorTeamTiles, EntryClass) == 0x0002B0, "Member 'UClassSelectorTeamTiles::EntryClass' has a wrong offset!");
static_assert(offsetof(UClassSelectorTeamTiles, DesignerPreviewEntries) == 0x0002B8, "Member 'UClassSelectorTeamTiles::DesignerPreviewEntries' has a wrong offset!");

// Class CRD_ClassSelectorUI.CreativeClassItemInfo
// 0x0048 (0x0070 - 0x0028)
class UCreativeClassItemInfo final : public UObject
{
public:
	struct FMinigameClassSlot                     ClassSlot;                                         // 0x0028(0x0040)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassItemInfo">();
	}
	static class UCreativeClassItemInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassItemInfo>();
	}
};
static_assert(alignof(UCreativeClassItemInfo) == 0x000008, "Wrong alignment on UCreativeClassItemInfo");
static_assert(sizeof(UCreativeClassItemInfo) == 0x000070, "Wrong size on UCreativeClassItemInfo");
static_assert(offsetof(UCreativeClassItemInfo, ClassSlot) == 0x000028, "Member 'UCreativeClassItemInfo::ClassSlot' has a wrong offset!");

// Class CRD_ClassSelectorUI.CreativeClassEntry
// 0x0010 (0x1430 - 0x1420)
class UCreativeClassEntry final : public UCreativeClassSelectorButton
{
public:
	uint8                                         Pad_1420[0x8];                                     // 0x1420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreativeClassItemInfo*                 ItemInfo;                                          // 0x1428(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBrowsingLoadout(const bool bBrowsingLoadout);
	void OnClassEntryDataSet(const bool bIsCurrentClass, const bool bIsPendingClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassEntry">();
	}
	static class UCreativeClassEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassEntry>();
	}
};
static_assert(alignof(UCreativeClassEntry) == 0x000010, "Wrong alignment on UCreativeClassEntry");
static_assert(sizeof(UCreativeClassEntry) == 0x001430, "Wrong size on UCreativeClassEntry");
static_assert(offsetof(UCreativeClassEntry, ItemInfo) == 0x001428, "Member 'UCreativeClassEntry::ItemInfo' has a wrong offset!");

// Class CRD_ClassSelectorUI.CreativeClassSelector
// 0x0138 (0x04E0 - 0x03A8)
class UCreativeClassSelector final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectorTabButtons*               TabButtons_TeamSelection;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonListView*                        ListView_Classes;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCreativeClassItemInfo*>         ClassItemInfos;                                    // 0x03C8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UScrollBox*                             LoadoutScrollBox;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorLoadoutContainer*         LoadoutContainer_Inventory;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorLoadoutContainer*         LoadoutContainer_Resources;                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_SelectLoadout;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_RandomClass;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        Switcher_Descriptions;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ClassAndTeamDescriptionContainer;                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ItemDescriptionContainer;                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           InventoryPanel;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ResourcesPanel;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ItemRarity;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ItemName;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ItemDescription;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           TeamDescriptionContainer;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorTeamInfoWidget*           TeamInfoWidget_FullView;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorTeamInfoWidget*           TeamInfoWidget_TeamsOnly;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        DisplaySwitcher;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ClassAndTeamSelectionContainer;                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           OnlyTeamSelectionContainer;                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           InvalidDataContainer;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorTeamTiles*                TeamTiles;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCreativeClassSelectorButton> TeamSelectionTabClass;                             // 0x0480(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModalVersion;                                   // 0x0488(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableModalTimeLimit;                             // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48A[0x2];                                      // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModalTimeLimitInSeconds;                           // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x10];                                     // 0x0490(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EClassSelectorDisplayMode                     DisplayMode;                                       // 0x04A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDeferRespawn;                                     // 0x04A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ReturnToClassSelectionInputAction;                 // 0x04A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         LoadoutScrollPadding;                              // 0x04B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4BC[0x1C];                                     // 0x04BC(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreativeClassItemInfo*                 SelectedClassItemInfo;                             // 0x04D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void OnClassSelectionChanged(const class FText& NewClassName, const class FText& NewClassDescription);
	void OnClassSelectorUIPopulated(const bool bHasValidData);
	void OnLoadoutCommitted(const class FText& NewClassName, const class FText& NewTeamName, const bool bNewLoadout);
	void OnTimerCountdown(const int32 RemainingTime);

	class UWidget* GetFirstLoadoutItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassSelector">();
	}
	static class UCreativeClassSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassSelector>();
	}
};
static_assert(alignof(UCreativeClassSelector) == 0x000008, "Wrong alignment on UCreativeClassSelector");
static_assert(sizeof(UCreativeClassSelector) == 0x0004E0, "Wrong size on UCreativeClassSelector");
static_assert(offsetof(UCreativeClassSelector, TabButtons_TeamSelection) == 0x0003B8, "Member 'UCreativeClassSelector::TabButtons_TeamSelection' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ListView_Classes) == 0x0003C0, "Member 'UCreativeClassSelector::ListView_Classes' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ClassItemInfos) == 0x0003C8, "Member 'UCreativeClassSelector::ClassItemInfos' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, LoadoutScrollBox) == 0x0003D8, "Member 'UCreativeClassSelector::LoadoutScrollBox' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, LoadoutContainer_Inventory) == 0x0003E0, "Member 'UCreativeClassSelector::LoadoutContainer_Inventory' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, LoadoutContainer_Resources) == 0x0003E8, "Member 'UCreativeClassSelector::LoadoutContainer_Resources' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, Button_SelectLoadout) == 0x0003F0, "Member 'UCreativeClassSelector::Button_SelectLoadout' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, Button_RandomClass) == 0x0003F8, "Member 'UCreativeClassSelector::Button_RandomClass' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, Switcher_Descriptions) == 0x000400, "Member 'UCreativeClassSelector::Switcher_Descriptions' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ClassAndTeamDescriptionContainer) == 0x000408, "Member 'UCreativeClassSelector::ClassAndTeamDescriptionContainer' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ItemDescriptionContainer) == 0x000410, "Member 'UCreativeClassSelector::ItemDescriptionContainer' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, InventoryPanel) == 0x000418, "Member 'UCreativeClassSelector::InventoryPanel' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ResourcesPanel) == 0x000420, "Member 'UCreativeClassSelector::ResourcesPanel' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ItemRarity) == 0x000428, "Member 'UCreativeClassSelector::ItemRarity' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ItemName) == 0x000430, "Member 'UCreativeClassSelector::ItemName' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ItemDescription) == 0x000438, "Member 'UCreativeClassSelector::ItemDescription' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, TeamDescriptionContainer) == 0x000440, "Member 'UCreativeClassSelector::TeamDescriptionContainer' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, TeamInfoWidget_FullView) == 0x000448, "Member 'UCreativeClassSelector::TeamInfoWidget_FullView' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, TeamInfoWidget_TeamsOnly) == 0x000450, "Member 'UCreativeClassSelector::TeamInfoWidget_TeamsOnly' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, DisplaySwitcher) == 0x000458, "Member 'UCreativeClassSelector::DisplaySwitcher' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ClassAndTeamSelectionContainer) == 0x000460, "Member 'UCreativeClassSelector::ClassAndTeamSelectionContainer' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, OnlyTeamSelectionContainer) == 0x000468, "Member 'UCreativeClassSelector::OnlyTeamSelectionContainer' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, InvalidDataContainer) == 0x000470, "Member 'UCreativeClassSelector::InvalidDataContainer' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, TeamTiles) == 0x000478, "Member 'UCreativeClassSelector::TeamTiles' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, TeamSelectionTabClass) == 0x000480, "Member 'UCreativeClassSelector::TeamSelectionTabClass' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, bIsModalVersion) == 0x000488, "Member 'UCreativeClassSelector::bIsModalVersion' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, bEnableModalTimeLimit) == 0x000489, "Member 'UCreativeClassSelector::bEnableModalTimeLimit' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ModalTimeLimitInSeconds) == 0x00048C, "Member 'UCreativeClassSelector::ModalTimeLimitInSeconds' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, DisplayMode) == 0x0004A0, "Member 'UCreativeClassSelector::DisplayMode' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, bDeferRespawn) == 0x0004A1, "Member 'UCreativeClassSelector::bDeferRespawn' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, ReturnToClassSelectionInputAction) == 0x0004A8, "Member 'UCreativeClassSelector::ReturnToClassSelectionInputAction' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, LoadoutScrollPadding) == 0x0004B8, "Member 'UCreativeClassSelector::LoadoutScrollPadding' has a wrong offset!");
static_assert(offsetof(UCreativeClassSelector, SelectedClassItemInfo) == 0x0004D8, "Member 'UCreativeClassSelector::SelectedClassItemInfo' has a wrong offset!");

// Class CRD_ClassSelectorUI.CreativeClassSelectorMapTab
// 0x0068 (0x0410 - 0x03A8)
class UCreativeClassSelectorMapTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaMapScreenContainerTabInfo       MapTabInfo;                                        // 0x03B8(0x0050)(Edit, NativeAccessSpecifierPublic)
	class UCreativeClassSelector*                 CreativeClassSelector;                             // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnTabAdded();
	void SetTabName(const class FText& TabName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassSelectorMapTab">();
	}
	static class UCreativeClassSelectorMapTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassSelectorMapTab>();
	}
};
static_assert(alignof(UCreativeClassSelectorMapTab) == 0x000008, "Wrong alignment on UCreativeClassSelectorMapTab");
static_assert(sizeof(UCreativeClassSelectorMapTab) == 0x000410, "Wrong size on UCreativeClassSelectorMapTab");
static_assert(offsetof(UCreativeClassSelectorMapTab, MapTabInfo) == 0x0003B8, "Member 'UCreativeClassSelectorMapTab::MapTabInfo' has a wrong offset!");
