#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeVideoPlayerUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class CreativeVideoPlayerUI.CreativeVideoPlayerFullScreenWidget
// 0x0068 (0x0410 - 0x03A8)
class UCreativeVideoPlayerFullScreenWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSourceBus*                        SourceBus;                                         // 0x03C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundClass*                            SoundClass;                                        // 0x03C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    HoldToSkipAction;                                  // 0x03D0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Skip;                                       // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SkipButtonTimeout;                                 // 0x03E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3EC[0x14];                                     // 0x03EC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SoundComponent;                                    // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSkipButtonActionComplete();
	void OnSkipButtonActionProgress(float HeldPercent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeVideoPlayerFullScreenWidget">();
	}
	static class UCreativeVideoPlayerFullScreenWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeVideoPlayerFullScreenWidget>();
	}
};
static_assert(alignof(UCreativeVideoPlayerFullScreenWidget) == 0x000008, "Wrong alignment on UCreativeVideoPlayerFullScreenWidget");
static_assert(sizeof(UCreativeVideoPlayerFullScreenWidget) == 0x000410, "Wrong size on UCreativeVideoPlayerFullScreenWidget");
static_assert(offsetof(UCreativeVideoPlayerFullScreenWidget, SourceBus) == 0x0003C0, "Member 'UCreativeVideoPlayerFullScreenWidget::SourceBus' has a wrong offset!");
static_assert(offsetof(UCreativeVideoPlayerFullScreenWidget, SoundClass) == 0x0003C8, "Member 'UCreativeVideoPlayerFullScreenWidget::SoundClass' has a wrong offset!");
static_assert(offsetof(UCreativeVideoPlayerFullScreenWidget, HoldToSkipAction) == 0x0003D0, "Member 'UCreativeVideoPlayerFullScreenWidget::HoldToSkipAction' has a wrong offset!");
static_assert(offsetof(UCreativeVideoPlayerFullScreenWidget, Button_Skip) == 0x0003E0, "Member 'UCreativeVideoPlayerFullScreenWidget::Button_Skip' has a wrong offset!");
static_assert(offsetof(UCreativeVideoPlayerFullScreenWidget, SkipButtonTimeout) == 0x0003E8, "Member 'UCreativeVideoPlayerFullScreenWidget::SkipButtonTimeout' has a wrong offset!");
static_assert(offsetof(UCreativeVideoPlayerFullScreenWidget, SoundComponent) == 0x000400, "Member 'UCreativeVideoPlayerFullScreenWidget::SoundComponent' has a wrong offset!");

}

