#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreatureBaseRidableComponent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.ApplyCollisionResponse
// 0x0048 (0x0048 - 0x0000)
struct CreatureBaseRidableComponent_C_ApplyCollisionResponse final
{
public:
	TArray<ECollisionChannel>                     Channels;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ECollisionResponse                            Response;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_ApplyCollisionResponse) == 0x000008, "Wrong alignment on CreatureBaseRidableComponent_C_ApplyCollisionResponse");
static_assert(sizeof(CreatureBaseRidableComponent_C_ApplyCollisionResponse) == 0x000048, "Wrong size on CreatureBaseRidableComponent_C_ApplyCollisionResponse");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, Channels) == 0x000000, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::Channels' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, Response) == 0x000010, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::Response' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, Temp_int_Array_Index_Variable) == 0x000014, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_Array_Get_Item) == 0x00001C, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyCollisionResponse, CallFunc_GetCollisionResponseToChannel_ReturnValue) == 0x000041, "Member 'CreatureBaseRidableComponent_C_ApplyCollisionResponse::CallFunc_GetCollisionResponseToChannel_ReturnValue' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.ApplyGEToSelf
// 0x0030 (0x0030 - 0x0000)
struct CreatureBaseRidableComponent_C_ApplyGEToSelf final
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsValidClass;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_ApplyGEToSelf) == 0x000008, "Wrong alignment on CreatureBaseRidableComponent_C_ApplyGEToSelf");
static_assert(sizeof(CreatureBaseRidableComponent_C_ApplyGEToSelf) == 0x000030, "Wrong size on CreatureBaseRidableComponent_C_ApplyGEToSelf");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyGEToSelf, GameplayEffectClass) == 0x000000, "Member 'CreatureBaseRidableComponent_C_ApplyGEToSelf::GameplayEffectClass' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyGEToSelf, IsValidClass) == 0x000008, "Member 'CreatureBaseRidableComponent_C_ApplyGEToSelf::IsValidClass' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyGEToSelf, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'CreatureBaseRidableComponent_C_ApplyGEToSelf::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyGEToSelf, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'CreatureBaseRidableComponent_C_ApplyGEToSelf::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyGEToSelf, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'CreatureBaseRidableComponent_C_ApplyGEToSelf::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ApplyGEToSelf, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue) == 0x000028, "Member 'CreatureBaseRidableComponent_C_ApplyGEToSelf::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.CanJumpExit
// 0x0080 (0x0080 - 0x0000)
struct CreatureBaseRidableComponent_C_CanJumpExit final
{
public:
	bool                                          CanJumpExit_0;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         JumpExitDurationThreshold;                         // 0x0008(0x0028)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_CanJumpExit) == 0x000008, "Wrong alignment on CreatureBaseRidableComponent_C_CanJumpExit");
static_assert(sizeof(CreatureBaseRidableComponent_C_CanJumpExit) == 0x000080, "Wrong size on CreatureBaseRidableComponent_C_CanJumpExit");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CanJumpExit_0) == 0x000000, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CanJumpExit_0' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, JumpExitDurationThreshold) == 0x000008, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::JumpExitDurationThreshold' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_GetValueAtLevel_ReturnValue) == 0x000034, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_IsFalling_ReturnValue) == 0x000039, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_GetTimeSeconds_ReturnValue) == 0x000040, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_K2_SetTimer_ReturnValue) == 0x000060, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000068, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CanJumpExit, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000078, "Member 'CreatureBaseRidableComponent_C_CanJumpExit::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.CheatSetStaminaPercent
// 0x0004 (0x0004 - 0x0000)
struct CreatureBaseRidableComponent_C_CheatSetStaminaPercent final
{
public:
	float                                         StaminaPercent;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_CheatSetStaminaPercent) == 0x000004, "Wrong alignment on CreatureBaseRidableComponent_C_CheatSetStaminaPercent");
static_assert(sizeof(CreatureBaseRidableComponent_C_CheatSetStaminaPercent) == 0x000004, "Wrong size on CreatureBaseRidableComponent_C_CheatSetStaminaPercent");
static_assert(offsetof(CreatureBaseRidableComponent_C_CheatSetStaminaPercent, StaminaPercent) == 0x000000, "Member 'CreatureBaseRidableComponent_C_CheatSetStaminaPercent::StaminaPercent' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.CommitEnergyCosts
// 0x0018 (0x0018 - 0x0000)
struct CreatureBaseRidableComponent_C_CommitEnergyCosts final
{
public:
	bool                                          RequireAllEnergy;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EnergyCost;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_CommitEnergyCosts) == 0x000008, "Wrong alignment on CreatureBaseRidableComponent_C_CommitEnergyCosts");
static_assert(sizeof(CreatureBaseRidableComponent_C_CommitEnergyCosts) == 0x000018, "Wrong size on CreatureBaseRidableComponent_C_CommitEnergyCosts");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, RequireAllEnergy) == 0x000000, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::RequireAllEnergy' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, EnergyCost) == 0x000008, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::EnergyCost' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, Success) == 0x000010, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::Success' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000012, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000013, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_CommitEnergyCosts, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'CreatureBaseRidableComponent_C_CommitEnergyCosts::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.ConvertedDispatcher_Event_0
// 0x0010 (0x0010 - 0x0000)
struct CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0 final
{
public:
	bool                                          Converted;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              InstigatorPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0) == 0x000008, "Wrong alignment on CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0");
static_assert(sizeof(CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0) == 0x000010, "Wrong size on CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0");
static_assert(offsetof(CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0, Converted) == 0x000000, "Member 'CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0::Converted' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0, InstigatorPawn) == 0x000008, "Member 'CreatureBaseRidableComponent_C_ConvertedDispatcher_Event_0::InstigatorPawn' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.DetermineRateOfChange
// 0x0058 (0x0058 - 0x0000)
struct CreatureBaseRidableComponent_C_DetermineRateOfChange final
{
public:
	double                                        rateOfChange;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprinting_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue_1;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastUpdateVelocity_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_RateOfChange_ImplicitCast;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_RateOfChange_ImplicitCast_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreatureBaseRidableComponent_C_DetermineRateOfChange) == 0x000008, "Wrong alignment on CreatureBaseRidableComponent_C_DetermineRateOfChange");
static_assert(sizeof(CreatureBaseRidableComponent_C_DetermineRateOfChange) == 0x000058, "Wrong size on CreatureBaseRidableComponent_C_DetermineRateOfChange");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, rateOfChange) == 0x000000, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::rateOfChange' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_IsSprinting_ReturnValue) == 0x000008, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_IsSprinting_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00000C, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000010, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000014, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_EvaluateCurveTableRow_ReturnValue_1) == 0x000018, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_EvaluateCurveTableRow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_IsBeingRidden_ReturnValue) == 0x000019, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_IsBeingRidden_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_GetLastUpdateVelocity_ReturnValue) == 0x000020, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_GetLastUpdateVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_VSize_ReturnValue) == 0x000038, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, K2Node_FunctionResult_RateOfChange_ImplicitCast) == 0x000048, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::K2Node_FunctionResult_RateOfChange_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CreatureBaseRidableComponent_C_DetermineRateOfChange, K2Node_FunctionResult_RateOfChange_ImplicitCast_1) == 0x000050, "Member 'CreatureBaseRidableComponent_C_DetermineRateOfChange::K2Node_FunctionResult_RateOfChange_ImplicitCast_1' has a wrong offset!");

// Function CreatureBaseRidableComponent.CreatureBaseRidableComponent_C.ExecuteUbergraph_CreatureBaseRidableComponent
// 0x0480 (0x0480 - 0x0000)
struct CreatureBaseRidableComponent_C_ExecuteUbergraph_CreatureBaseRidableComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRiderLocation_Location;                // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn_1;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECollisionChannel>                     K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_JumpPitchInterpSpeed;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn_2;                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_8;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn_3;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_AIPawn;                         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_InteractingPlayerPawn;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_9;                   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleRiding_bChangedRiding;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Wildlife_Parent_C*            K2Node_DynamicCast_AsNPC_Pawn_Wildlife_Parent;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn_4;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Converted;                      // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InstigatorPawn;                 // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Converted, class AFortPawn* InstigatorPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0178(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_10;                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue_1;              // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestThreshold_crossedThreshold;           // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue_2;              // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue_3;              // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestThreshold_crossedThreshold_1;         // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue_4;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_EnergyCost_1;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URiderComponent*                        K2Node_Event_Rider;                                // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_DetermineRateOfChange_RateOfChange;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URiderComponent*                        K2Node_Event_Rider_1;                              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateValue_updatedValue;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateValue_energyDepleted;               // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_11;                  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPC_Pawn_Parent_C*                     K2Node_DynamicCast_AsNPC_Pawn_Parent;              // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_CanBeInteractedWith_CanInteract;      // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_Pawn_Parent_C*                     K2Node_DynamicCast_AsNPC_Pawn_Parent_1;            // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_UpdateInteract_EnabledInteract;       // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NPC_UpdateInteract_EnabledInteract_1;     // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue; // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGEToSelf_isValidClass;               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGEToSelf_isValidClass_1;             // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGEToSelf_isValidClass_2;             // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25F[0x1];                                      // 0x025F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_12;                  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_13;                  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAbilityInputHeld;                    // 0x0289(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bForceCancel;                         // 0x028A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwimming_IsSwimming;                    // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28F[0x1];                                      // 0x028F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0290(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingRidden_ReturnValue_5;              // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7[0x1];                                      // 0x02A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerRiderComponent_C*                K2Node_DynamicCast_AsPlayer_Rider_Component;       // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_14;                  // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprintToggleable_ReturnValue;           // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprintToggleable_ReturnValue_1;         // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprintToggleable_ReturnValue_2;         // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
