#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeVideoPlayerRuntime

#include "Basic.hpp"

#include "CreativeVideoPlayerRuntime_structs.hpp"


namespace SDK::Params
{

// Function CreativeVideoPlayerRuntime.CreativeVideoPlayerFullscreenGameplayAbility.EnterFullscreenStateWithOptions
// 0x0002 (0x0002 - 0x0000)
struct CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions final
{
public:
	struct FCreativeVideoPlayerFullscreenOptions  Options;                                           // 0x0000(0x0002)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions) == 0x000001, "Wrong alignment on CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions");
static_assert(sizeof(CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions) == 0x000002, "Wrong size on CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions");
static_assert(offsetof(CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions, Options) == 0x000000, "Member 'CreativeVideoPlayerFullscreenGameplayAbility_EnterFullscreenStateWithOptions::Options' has a wrong offset!");

// Function CreativeVideoPlayerRuntime.CreativeVideoPlayerFunctionLibrary.ShutdownFullscreenVideoMode
// 0x0008 (0x0008 - 0x0000)
struct CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode) == 0x000008, "Wrong alignment on CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode");
static_assert(sizeof(CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode) == 0x000008, "Wrong size on CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode");
static_assert(offsetof(CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode, Controller) == 0x000000, "Member 'CreativeVideoPlayerFunctionLibrary_ShutdownFullscreenVideoMode::Controller' has a wrong offset!");

}

