#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeRoyaleRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "Engine_classes.hpp"
#include "CreativeRoyaleRuntime_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class CreativeRoyaleRuntime.CreativeRoyaleIslandPlayspace
// 0x0050 (0x06C0 - 0x0670)
class ACreativeRoyaleIslandPlayspace final : public AFortPlayspace
{
public:
	class UFortProjectEditComponent_CreativeRoyale* ProjectEditComponent;                              // 0x0670(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayspaceComponent_PlayStopPauseManager* PlayStopPauseManager;                              // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayspaceComponent_CreativeLoadingStateProxy* CreativeLoadingStateProxy;                         // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayspaceComponent_SpatialGameplay*    SpatialGameplayComponent;                          // 0x0688(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVolumeObjectTrackingComponent*     ObjectTrackingComponent;                           // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayspaceComponent_DeviceTracking*     DeviceTrackerComponent;                            // 0x0698(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayspaceComponent_CreativeModifyEmotes* CreativeModifyEmotesComponent;                     // 0x06A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPlayspaceComponent_WorldTimeOfDayOverride* WorldTimeOfDayOverrideComponent;                   // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCreativeRoyalePlayspaceComponent_LoadingScreen* LoadingScreenComponent;                            // 0x06B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPoiSwapManager*                    FortPoiSwapManager;                                // 0x06B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeRoyaleIslandPlayspace">();
	}
	static class ACreativeRoyaleIslandPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeRoyaleIslandPlayspace>();
	}
};
static_assert(alignof(ACreativeRoyaleIslandPlayspace) == 0x000008, "Wrong alignment on ACreativeRoyaleIslandPlayspace");
static_assert(sizeof(ACreativeRoyaleIslandPlayspace) == 0x0006C0, "Wrong size on ACreativeRoyaleIslandPlayspace");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, ProjectEditComponent) == 0x000670, "Member 'ACreativeRoyaleIslandPlayspace::ProjectEditComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, PlayStopPauseManager) == 0x000678, "Member 'ACreativeRoyaleIslandPlayspace::PlayStopPauseManager' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, CreativeLoadingStateProxy) == 0x000680, "Member 'ACreativeRoyaleIslandPlayspace::CreativeLoadingStateProxy' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, SpatialGameplayComponent) == 0x000688, "Member 'ACreativeRoyaleIslandPlayspace::SpatialGameplayComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, ObjectTrackingComponent) == 0x000690, "Member 'ACreativeRoyaleIslandPlayspace::ObjectTrackingComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, DeviceTrackerComponent) == 0x000698, "Member 'ACreativeRoyaleIslandPlayspace::DeviceTrackerComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, CreativeModifyEmotesComponent) == 0x0006A0, "Member 'ACreativeRoyaleIslandPlayspace::CreativeModifyEmotesComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, WorldTimeOfDayOverrideComponent) == 0x0006A8, "Member 'ACreativeRoyaleIslandPlayspace::WorldTimeOfDayOverrideComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, LoadingScreenComponent) == 0x0006B0, "Member 'ACreativeRoyaleIslandPlayspace::LoadingScreenComponent' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleIslandPlayspace, FortPoiSwapManager) == 0x0006B8, "Member 'ACreativeRoyaleIslandPlayspace::FortPoiSwapManager' has a wrong offset!");

// Class CreativeRoyaleRuntime.FortPoiSwapManager
// 0x0070 (0x0110 - 0x00A0)
class UFortPoiSwapManager final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeRealEstatePlotItemDefinition* PoiPlotDefinition;                                 // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PoiPlotLocationOffset;                             // 0x00F8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SwapPoi(const class AFortPoiVolume* PoiToSwap);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPoiSwapManager">();
	}
	static class UFortPoiSwapManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPoiSwapManager>();
	}
};
static_assert(alignof(UFortPoiSwapManager) == 0x000008, "Wrong alignment on UFortPoiSwapManager");
static_assert(sizeof(UFortPoiSwapManager) == 0x000110, "Wrong size on UFortPoiSwapManager");
static_assert(offsetof(UFortPoiSwapManager, PoiPlotDefinition) == 0x0000F0, "Member 'UFortPoiSwapManager::PoiPlotDefinition' has a wrong offset!");
static_assert(offsetof(UFortPoiSwapManager, PoiPlotLocationOffset) == 0x0000F8, "Member 'UFortPoiSwapManager::PoiPlotLocationOffset' has a wrong offset!");

// Class CreativeRoyaleRuntime.FortPoiSwapPlayspace
// 0x0018 (0x0688 - 0x0670)
class AFortPoiSwapPlayspace final : public AFortPlayspace
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLevelSaveComponent*                LevelSaveComponent;                                // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlaysetLevelStreamComponent*           PlaysetLevelStreamComponent;                       // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPoiSwapPlayspace">();
	}
	static class AFortPoiSwapPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortPoiSwapPlayspace>();
	}
};
static_assert(alignof(AFortPoiSwapPlayspace) == 0x000008, "Wrong alignment on AFortPoiSwapPlayspace");
static_assert(sizeof(AFortPoiSwapPlayspace) == 0x000688, "Wrong size on AFortPoiSwapPlayspace");
static_assert(offsetof(AFortPoiSwapPlayspace, SceneComponent) == 0x000670, "Member 'AFortPoiSwapPlayspace::SceneComponent' has a wrong offset!");
static_assert(offsetof(AFortPoiSwapPlayspace, LevelSaveComponent) == 0x000678, "Member 'AFortPoiSwapPlayspace::LevelSaveComponent' has a wrong offset!");
static_assert(offsetof(AFortPoiSwapPlayspace, PlaysetLevelStreamComponent) == 0x000680, "Member 'AFortPoiSwapPlayspace::PlaysetLevelStreamComponent' has a wrong offset!");

// Class CreativeRoyaleRuntime.AthenaAIServicePlayerBots_CreativeRoyale
// 0x0020 (0x12E0 - 0x12C0)
class UAthenaAIServicePlayerBots_CreativeRoyale final : public UAthenaAIServiceCreativePlayerBots
{
public:
	struct FScalableFloat                         PlayerBotsEnabled;                                 // 0x12B8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnPlayerJoiningInProgress(const class AFortPlayerState* FortPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIServicePlayerBots_CreativeRoyale">();
	}
	static class UAthenaAIServicePlayerBots_CreativeRoyale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIServicePlayerBots_CreativeRoyale>();
	}
};
static_assert(alignof(UAthenaAIServicePlayerBots_CreativeRoyale) == 0x000010, "Wrong alignment on UAthenaAIServicePlayerBots_CreativeRoyale");
static_assert(sizeof(UAthenaAIServicePlayerBots_CreativeRoyale) == 0x0012E0, "Wrong size on UAthenaAIServicePlayerBots_CreativeRoyale");
static_assert(offsetof(UAthenaAIServicePlayerBots_CreativeRoyale, PlayerBotsEnabled) == 0x0012B8, "Member 'UAthenaAIServicePlayerBots_CreativeRoyale::PlayerBotsEnabled' has a wrong offset!");

// Class CreativeRoyaleRuntime.CreativeRoyalePlayspaceComponent_LevelReset
// 0x00D8 (0x0178 - 0x00A0)
class UCreativeRoyalePlayspaceComponent_LevelReset final : public UPlayspaceComponent
{
public:
	TWeakObjectPtr<class ULevelSaveRecord>        CachedLevelSaveRecord;                             // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSpawnFromGameplay;                                // 0x00A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          SavedFoundActors;                                  // 0x00B0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TWeakObjectPtr<class AActor>, struct FSpawnBuildingActorParameters> SavedDeadActors;                                   // 0x00C0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AActor>>          SavedDamagedActors;                                // 0x0110(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AActor>>          FoundActorsDied;                                   // 0x0120(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          FoundActorsDiedGuid;                               // 0x0130(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AActor>>          FoundActorsDamaged;                                // 0x0140(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          FoundActorsDamagedGuid;                            // 0x0150(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x18];                                     // 0x0160(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddFoundActors();
	void BindActorToCallbacks(class AActor* Actor);
	void ClearFoundActors();
	void DestroyDamagedActors();
	void HandleBuildingDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void HandleBuildingDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void HandleMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState NewMinigameState);
	void OnPlotLoadComplete();
	void OnSpawningFromSaveFinish();
	void RespawnDeadActors();
	void SaveActorToBeRespawned(class AActor* ActorToBeRespawned, const bool bRemoveDamagedActor);
	void SaveDamagedActor(class AActor* DamagedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeRoyalePlayspaceComponent_LevelReset">();
	}
	static class UCreativeRoyalePlayspaceComponent_LevelReset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeRoyalePlayspaceComponent_LevelReset>();
	}
};
static_assert(alignof(UCreativeRoyalePlayspaceComponent_LevelReset) == 0x000008, "Wrong alignment on UCreativeRoyalePlayspaceComponent_LevelReset");
static_assert(sizeof(UCreativeRoyalePlayspaceComponent_LevelReset) == 0x000178, "Wrong size on UCreativeRoyalePlayspaceComponent_LevelReset");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, CachedLevelSaveRecord) == 0x0000A0, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::CachedLevelSaveRecord' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, bSpawnFromGameplay) == 0x0000A8, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::bSpawnFromGameplay' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, SavedFoundActors) == 0x0000B0, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::SavedFoundActors' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, SavedDeadActors) == 0x0000C0, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::SavedDeadActors' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, SavedDamagedActors) == 0x000110, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::SavedDamagedActors' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, FoundActorsDied) == 0x000120, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::FoundActorsDied' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, FoundActorsDiedGuid) == 0x000130, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::FoundActorsDiedGuid' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, FoundActorsDamaged) == 0x000140, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::FoundActorsDamaged' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LevelReset, FoundActorsDamagedGuid) == 0x000150, "Member 'UCreativeRoyalePlayspaceComponent_LevelReset::FoundActorsDamagedGuid' has a wrong offset!");

// Class CreativeRoyaleRuntime.CreativeRoyalePlayspaceComponent_LoadingScreen
// 0x0088 (0x0128 - 0x00A0)
class UCreativeRoyalePlayspaceComponent_LoadingScreen final : public UPlayspaceComponent_LoadingScreen
{
public:
	bool                                          bShouldDisplayLoadingScreenDuringPostGame;         // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlotNotFinishedLoadingContext;                     // 0x00A8(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   MinigameResetContext;                              // 0x00C0(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FailsafeTimeoutLength;                             // 0x00F0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void OnPlayspaceUserAdded(struct FPlayspaceUser* AddedUser);
	void OnPlotLoadComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeRoyalePlayspaceComponent_LoadingScreen">();
	}
	static class UCreativeRoyalePlayspaceComponent_LoadingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeRoyalePlayspaceComponent_LoadingScreen>();
	}
};
static_assert(alignof(UCreativeRoyalePlayspaceComponent_LoadingScreen) == 0x000008, "Wrong alignment on UCreativeRoyalePlayspaceComponent_LoadingScreen");
static_assert(sizeof(UCreativeRoyalePlayspaceComponent_LoadingScreen) == 0x000128, "Wrong size on UCreativeRoyalePlayspaceComponent_LoadingScreen");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LoadingScreen, bShouldDisplayLoadingScreenDuringPostGame) == 0x0000A0, "Member 'UCreativeRoyalePlayspaceComponent_LoadingScreen::bShouldDisplayLoadingScreenDuringPostGame' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LoadingScreen, PlotNotFinishedLoadingContext) == 0x0000A8, "Member 'UCreativeRoyalePlayspaceComponent_LoadingScreen::PlotNotFinishedLoadingContext' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LoadingScreen, MinigameResetContext) == 0x0000C0, "Member 'UCreativeRoyalePlayspaceComponent_LoadingScreen::MinigameResetContext' has a wrong offset!");
static_assert(offsetof(UCreativeRoyalePlayspaceComponent_LoadingScreen, FailsafeTimeoutLength) == 0x0000F0, "Member 'UCreativeRoyalePlayspaceComponent_LoadingScreen::FailsafeTimeoutLength' has a wrong offset!");

// Class CreativeRoyaleRuntime.CreativeRoyalePlayspaceComponent_PlayerSpawning
// 0x0000 (0x00B0 - 0x00B0)
class UCreativeRoyalePlayspaceComponent_PlayerSpawning final : public UFortPlayspaceComponent_PlayerSpawning
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeRoyalePlayspaceComponent_PlayerSpawning">();
	}
	static class UCreativeRoyalePlayspaceComponent_PlayerSpawning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeRoyalePlayspaceComponent_PlayerSpawning>();
	}
};
static_assert(alignof(UCreativeRoyalePlayspaceComponent_PlayerSpawning) == 0x000008, "Wrong alignment on UCreativeRoyalePlayspaceComponent_PlayerSpawning");
static_assert(sizeof(UCreativeRoyalePlayspaceComponent_PlayerSpawning) == 0x0000B0, "Wrong size on UCreativeRoyalePlayspaceComponent_PlayerSpawning");

// Class CreativeRoyaleRuntime.CreativeRoyaleRootPlayspace
// 0x0038 (0x06A8 - 0x0670)
class ACreativeRoyaleRootPlayspace final : public AFortPlayspace
{
public:
	uint8                                         Pad_670[0x18];                                     // 0x0670(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            EditorIslandOwnerPlayerController;                 // 0x0688(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_690[0x8];                                      // 0x0690(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasPlotLoaded;                                    // 0x0698(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_699[0xF];                                      // 0x0699(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cheat_LoadEditorIsland();
	void OnPlotLoadComplete();
	void OnRep_bHasPlotLoaded();
	void TeleportPlayersToPlayerStarts();

	bool BuildDataRegistryResolverScope_Implementation(TArray<class FName>* InOutResolverScopes, int32* InOutPriority) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeRoyaleRootPlayspace">();
	}
	static class ACreativeRoyaleRootPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeRoyaleRootPlayspace>();
	}
};
static_assert(alignof(ACreativeRoyaleRootPlayspace) == 0x000008, "Wrong alignment on ACreativeRoyaleRootPlayspace");
static_assert(sizeof(ACreativeRoyaleRootPlayspace) == 0x0006A8, "Wrong size on ACreativeRoyaleRootPlayspace");
static_assert(offsetof(ACreativeRoyaleRootPlayspace, EditorIslandOwnerPlayerController) == 0x000688, "Member 'ACreativeRoyaleRootPlayspace::EditorIslandOwnerPlayerController' has a wrong offset!");
static_assert(offsetof(ACreativeRoyaleRootPlayspace, bHasPlotLoaded) == 0x000698, "Member 'ACreativeRoyaleRootPlayspace::bHasPlotLoaded' has a wrong offset!");

// Class CreativeRoyaleRuntime.FortAthenaMutator_CreativeRoyaleSafeZoneOverride
// 0x0000 (0x0330 - 0x0330)
class AFortAthenaMutator_CreativeRoyaleSafeZoneOverride final : public AFortAthenaMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_CreativeRoyaleSafeZoneOverride">();
	}
	static class AFortAthenaMutator_CreativeRoyaleSafeZoneOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_CreativeRoyaleSafeZoneOverride>();
	}
};
static_assert(alignof(AFortAthenaMutator_CreativeRoyaleSafeZoneOverride) == 0x000008, "Wrong alignment on AFortAthenaMutator_CreativeRoyaleSafeZoneOverride");
static_assert(sizeof(AFortAthenaMutator_CreativeRoyaleSafeZoneOverride) == 0x000330, "Wrong size on AFortAthenaMutator_CreativeRoyaleSafeZoneOverride");

// Class CreativeRoyaleRuntime.FortCheatManager_CreativeRoyale
// 0x0010 (0x0048 - 0x0038)
class UFortCheatManager_CreativeRoyale final : public UFortCheatManager_Coupled
{
public:
	class UFortCreativeRealEstatePlotItemDefinition* CreativeRoyaleEditPlotDefinition;                  // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CreativeRoyaleVolumeTag;                           // 0x0040(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreativeRoyaleLoadEditPlot() const;
	void CreativeRoyaleResetIslandFile() const;
	void CreativeRoyaleTeleportToEditZone() const;
	void TeleportToPlotAferLoad() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_CreativeRoyale">();
	}
	static class UFortCheatManager_CreativeRoyale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_CreativeRoyale>();
	}
};
static_assert(alignof(UFortCheatManager_CreativeRoyale) == 0x000008, "Wrong alignment on UFortCheatManager_CreativeRoyale");
static_assert(sizeof(UFortCheatManager_CreativeRoyale) == 0x000048, "Wrong size on UFortCheatManager_CreativeRoyale");
static_assert(offsetof(UFortCheatManager_CreativeRoyale, CreativeRoyaleEditPlotDefinition) == 0x000038, "Member 'UFortCheatManager_CreativeRoyale::CreativeRoyaleEditPlotDefinition' has a wrong offset!");
static_assert(offsetof(UFortCheatManager_CreativeRoyale, CreativeRoyaleVolumeTag) == 0x000040, "Member 'UFortCheatManager_CreativeRoyale::CreativeRoyaleVolumeTag' has a wrong offset!");

// Class CreativeRoyaleRuntime.FortProjectEditComponent_CreativeRoyale
// 0x0010 (0x0510 - 0x0500)
class UFortProjectEditComponent_CreativeRoyale final : public UFortProjectEditComponent
{
public:
	uint8                                         Pad_500[0x8];                                      // 0x0500(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeRealEstatePlotItemDefinition* CreativeRoyaleEditPlotDefinition;                  // 0x0508(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void LoadPlotFromProject();
	void OnPlayerLoggedIn(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProjectEditComponent_CreativeRoyale">();
	}
	static class UFortProjectEditComponent_CreativeRoyale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortProjectEditComponent_CreativeRoyale>();
	}
};
static_assert(alignof(UFortProjectEditComponent_CreativeRoyale) == 0x000010, "Wrong alignment on UFortProjectEditComponent_CreativeRoyale");
static_assert(sizeof(UFortProjectEditComponent_CreativeRoyale) == 0x000510, "Wrong size on UFortProjectEditComponent_CreativeRoyale");
static_assert(offsetof(UFortProjectEditComponent_CreativeRoyale, CreativeRoyaleEditPlotDefinition) == 0x000508, "Member 'UFortProjectEditComponent_CreativeRoyale::CreativeRoyaleEditPlotDefinition' has a wrong offset!");

}

