#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewPurchase_TileDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewPurchase_TileDetails.CrewPurchase_TileDetails_C
// 0x0020 (0x02F8 - 0x02D8)
class UCrewPurchase_TileDetails_C final : public UCrewTileDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                Spacer_LocShim;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DevTestLoc;                                        // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void EventIntro();
	void ExecuteUbergraph_CrewPurchase_TileDetails(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewPurchase_TileDetails_C">();
	}
	static class UCrewPurchase_TileDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPurchase_TileDetails_C>();
	}
};
static_assert(alignof(UCrewPurchase_TileDetails_C) == 0x000008, "Wrong alignment on UCrewPurchase_TileDetails_C");
static_assert(sizeof(UCrewPurchase_TileDetails_C) == 0x0002F8, "Wrong size on UCrewPurchase_TileDetails_C");
static_assert(offsetof(UCrewPurchase_TileDetails_C, UberGraphFrame) == 0x0002D8, "Member 'UCrewPurchase_TileDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_TileDetails_C, Intro) == 0x0002E0, "Member 'UCrewPurchase_TileDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_TileDetails_C, Spacer_LocShim) == 0x0002E8, "Member 'UCrewPurchase_TileDetails_C::Spacer_LocShim' has a wrong offset!");
static_assert(offsetof(UCrewPurchase_TileDetails_C, DevTestLoc) == 0x0002F0, "Member 'UCrewPurchase_TileDetails_C::DevTestLoc' has a wrong offset!");

}

