#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewSubscriptionErrorModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CrewSubscriptionErrorModal.CrewSubscriptionErrorModal_C
// 0x0060 (0x0418 - 0x03B8)
class UCrewSubscriptionErrorModal_C final : public UCrewSubscriptionErrorModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowUp;                                            // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Badge;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Containment;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ContentSZ;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundBottomBar;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lightbox_HitTestBlocker;                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MobileClose;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PrimaryScrollBox;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_PlatformSpecific;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Wordmark;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_CrewSubscriptionErrorModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CrewSubscriptionErrorModal_C">();
	}
	static class UCrewSubscriptionErrorModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewSubscriptionErrorModal_C>();
	}
};
static_assert(alignof(UCrewSubscriptionErrorModal_C) == 0x000008, "Wrong alignment on UCrewSubscriptionErrorModal_C");
static_assert(sizeof(UCrewSubscriptionErrorModal_C) == 0x000418, "Wrong size on UCrewSubscriptionErrorModal_C");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, UberGraphFrame) == 0x0003B8, "Member 'UCrewSubscriptionErrorModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, ShowUp) == 0x0003C0, "Member 'UCrewSubscriptionErrorModal_C::ShowUp' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Badge) == 0x0003C8, "Member 'UCrewSubscriptionErrorModal_C::Badge' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Containment) == 0x0003D0, "Member 'UCrewSubscriptionErrorModal_C::Containment' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, ContentSZ) == 0x0003D8, "Member 'UCrewSubscriptionErrorModal_C::ContentSZ' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Glow) == 0x0003E0, "Member 'UCrewSubscriptionErrorModal_C::Glow' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Image_BackgroundBottomBar) == 0x0003E8, "Member 'UCrewSubscriptionErrorModal_C::Image_BackgroundBottomBar' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Lightbox_HitTestBlocker) == 0x0003F0, "Member 'UCrewSubscriptionErrorModal_C::Lightbox_HitTestBlocker' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, MobileClose) == 0x0003F8, "Member 'UCrewSubscriptionErrorModal_C::MobileClose' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, PrimaryScrollBox) == 0x000400, "Member 'UCrewSubscriptionErrorModal_C::PrimaryScrollBox' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, VBox_PlatformSpecific) == 0x000408, "Member 'UCrewSubscriptionErrorModal_C::VBox_PlatformSpecific' has a wrong offset!");
static_assert(offsetof(UCrewSubscriptionErrorModal_C, Wordmark) == 0x000410, "Member 'UCrewSubscriptionErrorModal_C::Wordmark' has a wrong offset!");

}

