#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryLobbyMatchmakingPlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DiscoveryLobbyMatchmakingPlay.DiscoveryLobbyMatchmakingPlay_C
// 0x00D8 (0x05C0 - 0x04E8)
class UDiscoveryLobbyMatchmakingPlay_C final : public UFortAthenaMatchmakingWidgetLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowMatchmakingDetails;                       // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_NewModeViolation;                             // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_DisableFillBP;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DisableLobbyBP;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DisableModeSetBP;                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Box_LimitedMatchmaking;                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Regular_C*            Button_ModeSet;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PopupTooltip_C*                    DiscoveryTooltip_FirstTimeEntryFlow;               // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PopupTooltip_C*                    DiscoveryTooltip_FirstTimeNotifcation;             // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PopupTooltip_C*                    DiscoveryTooltip_SubmodeViolator;                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingInputIndicator_C*           MatchmakingInputIndicator;                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Mobile;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ModeSet;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PlayButton;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SpinnerAndTextContainer;                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x0580(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortPlaylistAthena*                    PlaylistData;                                      // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingMatchmakingDetails;                       // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CreativeMatchmakingSucceededSound;                 // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingSubModeFirstTimeNotification;             // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Hide_ToolTip_Timer;                                // 0x05B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSubModeFirstTimeNotificationHidden;              // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateViolator();
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_MatchmakingMode_K2Node_ComponentBoundEvent_0_OnActivityChanged__DelegateSignature();
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_MatchmakingMode_K2Node_ComponentBoundEvent_3_OnShowChildModeChangedNotification__DelegateSignature(const class FText& DisplayName);
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_MatchmakingMode_K2Node_ComponentBoundEvent_4_OnShowChildModeFirstTimeNotification__DelegateSignature();
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_MatchmakingMode_K2Node_ComponentBoundEvent_5_OnHideChildModeFirstTimeNotification__DelegateSignature();
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_MatchmakingMode_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_ModeSet_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DiscoveryLobbyMatchmakingPlay_Button_Play_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_DiscoveryLobbyMatchmakingPlay(int32 EntryPoint);
	void Hide_Tooltip_After_Delay();
	void OnCrossplayPreferencesChanged(bool IsCrossplayEnabled);
	void OnInitialized();
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnLocalPlayerPromotedToLeader();
	void OnMatchmakingFinishedBlueprint(bool bSuccess, const class UFortPlaylistAthena* Playlist);
	void OnPlayButtonLockStateChanged(const bool bLockState);
	void OnPrivateMatchButtonEnabledStateUpdated(const bool bIsLocalPlayerPartyLeader, const bool bIsMatchmaking);
	void OnSetCancelButtonText(const class FText& CancelButtonText);
	void OnSetPlayButtonSecondaryText(const class FText& PlayButtonSecondaryText);
	void OnSetPlayButtonText(const class FText& PlayButtonText);
	void OnSquadFillButtonEnabledStateUpdated(const bool bIsLocalPlayerPartyLeader, const bool bIsMatchmaking);
	void OnViolatorStyleRefreshed(const EFortMatchmakingViolatorStyle NewViolatorStyle);
	void PickMatchmakingSucceededSound(class USoundBase** SelectedMatchmakingSucceededSound);
	void PlaylistChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void Set_Mobile_Style();
	void SetShowingDiscoveryEntryFlowToolTip(bool bShowTooltip);
	void ShouldShowMatchmakingDetails(bool bShow);
	void UpdateModeSetButtonText();

	class FText GetButtonPrivateMatchText() const;
	class FText GetButtonPublicMatchText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DiscoveryLobbyMatchmakingPlay_C">();
	}
	static class UDiscoveryLobbyMatchmakingPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoveryLobbyMatchmakingPlay_C>();
	}
};
static_assert(alignof(UDiscoveryLobbyMatchmakingPlay_C) == 0x000008, "Wrong alignment on UDiscoveryLobbyMatchmakingPlay_C");
static_assert(sizeof(UDiscoveryLobbyMatchmakingPlay_C) == 0x0005C0, "Wrong size on UDiscoveryLobbyMatchmakingPlay_C");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, UberGraphFrame) == 0x0004E8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Anim_ShowMatchmakingDetails) == 0x0004F0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Anim_ShowMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Anim_NewModeViolation) == 0x0004F8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Anim_NewModeViolation' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Border_DisableFillBP) == 0x000500, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Border_DisableFillBP' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Border_DisableLobbyBP) == 0x000508, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Border_DisableLobbyBP' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Border_DisableModeSetBP) == 0x000510, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Border_DisableModeSetBP' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Box_LimitedMatchmaking) == 0x000518, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Box_LimitedMatchmaking' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Button_ModeSet) == 0x000520, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Button_ModeSet' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, DiscoveryTooltip_FirstTimeEntryFlow) == 0x000528, "Member 'UDiscoveryLobbyMatchmakingPlay_C::DiscoveryTooltip_FirstTimeEntryFlow' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, DiscoveryTooltip_FirstTimeNotifcation) == 0x000530, "Member 'UDiscoveryLobbyMatchmakingPlay_C::DiscoveryTooltip_FirstTimeNotifcation' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, DiscoveryTooltip_SubmodeViolator) == 0x000538, "Member 'UDiscoveryLobbyMatchmakingPlay_C::DiscoveryTooltip_SubmodeViolator' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, MatchmakingInputIndicator) == 0x000540, "Member 'UDiscoveryLobbyMatchmakingPlay_C::MatchmakingInputIndicator' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Overlay_2) == 0x000548, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Overlay_Mobile) == 0x000550, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Overlay_Mobile' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Overlay_ModeSet) == 0x000558, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Overlay_ModeSet' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Overlay_PlayButton) == 0x000560, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Overlay_PlayButton' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, SizeBox_Content) == 0x000568, "Member 'UDiscoveryLobbyMatchmakingPlay_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, SpinnerAndTextContainer) == 0x000570, "Member 'UDiscoveryLobbyMatchmakingPlay_C::SpinnerAndTextContainer' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, ViolatorSwitcher) == 0x000578, "Member 'UDiscoveryLobbyMatchmakingPlay_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, ShowNewPlaylistTimer) == 0x000580, "Member 'UDiscoveryLobbyMatchmakingPlay_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, MatchmakingSucceededSound) == 0x000588, "Member 'UDiscoveryLobbyMatchmakingPlay_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, PlaylistData) == 0x000590, "Member 'UDiscoveryLobbyMatchmakingPlay_C::PlaylistData' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, IsShowingMatchmakingDetails) == 0x000598, "Member 'UDiscoveryLobbyMatchmakingPlay_C::IsShowingMatchmakingDetails' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, CreativeMatchmakingSucceededSound) == 0x0005A0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::CreativeMatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, IsShowingSubModeFirstTimeNotification) == 0x0005A8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::IsShowingSubModeFirstTimeNotification' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, Hide_ToolTip_Timer) == 0x0005B0, "Member 'UDiscoveryLobbyMatchmakingPlay_C::Hide_ToolTip_Timer' has a wrong offset!");
static_assert(offsetof(UDiscoveryLobbyMatchmakingPlay_C, IsSubModeFirstTimeNotificationHidden) == 0x0005B8, "Member 'UDiscoveryLobbyMatchmakingPlay_C::IsSubModeFirstTimeNotificationHidden' has a wrong offset!");

}

