#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DryBoxRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DryBoxRuntime.ENyxGlassState
// NumValues: 0x0007
enum class ENyxGlassState : uint8
{
	Off                                      = 0,
	Swinging                                 = 1,
	AimingFromGround                         = 2,
	Hovering                                 = 3,
	Attacking                                = 4,
	Slashing                                 = 5,
	ENyxGlassState_MAX                       = 6,
};

// Enum DryBoxRuntime.ENyxGlassSlashSubstate
// NumValues: 0x0004
enum class ENyxGlassSlashSubstate : uint8
{
	MovingToTarget                           = 0,
	StoppedAtTarget                          = 1,
	LeapingBack                              = 2,
	ENyxGlassSlashSubstate_MAX               = 3,
};

// ScriptStruct DryBoxRuntime.NyxGlassTargetingData
// 0x0048 (0x0048 - 0x0000)
struct FNyxGlassTargetingData final
{
public:
	class AActor*                                 LeftActor;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 RightActor;                                        // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LeftAttachPoint;                                   // 0x0010(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightAttachPoint;                                  // 0x0028(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFoundLeftAttachPoint;                             // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFoundRightAttachPoint;                            // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsingDirectRaycast;                               // 0x0042(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNyxGlassTargetingData) == 0x000008, "Wrong alignment on FNyxGlassTargetingData");
static_assert(sizeof(FNyxGlassTargetingData) == 0x000048, "Wrong size on FNyxGlassTargetingData");
static_assert(offsetof(FNyxGlassTargetingData, LeftActor) == 0x000000, "Member 'FNyxGlassTargetingData::LeftActor' has a wrong offset!");
static_assert(offsetof(FNyxGlassTargetingData, RightActor) == 0x000008, "Member 'FNyxGlassTargetingData::RightActor' has a wrong offset!");
static_assert(offsetof(FNyxGlassTargetingData, LeftAttachPoint) == 0x000010, "Member 'FNyxGlassTargetingData::LeftAttachPoint' has a wrong offset!");
static_assert(offsetof(FNyxGlassTargetingData, RightAttachPoint) == 0x000028, "Member 'FNyxGlassTargetingData::RightAttachPoint' has a wrong offset!");
static_assert(offsetof(FNyxGlassTargetingData, bFoundLeftAttachPoint) == 0x000040, "Member 'FNyxGlassTargetingData::bFoundLeftAttachPoint' has a wrong offset!");
static_assert(offsetof(FNyxGlassTargetingData, bFoundRightAttachPoint) == 0x000041, "Member 'FNyxGlassTargetingData::bFoundRightAttachPoint' has a wrong offset!");
static_assert(offsetof(FNyxGlassTargetingData, bUsingDirectRaycast) == 0x000042, "Member 'FNyxGlassTargetingData::bUsingDirectRaycast' has a wrong offset!");

// ScriptStruct DryBoxRuntime.NyxGlassVelocityMetadata
// 0x0058 (0x0058 - 0x0000)
struct FNyxGlassVelocityMetadata final
{
public:
	struct FVector                                OrigVelocity;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FinalVelocity;                                     // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FinalGasForce;                                     // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CalcMaxSpeedMultiplier;                            // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseToAttachPoint;                               // 0x004C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPerformedHoverCalculation;                        // 0x004D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReachedSlashTarget;                               // 0x004E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldApplySlashDamage;                           // 0x004F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldLeapBack;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFinishedLeapingBack;                              // 0x0051(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCancelAttackSequence;                             // 0x0052(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNyxGlassVelocityMetadata) == 0x000008, "Wrong alignment on FNyxGlassVelocityMetadata");
static_assert(sizeof(FNyxGlassVelocityMetadata) == 0x000058, "Wrong size on FNyxGlassVelocityMetadata");
static_assert(offsetof(FNyxGlassVelocityMetadata, OrigVelocity) == 0x000000, "Member 'FNyxGlassVelocityMetadata::OrigVelocity' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, FinalVelocity) == 0x000018, "Member 'FNyxGlassVelocityMetadata::FinalVelocity' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, FinalGasForce) == 0x000030, "Member 'FNyxGlassVelocityMetadata::FinalGasForce' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, CalcMaxSpeedMultiplier) == 0x000048, "Member 'FNyxGlassVelocityMetadata::CalcMaxSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bCloseToAttachPoint) == 0x00004C, "Member 'FNyxGlassVelocityMetadata::bCloseToAttachPoint' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bPerformedHoverCalculation) == 0x00004D, "Member 'FNyxGlassVelocityMetadata::bPerformedHoverCalculation' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bReachedSlashTarget) == 0x00004E, "Member 'FNyxGlassVelocityMetadata::bReachedSlashTarget' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bShouldApplySlashDamage) == 0x00004F, "Member 'FNyxGlassVelocityMetadata::bShouldApplySlashDamage' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bShouldLeapBack) == 0x000050, "Member 'FNyxGlassVelocityMetadata::bShouldLeapBack' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bFinishedLeapingBack) == 0x000051, "Member 'FNyxGlassVelocityMetadata::bFinishedLeapingBack' has a wrong offset!");
static_assert(offsetof(FNyxGlassVelocityMetadata, bCancelAttackSequence) == 0x000052, "Member 'FNyxGlassVelocityMetadata::bCancelAttackSequence' has a wrong offset!");

}

