#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesTemporary_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R
// 0x0048 (0x0048 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R) == 0x000048, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RCrossProduct_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R) == 0x000010, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R, RetVal) == 0x000008, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDegreesToRadians_L_Nfloat_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R
// 0x0050 (0x0050 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R) == 0x000010, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R) == 0x000050, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R, RetVal) == 0x000040, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nrotation_M_Nrotation_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R) == 0x000028, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector2_M_Nvector2_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R) == 0x000038, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistance_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R) == 0x000028, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector2_M_Nvector2_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R) == 0x000038, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquared_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R) == 0x000038, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceSquaredXY_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R) == 0x000038, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDistanceXY_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R) == 0x000028, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2_M_Nvector2_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R) == 0x000028, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector2i_M_Nvector2i_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R) == 0x000038, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RDotProduct_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R
// 0x00E8 (0x00E8 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Lvector2i_Mvector2i_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0020(0x0011)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector2i                  _ExprResult_1;                                     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         _ExprResult_2;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_3;                                // 0x0050(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_4;                                // 0x0060(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_5;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_7;                                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_8;                                // 0x00A0(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_9;                                // 0x00B0(0x0011)(HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x00C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00D8(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R) == 0x0000E8, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::RetVal' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_0) == 0x000031, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_1) == 0x000038, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_1' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_2) == 0x000048, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResultStack_3) == 0x000050, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResultStack_3' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResultStack_4) == 0x000060, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResultStack_4' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_5) == 0x000078, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_5' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_6) == 0x000088, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_6' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_7) == 0x000098, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_7' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResultStack_8) == 0x0000A0, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResultStack_8' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResultStack_9) == 0x0000B0, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResultStack_9' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_10) == 0x0000C8, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R, _ExprResult_11) == 0x0000D8, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_REquals_L_Nvector2i_M_Nvector2i_R::_ExprResult_11' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation
// 0x0030 (0x0030 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation final
{
public:
	struct EpicGamesTemporary_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation) == 0x000010, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation) == 0x000030, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation, RetVal) == 0x000010, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIdentityRotation::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R
// 0x0050 (0x0050 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0028(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0030(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_2;                                // 0x0040(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R) == 0x000050, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R, RetVal) == 0x000028, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R::RetVal' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R, _ExprResultStack_1) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R::_ExprResultStack_1' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R, _ExprResultStack_2) == 0x000040, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector2_M_Nvector2_M_Nfloat_R::_ExprResultStack_2' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R
// 0x0070 (0x0070 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0038(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0040(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_2;                                // 0x0050(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_3;                                // 0x0060(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R) == 0x000070, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R, RetVal) == 0x000038, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R::RetVal' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResultStack_1) == 0x000040, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResultStack_1' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResultStack_2) == 0x000050, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResultStack_2' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResultStack_3) == 0x000060, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RIsAlmostEqual_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResultStack_3' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R
// 0x0098 (0x0098 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector2_Mvector2_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	double                                        _ExprResultStack_0;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_2;                                     // 0x0050(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_3;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0070(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_5;                                     // 0x0080(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R) == 0x000098, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, RetVal) == 0x000028, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::RetVal' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, _ExprResultStack_0) == 0x000038, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, _Callee_1) == 0x000040, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::_Callee_1' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, _ExprResult_2) == 0x000050, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, _ExprResultStack_3) == 0x000068, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::_ExprResultStack_3' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, _Callee_4) == 0x000070, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::_Callee_4' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R, _ExprResult_5) == 0x000080, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector2_M_Nvector2_M_Nfloat_R::_ExprResult_5' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R
// 0x00E0 (0x00E0 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mvector3_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	double                                        _ExprResultStack_0;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_2;                                     // 0x0068(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_3;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0088(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_5;                                     // 0x0098(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_6;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00B8(0x0010)(HasGetValueTypeHash)
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R _ExprResult_8;                                     // 0x00C8(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R) == 0x0000E0, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, RetVal) == 0x000038, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::RetVal' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResultStack_0) == 0x000050, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _Callee_1) == 0x000058, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_Callee_1' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResult_2) == 0x000068, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResultStack_3) == 0x000080, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResultStack_3' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _Callee_4) == 0x000088, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_Callee_4' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResult_5) == 0x000098, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResult_5' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResultStack_6) == 0x0000B0, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResultStack_6' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _Callee_7) == 0x0000B8, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_Callee_7' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R, _ExprResult_8) == 0x0000C8, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RLerp_L_Nvector3_M_Nvector3_M_Nfloat_R::_ExprResult_8' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R final
{
public:
	struct Ftuple_Lvector3_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R) == 0x000010, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R) == 0x000040, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotation_L_Nvector3_M_Nfloat_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R
// 0x0040 (0x0040 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lfloat_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000010, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R) == 0x000040, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R, RetVal) == 0x000020, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeRotationFromYawPitchRollDegrees_L_Nfloat_M_Nfloat_M_Nfloat_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R
// 0x0060 (0x0060 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lrotation_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0040(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R) == 0x000010, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R) == 0x000060, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R, RetVal) == 0x000040, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nrotation_M_Nrotation_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R
// 0x0050 (0x0050 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R final
{
public:
	struct EpicGamesTemporary_0::Ftuple_Lvector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash)
	struct FVerseRotation                         RetVal;                                            // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R) == 0x000010, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R) == 0x000050, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R, RetVal) == 0x000030, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_RMakeShortestRotationBetween_L_Nvector3_M_Nvector3_R::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes
// 0x0020 (0x0020 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes final
{
public:
	struct EpicGamesTemporary_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes) == 0x000020, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes, RetVal) == 0x000008, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_ROnes::RetVal' has a wrong offset!");

// Function EpicGamesTemporary.SpatialMath._L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R
// 0x0028 (0x0028 - 0x0000)
struct SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R final
{
public:
	struct Ftuple_Lfloat_Mvector2_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R) == 0x000008, "Wrong alignment on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R");
static_assert(sizeof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R) == 0x000028, "Wrong size on SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R");
static_assert(offsetof(SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'SpatialMath__L_2fUnrealEngine_2ecom_2fTemporary_2fSpatialMath_N_Roperator_U_2a_U_L_Nfloat_M_Nvector2_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
