#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorLlama

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorLlama.ErrorLlama_C
// 0x0048 (0x02B0 - 0x0268)
class UErrorLlama_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Llama;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bFlippedTexture;                                   // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CurLookAt2D;                                       // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurInputType;                                      // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EyeInterpSpeed;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialInputScale;                                // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ErrorLlama(int32 EntryPoint);
	void HandleInputTypeChanged(ECommonInputType NewInputType);
	void HandleNormalizedInputDirection(const struct FVector2D& TwoDInputVec);
	void RandomizeColor();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorLlama_C">();
	}
	static class UErrorLlama_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorLlama_C>();
	}
};
static_assert(alignof(UErrorLlama_C) == 0x000008, "Wrong alignment on UErrorLlama_C");
static_assert(sizeof(UErrorLlama_C) == 0x0002B0, "Wrong size on UErrorLlama_C");
static_assert(offsetof(UErrorLlama_C, UberGraphFrame) == 0x000268, "Member 'UErrorLlama_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, Image_0) == 0x000270, "Member 'UErrorLlama_C::Image_0' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, MID_Llama) == 0x000278, "Member 'UErrorLlama_C::MID_Llama' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, bFlippedTexture) == 0x000280, "Member 'UErrorLlama_C::bFlippedTexture' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, CurLookAt2D) == 0x000288, "Member 'UErrorLlama_C::CurLookAt2D' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, CurInputType) == 0x000298, "Member 'UErrorLlama_C::CurInputType' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, EyeInterpSpeed) == 0x0002A0, "Member 'UErrorLlama_C::EyeInterpSpeed' has a wrong offset!");
static_assert(offsetof(UErrorLlama_C, MaterialInputScale) == 0x0002A8, "Member 'UErrorLlama_C::MaterialInputScale' has a wrong offset!");

}

