#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorWindow.ErrorWindow_C
// 0x0080 (0x0640 - 0x05C0)
class UErrorWindow_C final : public UFortErrorWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Llama_3;                                           // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Llama_2;                                           // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_1;                                           // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Llama_1;                                           // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UErrorLlama_C*                          ErrorLlama_0;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UErrorLlama_C*                          ErrorLlama_C_0;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UErrorLlama_C*                          ErrorLlama_C_1;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurLlamaAnim;                                      // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UErrorLlama_C*>                  LlamaArray;                                        // 0x0620(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           LlamaReverseTimer;                                 // 0x0630(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AmbientLlamaPlayTimer;                             // 0x0638(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ErrorWindow(int32 EntryPoint);
	void HandleLlamaAnimFinish();
	void HandleLlamaCycleFinished();
	void Initialize_Close_Button();
	void LlamaReverse();
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnBeginIntro();
	void OnBeginOutro();
	void OnOverrideCloseButtonText(const class FText& OverrideText);
	void PlayRandomAmbientLlama();
	void ResetLlamas();
	void StartAmbientLlamaSequence();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorWindow_C">();
	}
	static class UErrorWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorWindow_C>();
	}
};
static_assert(alignof(UErrorWindow_C) == 0x000008, "Wrong alignment on UErrorWindow_C");
static_assert(sizeof(UErrorWindow_C) == 0x000640, "Wrong size on UErrorWindow_C");
static_assert(offsetof(UErrorWindow_C, UberGraphFrame) == 0x0005C0, "Member 'UErrorWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Llama_3) == 0x0005C8, "Member 'UErrorWindow_C::Llama_3' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Llama_2) == 0x0005D0, "Member 'UErrorWindow_C::Llama_2' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Intro_1) == 0x0005D8, "Member 'UErrorWindow_C::Intro_1' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Llama_1) == 0x0005E0, "Member 'UErrorWindow_C::Llama_1' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, ErrorLlama_0) == 0x0005E8, "Member 'UErrorWindow_C::ErrorLlama_0' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, ErrorLlama_C_0) == 0x0005F0, "Member 'UErrorWindow_C::ErrorLlama_C_0' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, ErrorLlama_C_1) == 0x0005F8, "Member 'UErrorWindow_C::ErrorLlama_C_1' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Image_Separator_Down) == 0x000600, "Member 'UErrorWindow_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Image_Separator_Up) == 0x000608, "Member 'UErrorWindow_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, Lightbox) == 0x000610, "Member 'UErrorWindow_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, CurLlamaAnim) == 0x000618, "Member 'UErrorWindow_C::CurLlamaAnim' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, LlamaArray) == 0x000620, "Member 'UErrorWindow_C::LlamaArray' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, LlamaReverseTimer) == 0x000630, "Member 'UErrorWindow_C::LlamaReverseTimer' has a wrong offset!");
static_assert(offsetof(UErrorWindow_C, AmbientLlamaPlayTimer) == 0x000638, "Member 'UErrorWindow_C::AmbientLlamaPlayTimer' has a wrong offset!");

}

