#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardSummary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardSummary.EventLeaderboardSummary_C
// 0x00A8 (0x07C0 - 0x0718)
class UEventLeaderboardSummary_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0718(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ViewAllHover;                                      // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_ViewAll;                                    // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ContainerBG;                          // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ScoringTitleBG;                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ViewAllBG;                            // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Title;                             // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry;                             // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_0;                           // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_1;                           // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_2;                           // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_3;                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_4;                           // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_5;                           // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_6;                           // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_7;                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntry_C*               EventLeaderboardEntry_8;                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SummaryContent;                            // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ViewFullLeaderboard;                          // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& TournamentId, const class FString& EventId)> EventViewFullLeaderboard;                          // 0x07B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_ViewAll_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo_0);
	void ExecuteUbergraph_EventLeaderboardSummary(int32 EntryPoint);
	void RefreshDataBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardSummary_C">();
	}
	static class UEventLeaderboardSummary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardSummary_C>();
	}
};
static_assert(alignof(UEventLeaderboardSummary_C) == 0x000008, "Wrong alignment on UEventLeaderboardSummary_C");
static_assert(sizeof(UEventLeaderboardSummary_C) == 0x0007C0, "Wrong size on UEventLeaderboardSummary_C");
static_assert(offsetof(UEventLeaderboardSummary_C, UberGraphFrame) == 0x000718, "Member 'UEventLeaderboardSummary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, ViewAllHover) == 0x000720, "Member 'UEventLeaderboardSummary_C::ViewAllHover' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, Button_ViewAll) == 0x000728, "Member 'UEventLeaderboardSummary_C::Button_ViewAll' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, CommonBorder_ContainerBG) == 0x000730, "Member 'UEventLeaderboardSummary_C::CommonBorder_ContainerBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, CommonBorder_ScoringTitleBG) == 0x000738, "Member 'UEventLeaderboardSummary_C::CommonBorder_ScoringTitleBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, CommonBorder_ViewAllBG) == 0x000740, "Member 'UEventLeaderboardSummary_C::CommonBorder_ViewAllBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, CommonTextBlock_Title) == 0x000748, "Member 'UEventLeaderboardSummary_C::CommonTextBlock_Title' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry) == 0x000750, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_0) == 0x000758, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_0' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_1) == 0x000760, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_2) == 0x000768, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_2' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_3) == 0x000770, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_3' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_4) == 0x000778, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_4' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_5) == 0x000780, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_5' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_6) == 0x000788, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_6' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_7) == 0x000790, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_7' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventLeaderboardEntry_8) == 0x000798, "Member 'UEventLeaderboardSummary_C::EventLeaderboardEntry_8' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, Overlay_SummaryContent) == 0x0007A0, "Member 'UEventLeaderboardSummary_C::Overlay_SummaryContent' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, Text_ViewFullLeaderboard) == 0x0007A8, "Member 'UEventLeaderboardSummary_C::Text_ViewFullLeaderboard' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardSummary_C, EventViewFullLeaderboard) == 0x0007B0, "Member 'UEventLeaderboardSummary_C::EventViewFullLeaderboard' has a wrong offset!");

}

