#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventTeamMatchHistoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventTeamMatchHistoryEntry.EventTeamMatchHistoryEntry_C
// 0x0050 (0x14F0 - 0x14A0)
class UEventTeamMatchHistoryEntry_C final : public UFortEventTeamMatchHistoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Zebra;                                      // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnlineStatus;                                // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ReplayInteraction;                            // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hovered;                                           // 0x14D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Unhovered;                                         // 0x14E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_EventTeamMatchHistoryEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventTeamMatchHistoryEntry_C">();
	}
	static class UEventTeamMatchHistoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventTeamMatchHistoryEntry_C>();
	}
};
static_assert(alignof(UEventTeamMatchHistoryEntry_C) == 0x000010, "Wrong alignment on UEventTeamMatchHistoryEntry_C");
static_assert(sizeof(UEventTeamMatchHistoryEntry_C) == 0x0014F0, "Wrong size on UEventTeamMatchHistoryEntry_C");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, UberGraphFrame) == 0x0014A0, "Member 'UEventTeamMatchHistoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Selected) == 0x0014A8, "Member 'UEventTeamMatchHistoryEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Border_Zebra) == 0x0014B0, "Member 'UEventTeamMatchHistoryEntry_C::Border_Zebra' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_OnlineStatus) == 0x0014B8, "Member 'UEventTeamMatchHistoryEntry_C::Image_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Image_SelectedBG) == 0x0014C0, "Member 'UEventTeamMatchHistoryEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Text_ReplayInteraction) == 0x0014C8, "Member 'UEventTeamMatchHistoryEntry_C::Text_ReplayInteraction' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Hovered) == 0x0014D0, "Member 'UEventTeamMatchHistoryEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UEventTeamMatchHistoryEntry_C, Unhovered) == 0x0014E0, "Member 'UEventTeamMatchHistoryEntry_C::Unhovered' has a wrong offset!");

}

