#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventModeUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class EventModeUI.FocusButton
// 0x0010 (0x03E8 - 0x03D8)
class UFocusButton final : public UBacchusActionButton
{
public:
	class UPaperSprite*                           StartFocusingSprite;                               // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperSprite*                           StopFocusingSprite;                                // 0x03E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusButton">();
	}
	static class UFocusButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusButton>();
	}
};
static_assert(alignof(UFocusButton) == 0x000008, "Wrong alignment on UFocusButton");
static_assert(sizeof(UFocusButton) == 0x0003E8, "Wrong size on UFocusButton");
static_assert(offsetof(UFocusButton, StartFocusingSprite) == 0x0003D8, "Member 'UFocusButton::StartFocusingSprite' has a wrong offset!");
static_assert(offsetof(UFocusButton, StopFocusingSprite) == 0x0003E0, "Member 'UFocusButton::StopFocusingSprite' has a wrong offset!");

// Class EventModeUI.FortEventModeEmotesWidget
// 0x00B0 (0x0380 - 0x02D0)
class UFortEventModeEmotesWidget final : public UFortHUDElementWidget
{
public:
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote1;                                            // 0x02D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote2;                                            // 0x02F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> Emote3;                                            // 0x0320(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortMontageItemDefinitionBase>> RandomEmotes;                                      // 0x0348(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_Emote1;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote2;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_Emote3;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                         Text_EmoteRandom;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFocusAvailableChanged(bool bIsFocusAvailable);
	void OnFocusStateChanged(bool bIsFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventModeEmotesWidget">();
	}
	static class UFortEventModeEmotesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventModeEmotesWidget>();
	}
};
static_assert(alignof(UFortEventModeEmotesWidget) == 0x000008, "Wrong alignment on UFortEventModeEmotesWidget");
static_assert(sizeof(UFortEventModeEmotesWidget) == 0x000380, "Wrong size on UFortEventModeEmotesWidget");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote1) == 0x0002D0, "Member 'UFortEventModeEmotesWidget::Emote1' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote2) == 0x0002F8, "Member 'UFortEventModeEmotesWidget::Emote2' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Emote3) == 0x000320, "Member 'UFortEventModeEmotesWidget::Emote3' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, RandomEmotes) == 0x000348, "Member 'UFortEventModeEmotesWidget::RandomEmotes' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote1) == 0x000360, "Member 'UFortEventModeEmotesWidget::Text_Emote1' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote2) == 0x000368, "Member 'UFortEventModeEmotesWidget::Text_Emote2' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_Emote3) == 0x000370, "Member 'UFortEventModeEmotesWidget::Text_Emote3' has a wrong offset!");
static_assert(offsetof(UFortEventModeEmotesWidget, Text_EmoteRandom) == 0x000378, "Member 'UFortEventModeEmotesWidget::Text_EmoteRandom' has a wrong offset!");

// Class EventModeUI.FortMobileActionButtonBehavior_Focus
// 0x0008 (0x0118 - 0x0110)
class UFortMobileActionButtonBehavior_Focus : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           StopFocusingSprite;                                // 0x0110(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleCanUseEventModeFocusChanged(bool bCanUseEventModeFocus);
	void HandleEventModeFocusingChanged(bool bIsEventModeFocusing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_Focus">();
	}
	static class UFortMobileActionButtonBehavior_Focus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_Focus>();
	}
};
static_assert(alignof(UFortMobileActionButtonBehavior_Focus) == 0x000008, "Wrong alignment on UFortMobileActionButtonBehavior_Focus");
static_assert(sizeof(UFortMobileActionButtonBehavior_Focus) == 0x000118, "Wrong size on UFortMobileActionButtonBehavior_Focus");
static_assert(offsetof(UFortMobileActionButtonBehavior_Focus, StopFocusingSprite) == 0x000110, "Member 'UFortMobileActionButtonBehavior_Focus::StopFocusingSprite' has a wrong offset!");

}

