#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Blue_Jay_Summer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Blue_Jay_Summer_AnimBP.F_MED_Blue_Jay_Summer_AnimBP_C
// 0x4E60 (0x5550 - 0x06F0)
class UF_MED_Blue_Jay_Summer_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0700(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0708(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0728(0x01D0)(ContainsInstancedReference)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x0900(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x0E10(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x1320(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x1830(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x1D40(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x2250(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x2760(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x2C70(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x3180(0x0990)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3B10(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3C38(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x3C58(0x0470)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x40C8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x41F0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x4210(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x4720(0x0510)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x4C30(0x0128)()
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x4D58(0x07B8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityVector;                                     // 0x5510(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        idlePlaying;                                       // 0x5528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Anim_Inst;                                         // 0x5530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x5538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          EnsembleBackpack;                                  // 0x5540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Blue_Jay_Summer_AnimBP_C">();
	}
	static class UF_MED_Blue_Jay_Summer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Blue_Jay_Summer_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Blue_Jay_Summer_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Blue_Jay_Summer_AnimBP_C");
static_assert(sizeof(UF_MED_Blue_Jay_Summer_AnimBP_C) == 0x005550, "Wrong size on UF_MED_Blue_Jay_Summer_AnimBP_C");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, UberGraphFrame) == 0x0006F0, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006F8, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimBlueprintExtension_Base) == 0x000700, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_Root) == 0x000708, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000728, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x000900, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x000E10, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x001320, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x001830, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x001D40, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x002250, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x002760, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x002C70, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_RigidBody) == 0x003180, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x003B10, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x003C38, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_ControlRig) == 0x003C58, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0040C8, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0041F0, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x004210, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x004720, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, AnimGraphNode_ModifyBone) == 0x004C30, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, Gravity_Override_Params) == 0x004D58, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::Gravity_Override_Params' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, GravityVector) == 0x005510, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::GravityVector' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, idlePlaying) == 0x005528, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::idlePlaying' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, Anim_Inst) == 0x005530, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::Anim_Inst' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, skel_mesh) == 0x005538, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_AnimBP_C, EnsembleBackpack) == 0x005540, "Member 'UF_MED_Blue_Jay_Summer_AnimBP_C::EnsembleBackpack' has a wrong offset!");

}

