#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Blue_Jay_Summer_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Blue_Jay_Summer_FaceAcc_AnimBP.F_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C
// 0x3F10 (0x4600 - 0x06F0)
class UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0700(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0708(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0728(0x01D0)(ContainsInstancedReference)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x0900(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x0E10(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x1320(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1830(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1850(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x1870(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x1D80(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x2290(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x27A0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x2CB0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x31C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x36D0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x3BE0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x40F0(0x0510)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_Blue_Jay_Summer_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C) == 0x004600, "Wrong size on UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, UberGraphFrame) == 0x0006F0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006F8, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x000700, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000708, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000728, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_11) == 0x000900, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_10) == 0x000E10, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x001320, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001830, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001850, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x001870, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x001D80, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x002290, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x0027A0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x002CB0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0031C0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0036D0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x003BE0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0040F0, "Member 'UF_MED_Blue_Jay_Summer_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

