#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Blue_Jay_Summer_AnimBP

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Blue_Jay_Summer_AnimBP.F_MED_Blue_Jay_Summer_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function F_MED_Blue_Jay_Summer_AnimBP.F_MED_Blue_Jay_Summer_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Blue_Jay_Summer_AnimBP.F_MED_Blue_Jay_Summer_AnimBP_C.ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP
// 0x00E0 (0x00E0 - 0x0000)
struct F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Gravity_Override_State_Function_GravityOverride; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Gravity_Override_State_Function_CurrentStateOut; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut; // 0x0038(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BackpackItemDefinitionHasAnyMetaTag_ReturnValue; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_idlePlaying_ImplicitCast;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP) == 0x000008, "Wrong alignment on F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP");
static_assert(sizeof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP) == 0x0000E0, "Wrong size on F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverride) == 0x000010, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverride' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_Gravity_Override_State_Function_CurrentStateOut) == 0x000028, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_Gravity_Override_State_Function_CurrentStateOut' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut) == 0x000038, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x0000A0, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_Montage_IsPlaying_ReturnValue) == 0x0000A9, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000AC, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x0000B8, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, K2Node_MakeArray_Array) == 0x0000C0, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, CallFunc_BackpackItemDefinitionHasAnyMetaTag_ReturnValue) == 0x0000D0, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::CallFunc_BackpackItemDefinitionHasAnyMetaTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP, K2Node_VariableSet_idlePlaying_ImplicitCast) == 0x0000D8, "Member 'F_MED_Blue_Jay_Summer_AnimBP_C_ExecuteUbergraph_F_MED_Blue_Jay_Summer_AnimBP::K2Node_VariableSet_idlePlaying_ImplicitCast' has a wrong offset!");

}

