#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FeatTimelineListEntry

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FeatTimelineListEntry_C_BndEvt__SimpleButton_ClickArea_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.ExecuteUbergraph_FeatTimelineListEntry
// 0x00E0 (0x00E0 - 0x0000)
struct FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumFeatsOnDay;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_IdxOnDay;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumDays;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast_1;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxDesiredWidth_InMaxDesiredWidth_ImplicitCast; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry");
static_assert(sizeof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry) == 0x0000E0, "Wrong size on FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, EntryPoint) == 0x000000, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_NumFeatsOnDay) == 0x000018, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_NumFeatsOnDay' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_IdxOnDay) == 0x00001C, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_IdxOnDay' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_MakeStruct_Margin) == 0x000028, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_MakeStruct_Margin_1) == 0x000040, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000050, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_NumDays) == 0x000058, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_NumDays' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_Event_IsDesignTime) == 0x00005C, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000060, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsVisible_ReturnValue) == 0x000068, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000070, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000078, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000080, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000088, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x000090, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsHovered_ReturnValue) == 0x000098, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_BooleanOR_ReturnValue) == 0x000099, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_ComponentBoundEvent_Button_1) == 0x0000A0, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_IsUsingTouch_ReturnValue) == 0x0000B0, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_B_ImplicitCast) == 0x0000B8, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000C0, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_Multiply_IntFloat_B_ImplicitCast_1) == 0x0000C8, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_Multiply_IntFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SetMaxDesiredWidth_InMaxDesiredWidth_ImplicitCast) == 0x0000D0, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SetMaxDesiredWidth_InMaxDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0000D4, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x0000D8, "Member 'FeatTimelineListEntry_C_ExecuteUbergraph_FeatTimelineListEntry::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.OnFeatInfoSet
// 0x0008 (0x0008 - 0x0000)
struct FeatTimelineListEntry_C_OnFeatInfoSet final
{
public:
	int32                                         NumFeatsOnDay;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IdxOnDay;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_OnFeatInfoSet) == 0x000004, "Wrong alignment on FeatTimelineListEntry_C_OnFeatInfoSet");
static_assert(sizeof(FeatTimelineListEntry_C_OnFeatInfoSet) == 0x000008, "Wrong size on FeatTimelineListEntry_C_OnFeatInfoSet");
static_assert(offsetof(FeatTimelineListEntry_C_OnFeatInfoSet, NumFeatsOnDay) == 0x000000, "Member 'FeatTimelineListEntry_C_OnFeatInfoSet::NumFeatsOnDay' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_OnFeatInfoSet, IdxOnDay) == 0x000004, "Member 'FeatTimelineListEntry_C_OnFeatInfoSet::IdxOnDay' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.OnTimespanInfoSet
// 0x0004 (0x0004 - 0x0000)
struct FeatTimelineListEntry_C_OnTimespanInfoSet final
{
public:
	int32                                         NumDays;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_OnTimespanInfoSet) == 0x000004, "Wrong alignment on FeatTimelineListEntry_C_OnTimespanInfoSet");
static_assert(sizeof(FeatTimelineListEntry_C_OnTimespanInfoSet) == 0x000004, "Wrong size on FeatTimelineListEntry_C_OnTimespanInfoSet");
static_assert(offsetof(FeatTimelineListEntry_C_OnTimespanInfoSet, NumDays) == 0x000000, "Member 'FeatTimelineListEntry_C_OnTimespanInfoSet::NumDays' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FeatTimelineListEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FeatTimelineListEntry_C_PreConstruct) == 0x000001, "Wrong alignment on FeatTimelineListEntry_C_PreConstruct");
static_assert(sizeof(FeatTimelineListEntry_C_PreConstruct) == 0x000001, "Wrong size on FeatTimelineListEntry_C_PreConstruct");
static_assert(offsetof(FeatTimelineListEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FeatTimelineListEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FeatTimelineListEntry.FeatTimelineListEntry_C.SetSeasonStyle
// 0x0140 (0x0140 - 0x0000)
struct FeatTimelineListEntry_C_SetSeasonStyle final
{
public:
	struct FAthenaFeatTimelineDisplayData         FeatTimelineDisplayStruct;                         // 0x0000(0x0048)(Edit, BlueprintVisible)
	class UDataTable*                             SeasonFeatTimelineDisplayData;                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_CalculateSourceTag_ReturnValue;           // 0x0070(0x0004)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaFeatTimelineDisplayData         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
};
static_assert(alignof(FeatTimelineListEntry_C_SetSeasonStyle) == 0x000008, "Wrong alignment on FeatTimelineListEntry_C_SetSeasonStyle");
static_assert(sizeof(FeatTimelineListEntry_C_SetSeasonStyle) == 0x000140, "Wrong size on FeatTimelineListEntry_C_SetSeasonStyle");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, FeatTimelineDisplayStruct) == 0x000000, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::FeatTimelineDisplayStruct' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, SeasonFeatTimelineDisplayData) == 0x000048, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::SeasonFeatTimelineDisplayData' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000058, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000060, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000068, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_CalculateSourceTag_ReturnValue) == 0x000070, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_CalculateSourceTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetTagName_ReturnValue) == 0x000074, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, K2Node_MakeArray_Array) == 0x000118, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FeatTimelineListEntry_C_SetSeasonStyle, CallFunc_Format_ReturnValue) == 0x000128, "Member 'FeatTimelineListEntry_C_SetSeasonStyle::CallFunc_Format_ReturnValue' has a wrong offset!");

}

