#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_DeformRig_Value_Struct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FN_DeformRig_Value_Struct.FN_DeformRig_Value_Struct
// 0x05A0 (0x05A0 - 0x0000)
struct FFN_DeformRig_Value_Struct final
{
public:
	struct FTransform                             upperarm_up_18_EC3E7F2D49F194DF7852879628AE361A;   // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             upperarm_fwd_fr_19_3597600644E81495DCE68085E1E3B213; // 0x0060(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             upperarm_fwd_bk_20_9973AAD84EE0A1E349BC9E85067D4A3C; // 0x00C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             upperarm_bk_22_BC7A7EED432F9FC35E3F30830B7BC0DC;   // 0x0120(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             elbow_in_24_0AEEC41843B3C28036C085B09C47E077;      // 0x0180(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             elbow_out_26_55EF075C4B65D90B9ADAA1A63501595D;     // 0x01E0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             wrist_up_31_08F632C14E91E4A25C9A8F932EFF67BC;      // 0x0240(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             wrist_dn_32_6C820F1E4318C77C62117BBAC5B05EF9;      // 0x02A0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             groin_35_09CC0B0944ACCE29D708CBB2226A3154;         // 0x0300(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             glute_36_2AD3C9934F85E8E19BE5E590C043D687;         // 0x0360(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             knee_in_41_BBCE8D81404E07072413DABDDE26B7E0;       // 0x03C0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             knee_out_42_2ED1ADDF4524F3B88B2C9EA071E7A5E2;      // 0x0420(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             bicep_44_8EB45FB4416336E094E596B4A8895EDE;         // 0x0480(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             lat_45_050D0CAE411BD5B9AEB4B5A60FA2335B;           // 0x04E0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             pec_51_58FB7CE84C6A464BE1FBE3AFDD2522D1;           // 0x0540(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFN_DeformRig_Value_Struct) == 0x000010, "Wrong alignment on FFN_DeformRig_Value_Struct");
static_assert(sizeof(FFN_DeformRig_Value_Struct) == 0x0005A0, "Wrong size on FFN_DeformRig_Value_Struct");
static_assert(offsetof(FFN_DeformRig_Value_Struct, upperarm_up_18_EC3E7F2D49F194DF7852879628AE361A) == 0x000000, "Member 'FFN_DeformRig_Value_Struct::upperarm_up_18_EC3E7F2D49F194DF7852879628AE361A' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, upperarm_fwd_fr_19_3597600644E81495DCE68085E1E3B213) == 0x000060, "Member 'FFN_DeformRig_Value_Struct::upperarm_fwd_fr_19_3597600644E81495DCE68085E1E3B213' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, upperarm_fwd_bk_20_9973AAD84EE0A1E349BC9E85067D4A3C) == 0x0000C0, "Member 'FFN_DeformRig_Value_Struct::upperarm_fwd_bk_20_9973AAD84EE0A1E349BC9E85067D4A3C' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, upperarm_bk_22_BC7A7EED432F9FC35E3F30830B7BC0DC) == 0x000120, "Member 'FFN_DeformRig_Value_Struct::upperarm_bk_22_BC7A7EED432F9FC35E3F30830B7BC0DC' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, elbow_in_24_0AEEC41843B3C28036C085B09C47E077) == 0x000180, "Member 'FFN_DeformRig_Value_Struct::elbow_in_24_0AEEC41843B3C28036C085B09C47E077' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, elbow_out_26_55EF075C4B65D90B9ADAA1A63501595D) == 0x0001E0, "Member 'FFN_DeformRig_Value_Struct::elbow_out_26_55EF075C4B65D90B9ADAA1A63501595D' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, wrist_up_31_08F632C14E91E4A25C9A8F932EFF67BC) == 0x000240, "Member 'FFN_DeformRig_Value_Struct::wrist_up_31_08F632C14E91E4A25C9A8F932EFF67BC' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, wrist_dn_32_6C820F1E4318C77C62117BBAC5B05EF9) == 0x0002A0, "Member 'FFN_DeformRig_Value_Struct::wrist_dn_32_6C820F1E4318C77C62117BBAC5B05EF9' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, groin_35_09CC0B0944ACCE29D708CBB2226A3154) == 0x000300, "Member 'FFN_DeformRig_Value_Struct::groin_35_09CC0B0944ACCE29D708CBB2226A3154' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, glute_36_2AD3C9934F85E8E19BE5E590C043D687) == 0x000360, "Member 'FFN_DeformRig_Value_Struct::glute_36_2AD3C9934F85E8E19BE5E590C043D687' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, knee_in_41_BBCE8D81404E07072413DABDDE26B7E0) == 0x0003C0, "Member 'FFN_DeformRig_Value_Struct::knee_in_41_BBCE8D81404E07072413DABDDE26B7E0' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, knee_out_42_2ED1ADDF4524F3B88B2C9EA071E7A5E2) == 0x000420, "Member 'FFN_DeformRig_Value_Struct::knee_out_42_2ED1ADDF4524F3B88B2C9EA071E7A5E2' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, bicep_44_8EB45FB4416336E094E596B4A8895EDE) == 0x000480, "Member 'FFN_DeformRig_Value_Struct::bicep_44_8EB45FB4416336E094E596B4A8895EDE' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, lat_45_050D0CAE411BD5B9AEB4B5A60FA2335B) == 0x0004E0, "Member 'FFN_DeformRig_Value_Struct::lat_45_050D0CAE411BD5B9AEB4B5A60FA2335B' has a wrong offset!");
static_assert(offsetof(FFN_DeformRig_Value_Struct, pec_51_58FB7CE84C6A464BE1FBE3AFDD2522D1) == 0x000540, "Member 'FFN_DeformRig_Value_Struct::pec_51_58FB7CE84C6A464BE1FBE3AFDD2522D1' has a wrong offset!");

}

