#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Fortnite_M_Avg_Player_AnimBlueprint_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// 0xB290 (0xCC10 - 0x1980)
class UFortnite_M_Avg_Player_AnimBlueprint_C final : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1988(0x0158)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1AE0(0x0008)()
	struct FAnimSubsystem_SharedLinkedAnimLayers  AnimBlueprintExtension_SharedLinkedAnimLayers;     // 0x1AE8(0x0028)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1B10(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1B18(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_36;                  // 0x1B20(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_35;                  // 0x1BE0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_43;                             // 0x1CA0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_34;                  // 0x1CC0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_42;                             // 0x1D80(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_33;                  // 0x1DA0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_41;                             // 0x1E60(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_32;                  // 0x1E80(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_40;                             // 0x1F40(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_31;                  // 0x1F60(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_39;                             // 0x2020(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_30;                  // 0x2040(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_29;                  // 0x2100(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_38;                             // 0x21C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_28;                  // 0x21E0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_37;                             // 0x22A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_27;                  // 0x22C0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_36;                             // 0x2380(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_26;                  // 0x23A0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_35;                             // 0x2460(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_25;                  // 0x2480(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x2540(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_24;                  // 0x2560(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x2620(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x2640(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x2700(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x27C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x27E0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x28A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x28C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_50;                  // 0x2908(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_8;                      // 0x2950(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x2960(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x2980(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_49;                  // 0x29C8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_7;                      // 0x2A10(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x2A20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x2A40(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_48;                  // 0x2A88(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_6;                      // 0x2AD0(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x2AE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x2B00(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x2B48(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x2B68(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x2BB0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x2BD0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x2C90(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x2CB0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x2D70(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_47;                  // 0x2D90(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x2DD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x2E20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x2E68(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_46;                  // 0x2EB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x2EF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x2F40(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_45;                  // 0x2F88(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_5;                      // 0x2FD0(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_44;                  // 0x2FE0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x3028(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_11;                  // 0x3070(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x30B8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_43;                  // 0x30D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x3120(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x3168(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x31B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_42;                  // 0x31F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x3240(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x3288(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_41;                  // 0x32D0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_4;                      // 0x3318(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_40;                  // 0x3328(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x3370(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_10;                  // 0x33B8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x3400(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x3420(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_39;                  // 0x3468(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x34B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x34F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_38;                  // 0x3540(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x3588(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_37;                  // 0x35D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x3618(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_36;                  // 0x3660(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x36A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x36F0(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_35;                  // 0x3700(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x3748(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_9;                   // 0x3790(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x37D8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_34;                  // 0x37F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x3840(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x3888(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x38D0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_33;                  // 0x3918(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x3960(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x39A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x39F0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x3A38(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_8;                   // 0x3A80(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x3AC8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x3B10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x3B58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x3BA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x3BE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0x3C30(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x3C78(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x3CC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x3D08(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0x3D50(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x3D98(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0x3DE0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x3E28(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x3E70(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0x3EB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x3F00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x3F48(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x3F90(0x0100)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x4090(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x40D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0x4120(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x4168(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x41B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x41F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0x4240(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x4288(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x42D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x4318(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x4360(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x4380(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x43A0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x43C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x43E0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x44A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x44C0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x4580(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x45A0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x4660(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x4680(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x4740(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x4800(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x48C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x48E0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x49A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x49C0(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x4A80(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x4B40(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x4B60(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x4BA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x4BD0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x4BF8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x4C40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x4C68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x4C90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x4CB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x4CE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x4D08(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x4D30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x4D78(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_19;                  // 0x4D98(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x4E60(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x4E70(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x4E90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x4EB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x4EE0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x4F28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x4F70(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x4F90(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x5058(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x5158(0x0100)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_18;                  // 0x5258(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_15;                  // 0x5320(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x53D8(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_14;                  // 0x5420(0x00B8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_17;                  // 0x54D8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x55A0(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_16;                  // 0x55E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x56B0(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x57B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x57D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x5800(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x5828(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x5908(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x5A08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x5A30(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x5A58(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x5AA0(0x00E0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_Layer_2;                             // 0x5B80(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_15;                  // 0x5C48(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x5D10(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x5D30(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x5E10(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x5ED8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x5F00(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x5F48(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x6028(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x6070(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x60B8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x6180(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x6248(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x6270(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x62B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x6300(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x6348(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x6390(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x63D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x6420(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x6468(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x64B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x64D0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x6590(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x6690(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x66B8(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x66E0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x67A0(0x0100)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x68A0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x68C0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x6908(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x6950(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x6998(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x69C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x6A08(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x6A50(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x6B30(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x6B78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x6BA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x6BE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x6C30(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x6C78(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x6D38(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x6E38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x6E60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x6E88(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x6EB0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x6EF8(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x6FD8(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x70D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x7120(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x7148(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x7170(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x71B8(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x7298(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x72B8(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x7378(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_13;                  // 0x73C0(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x7478(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x7540(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x7640(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x7668(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x7690(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x76B0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x7770(0x0100)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_12;                  // 0x7870(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x7928(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x7950(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x7998(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x79C0(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x7AA0(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x7AC0(0x00E0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x7BA0(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x7BB0(0x00E0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x7C90(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x7CA0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x7CE8(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_11;                  // 0x7D30(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x7DE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x7E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x7E38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x7E60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x7E88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x7EB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x7ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x7F00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x7F28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x7F50(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_10;                  // 0x7F78(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x8030(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x8050(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x80C0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x8130(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x8178(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x81E8(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x8258(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x82A0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x8310(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x8358(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x8420(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x8440(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x8450(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x8470(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x8538(0x00C0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x85F8(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x86C0(0x0020)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting;                   // 0x86E0(0x0110)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x87F0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x8838(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x8858(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x8878(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x8938(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x8A38(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x8A60(0x0100)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_9;                   // 0x8B60(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x8C18(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_Layer_1;                             // 0x8C40(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_14;                  // 0x8D08(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_8;                   // 0x8DD0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x8E88(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_13;                  // 0x8EB0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x8F78(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x9078(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x90A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x90C8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x90F0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x9138(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x9180(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x91A8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x91D0(0x0100)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x92D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x92F0(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x93B0(0x00C0)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x9470(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x9518(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x9560(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x9660(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x9688(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x96B0(0x00E0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x9790(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x97A0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x97E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x9808(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x98C8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x9910(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x9A10(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x9A58(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x9B58(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x9B80(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x9BC8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x9BF0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x9C38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x9C60(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_12;                  // 0x9C88(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x9D50(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x9E50(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x9E78(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x9E98(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x9FB0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x9FF8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0xA040(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0xA158(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xA270(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xA330(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0xA430(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0xA458(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0xA480(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xA4A8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xA4C8(0x0100)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0xA5C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0xA5F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0xA618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0xA640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0xA668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0xA690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0xA6B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0xA6E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0xA708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0xA730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0xA758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0xA780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0xA7A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0xA7D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0xA7F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0xA820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0xA848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0xA870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0xA898(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0xA8C0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0xA8E8(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xA8F8(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_7;                   // 0xA940(0x00B8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_6;                   // 0xA9F8(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0xAAB0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0xAAF8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0xAB20(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0xABE8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0xACB0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0xACD0(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_5;                   // 0xACF8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0xADB0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0xADD0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0xADF8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0xAEC0(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_4;                   // 0xAEE0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0xAF98(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xAFB8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0xAFE0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0xB028(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0xB070(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0xB0B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xB0D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xB120(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_3;                   // 0xB140(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xB1F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xB218(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xB260(0x0020)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0xB280(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xB338(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xB358(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0xB420(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0xB520(0x0100)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_Layer;                               // 0xB620(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0xB6E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xB7B0(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0xB8B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0xB8D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0xB900(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0xB928(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0xB950(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xB998(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xB9B8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0xBA80(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0xBB48(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0xBC10(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xBCC8(0x0048)()
	struct FFortAnimNode_ScaleCharacterBones      FortAnimGraphNode_ScaleCharacterBones;             // 0xBD10(0x00D8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0xBDE8(0x0100)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xBEE8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xBF08(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0xBF28(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0xBF50(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0xC018(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xC0E0(0x0100)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0xC1E0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0xC2A8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xC370(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0xC398(0x00E0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0xC478(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0xC540(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0xC588(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0xC650(0x00B8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0xC708(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0xC7D0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xC898(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xC8C0(0x0028)()
	struct FFortAnimInput_AdjustedAim             __CustomProperty_InputParam_68C70D6347F81F8476C87EA798A19370; // 0xC8E8(0x025C)(NoDestructor)
	bool                                          __CustomProperty_ParaGlide_TriggerAnim_EE06BC0D4AF7A3598BB824A5286F89C8; // 0xCB44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB45[0x3];                                     // 0xCB45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __CustomProperty_EmoteAnimOffsetCurveName_D066576F42932FCE06C5E8B658C15225; // 0xCB48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB4C[0x4];                                     // 0xCB4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_LeftHandOverride_D066576F42932FCE06C5E8B658C15225; // 0xCB50(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_RightHandOverride_D066576F42932FCE06C5E8B658C15225; // 0xCB68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_IsHidingInProp_D066576F42932FCE06C5E8B658C15225; // 0xCB80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB81[0x7];                                     // 0xCB81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UFortPlayerAnimInstance* CharPart)> MenuScreenDispatcher;                              // 0xCB88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        StartAnimBlendTime;                                // 0xCB98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PivotAnimBlendTime;                                // 0xCBA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchPlayRate;                                    // 0xCBA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSnowman;                                         // 0xCBB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBB1[0x7];                                     // 0xCBB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Indigo_Boost;                                      // 0xCBB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ParaGlide_UseAltGliderCam;                         // 0xCBC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBC9[0x7];                                     // 0xCBC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeftHandOverride;                                  // 0xCBD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightHandOverride;                                 // 0xCBE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParaGlide_TriggerAnim;                             // 0xCC00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC01[0x3];                                     // 0xCC01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EmoteAnimOffsetCurveName;                          // 0xCC04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_CreateToolFlyModeLoop_Entered();
	void AnimNotify_CreateToolFlyModeStart_Entered();
	void AnimNotify_IndigoLaunch();
	void AnimNotify_Melee_Swing_L();
	void AnimNotify_Melee_Swing_L_2();
	void AnimNotify_Melee_Swing_L_End();
	void AnimNotify_Melee_Swing_R();
	void AnimNotify_Melee_Swing_R_2();
	void AnimNotify_Melee_Swing_R_End();
	void AnimNotify_OpenGlider();
	void AnimNotify_playFacialAnim();
	void BlueprintProcessAnimInputEvent(const class UFortAnimInputEvent* AnimInputEvent);
	void CharacterSkeletalControlPostLegIK(const struct FPoseLink& InPosePostLegIK, struct FPoseLink* CharacterSkeletalControlPostLegIK_0);
