#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortActivatableMovieWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function FortActivatableMovieWidget.FortActivatableMovieWidget_C.ExecuteUbergraph_FortActivatableMovieWidget
// 0x00A0 (0x00A0 - 0x0000)
struct FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bReverse_1;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnd;                                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUFortActivatablePrePostRollStates            K2Node_Event_Reason;                               // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bReverse;                             // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget) == 0x000008, "Wrong alignment on FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget");
static_assert(sizeof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget) == 0x0000A0, "Wrong size on FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, EntryPoint) == 0x000000, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, Temp_bool_Variable) == 0x000004, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, Temp_byte_Variable) == 0x000010, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, Temp_byte_Variable_1) == 0x000011, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, Temp_bool_Variable_1) == 0x000020, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, Temp_byte_Variable_2) == 0x000021, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, Temp_byte_Variable_3) == 0x000022, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000040, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000048, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_Event_bReverse_1) == 0x000058, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_Event_bReverse_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_Select_Default) == 0x000059, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000060, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000068, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000078, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_Event_bEnd) == 0x000080, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_Event_bEnd' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_Event_Reason) == 0x000081, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_Event_bReverse) == 0x000082, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_Event_bReverse' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000083, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, K2Node_Select_Default_1) == 0x000084, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000088, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000090, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'FortActivatableMovieWidget_C_ExecuteUbergraph_FortActivatableMovieWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function FortActivatableMovieWidget.FortActivatableMovieWidget_C.StartFadeFromColor
// 0x0003 (0x0003 - 0x0000)
struct FortActivatableMovieWidget_C_StartFadeFromColor final
{
public:
	bool                                          bEnd;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUFortActivatablePrePostRollStates            Reason;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReverse;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortActivatableMovieWidget_C_StartFadeFromColor) == 0x000001, "Wrong alignment on FortActivatableMovieWidget_C_StartFadeFromColor");
static_assert(sizeof(FortActivatableMovieWidget_C_StartFadeFromColor) == 0x000003, "Wrong size on FortActivatableMovieWidget_C_StartFadeFromColor");
static_assert(offsetof(FortActivatableMovieWidget_C_StartFadeFromColor, bEnd) == 0x000000, "Member 'FortActivatableMovieWidget_C_StartFadeFromColor::bEnd' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_StartFadeFromColor, Reason) == 0x000001, "Member 'FortActivatableMovieWidget_C_StartFadeFromColor::Reason' has a wrong offset!");
static_assert(offsetof(FortActivatableMovieWidget_C_StartFadeFromColor, bReverse) == 0x000002, "Member 'FortActivatableMovieWidget_C_StartFadeFromColor::bReverse' has a wrong offset!");

// Function FortActivatableMovieWidget.FortActivatableMovieWidget_C.StartWholeFade
// 0x0001 (0x0001 - 0x0000)
struct FortActivatableMovieWidget_C_StartWholeFade final
{
public:
	bool                                          bReverse;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortActivatableMovieWidget_C_StartWholeFade) == 0x000001, "Wrong alignment on FortActivatableMovieWidget_C_StartWholeFade");
static_assert(sizeof(FortActivatableMovieWidget_C_StartWholeFade) == 0x000001, "Wrong size on FortActivatableMovieWidget_C_StartWholeFade");
static_assert(offsetof(FortActivatableMovieWidget_C_StartWholeFade, bReverse) == 0x000000, "Member 'FortActivatableMovieWidget_C_StartWholeFade::bReverse' has a wrong offset!");

}

