#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_M_Avg_Player_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x0427 (0x0428 - 0x0001)
struct Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2396;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2397;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2398;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2399;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2400;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2401;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2402;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2403;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2404;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2405;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2406;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2407;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2408;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2409;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2410;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2411;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2412;                              // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2413;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2414;                              // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2415;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2416;                              // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2417;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2418;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2419;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2420;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2421;                              // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2422;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2423;                              // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2424;                              // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2425;                              // 0x0090(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2426;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_2427;                              // 0x00A8(0x0010)(BlueprintVisible)
	TArray<int32>                                 __ArrayProperty_2428;                              // 0x00B8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2429;                              // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2430;                              // 0x00D8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2431;                              // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2432;                              // 0x00F8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2433;                              // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2434;                              // 0x0118(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2435;                               // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2436;                               // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2437;                               // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2438;                               // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2439;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2440;                               // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2441;                               // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2442;                               // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2443;                               // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2444;                               // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2445;                               // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2446;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2447;                               // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2448;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2449;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2450;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2451;                              // 0x0168(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2452;                               // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2453;                               // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2454;                               // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2455;                               // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2456;                              // 0x0188(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2457;                              // 0x0198(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2458;                               // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2459;                               // 0x01AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2460;                               // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2461;                               // 0x01B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2462;                              // 0x01B8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2463;                               // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2464;                               // 0x01CC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2465;                              // 0x01D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2466;                              // 0x01E0(0x0010)(BlueprintVisible)
	EAnimSyncMethod                               __EnumProperty_2467;                               // 0x01F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2468;                               // 0x01F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2469;                               // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_2470;                               // 0x01FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2471;                               // 0x0200(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2472;                               // 0x0204(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2473;                               // 0x0208(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2474;                               // 0x020C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2475;                               // 0x0210(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2476;                              // 0x0218(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2477;                               // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2478;                               // 0x022C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2479;                               // 0x0230(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2480;                                // 0x0234(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2481;                               // 0x0238(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2482;                                // 0x023C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2483;                              // 0x0240(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2484;                              // 0x0250(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2485;                               // 0x0260(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2486;                                // 0x0264(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2487;                               // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2488;                                // 0x026C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2489;                               // 0x0270(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2490;                                // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2491;                               // 0x0278(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2492;                              // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_2493;                             // 0x0280(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_2494;                              // 0x02AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2495;                               // 0x02B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2496;                               // 0x02B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2497;                               // 0x02B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2498;                                // 0x02B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2499;                               // 0x02BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2500;                                // 0x02C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2501;                              // 0x02C8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2502;                               // 0x02D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2503;                               // 0x02DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2504;                                // 0x02E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_2505;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_2506;                                 // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_2507;                               // 0x02F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2508;                               // 0x02F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2509;                               // 0x02FA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x5];                                      // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2510;                              // 0x0300(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_2511;                             // 0x0310(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0328(0x0060)()
	struct FAnimSubsystem                         AnimBlueprintExtension_SharedLinkedAnimLayers;     // 0x0388(0x0008)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0410(0x0018)()
};
static_assert(alignof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000428, "Wrong size on Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2396) == 0x000004, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2396' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2397) == 0x000008, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2397' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2398) == 0x00000C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2398' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2399) == 0x000010, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2399' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2400) == 0x000014, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2400' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2401) == 0x000018, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2401' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2402) == 0x00001C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2402' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2403) == 0x000020, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2403' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2404) == 0x000024, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2404' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2405) == 0x000028, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2405' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2406) == 0x00002C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2406' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2407) == 0x000030, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2407' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2408) == 0x000034, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2408' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2409) == 0x000038, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2409' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2410) == 0x00003C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2410' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2411) == 0x000040, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2411' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2412) == 0x000044, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2412' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2413) == 0x000048, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2413' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2414) == 0x00004C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2414' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2415) == 0x000050, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2415' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2416) == 0x000054, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2416' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2417) == 0x000058, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2417' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2418) == 0x00005C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2418' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2419) == 0x000060, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2419' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2420) == 0x000064, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2420' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2421) == 0x000068, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2421' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2422) == 0x00006C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2422' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2423) == 0x000070, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2423' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2424) == 0x000080, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2424' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2425) == 0x000090, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2425' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2426) == 0x0000A0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2426' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2427) == 0x0000A8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2427' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2428) == 0x0000B8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2428' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2429) == 0x0000C8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2429' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2430) == 0x0000D8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2430' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2431) == 0x0000E8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2431' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2432) == 0x0000F8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2432' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2433) == 0x000108, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2433' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2434) == 0x000118, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2434' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2435) == 0x000128, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2435' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2436) == 0x00012C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2436' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2437) == 0x000130, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2437' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2438) == 0x000134, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2438' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2439) == 0x000138, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2439' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2440) == 0x00013C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2440' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2441) == 0x000140, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2441' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2442) == 0x000144, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2442' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2443) == 0x000148, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2443' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2444) == 0x00014C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2444' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2445) == 0x000150, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2445' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2446) == 0x000154, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2446' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2447) == 0x000158, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2447' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2448) == 0x00015C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2448' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2449) == 0x000160, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2449' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2450) == 0x000164, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2450' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2451) == 0x000168, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2451' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2452) == 0x000178, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2452' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2453) == 0x00017C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2453' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2454) == 0x000180, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2454' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2455) == 0x000184, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2455' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2456) == 0x000188, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2456' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2457) == 0x000198, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2457' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2458) == 0x0001A8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2458' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2459) == 0x0001AC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2459' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2460) == 0x0001B0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2460' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2461) == 0x0001B4, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2461' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2462) == 0x0001B8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2462' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2463) == 0x0001C8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2463' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2464) == 0x0001CC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2464' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2465) == 0x0001D0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2465' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2466) == 0x0001E0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2466' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2467) == 0x0001F0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2467' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2468) == 0x0001F4, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2468' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2469) == 0x0001F8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2469' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_2470) == 0x0001FC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_2470' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2471) == 0x000200, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2471' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2472) == 0x000204, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2472' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2473) == 0x000208, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2473' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2474) == 0x00020C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2474' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2475) == 0x000210, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2475' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2476) == 0x000218, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2476' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2477) == 0x000228, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2477' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2478) == 0x00022C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2478' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2479) == 0x000230, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2479' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2480) == 0x000234, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2480' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2481) == 0x000238, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2481' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2482) == 0x00023C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2482' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2483) == 0x000240, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2483' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2484) == 0x000250, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2484' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2485) == 0x000260, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2485' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2486) == 0x000264, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2486' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2487) == 0x000268, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2487' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2488) == 0x00026C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2488' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2489) == 0x000270, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2489' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2490) == 0x000274, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2490' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_2491) == 0x000278, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_2491' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2492) == 0x00027C, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2492' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_2493) == 0x000280, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_2493' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_2494) == 0x0002AC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_2494' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2495) == 0x0002B0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2495' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_2496) == 0x0002B1, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_2496' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2497) == 0x0002B4, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2497' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2498) == 0x0002B8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2498' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2499) == 0x0002BC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2499' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2500) == 0x0002C0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2500' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2501) == 0x0002C8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2501' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2502) == 0x0002D8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2502' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_2503) == 0x0002DC, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_2503' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_2504) == 0x0002E0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_2504' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_2505) == 0x0002E8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_2505' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_2506) == 0x0002F0, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_2506' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_2507) == 0x0002F8, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_2507' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2508) == 0x0002F9, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2508' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_2509) == 0x0002FA, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_2509' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2510) == 0x000300, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2510' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_2511) == 0x000310, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_2511' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000328, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_SharedLinkedAnimLayers) == 0x000388, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_SharedLinkedAnimLayers' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000390, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000410, "Member 'Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0157 (0x0158 - 0x0001)
struct Fortnite_M_Avg_Player_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_4;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x001B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_9;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_10;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
