#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSidebarCheckbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortSidebarCheckbox.FortSidebarCheckbox_C
// 0x0030 (0x02E8 - 0x02B8)
class UFortSidebarCheckbox_C final : public UFortSidebarCheckboxWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Checked;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Unchecked;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ToggleCheckbox();
	void SetSelected(bool NewSelected);
	void Refresh();
	void ExecuteUbergraph_FortSidebarCheckbox(int32 EntryPoint);
	void Construct();
	void BP_ToggleCheckbox();
	void BndEvt__CheckButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortSidebarCheckbox_C">();
	}
	static class UFortSidebarCheckbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSidebarCheckbox_C>();
	}
};
static_assert(alignof(UFortSidebarCheckbox_C) == 0x000008, "Wrong alignment on UFortSidebarCheckbox_C");
static_assert(sizeof(UFortSidebarCheckbox_C) == 0x0002E8, "Wrong size on UFortSidebarCheckbox_C");
static_assert(offsetof(UFortSidebarCheckbox_C, UberGraphFrame) == 0x0002B8, "Member 'UFortSidebarCheckbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortSidebarCheckbox_C, Image_Checked) == 0x0002C0, "Member 'UFortSidebarCheckbox_C::Image_Checked' has a wrong offset!");
static_assert(offsetof(UFortSidebarCheckbox_C, Image_Unchecked) == 0x0002C8, "Member 'UFortSidebarCheckbox_C::Image_Unchecked' has a wrong offset!");
static_assert(offsetof(UFortSidebarCheckbox_C, bIsSelected) == 0x0002D0, "Member 'UFortSidebarCheckbox_C::bIsSelected' has a wrong offset!");
static_assert(offsetof(UFortSidebarCheckbox_C, OnClicked) == 0x0002D8, "Member 'UFortSidebarCheckbox_C::OnClicked' has a wrong offset!");

}

