#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortActivatableMovieWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortActivatableMovieWidget.FortActivatableMovieWidget_C
// 0x0038 (0x06D0 - 0x0698)
class UFortActivatableMovieWidget_C final : public UFortActivatableMovieWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WholeFade;                                         // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ColorFade;                                         // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USafeZone*                              MainSafeZone;                                      // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             TransitionSound;                                   // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_FortActivatableMovieWidget(int32 EntryPoint);
	void Finished_54C0D3BF443750D753CECD9EE06086EA();
	void Finished_67F0D773400E13ABEB8A0DB143879F1C();
	void MediaStarted();
	void PreEnded();
	void StartFadeFromColor(bool bEnd, EUFortActivatablePrePostRollStates Reason, bool bReverse);
	void StartWholeFade(bool bReverse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortActivatableMovieWidget_C">();
	}
	static class UFortActivatableMovieWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatableMovieWidget_C>();
	}
};
static_assert(alignof(UFortActivatableMovieWidget_C) == 0x000008, "Wrong alignment on UFortActivatableMovieWidget_C");
static_assert(sizeof(UFortActivatableMovieWidget_C) == 0x0006D0, "Wrong size on UFortActivatableMovieWidget_C");
static_assert(offsetof(UFortActivatableMovieWidget_C, UberGraphFrame) == 0x000698, "Member 'UFortActivatableMovieWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortActivatableMovieWidget_C, WholeFade) == 0x0006A0, "Member 'UFortActivatableMovieWidget_C::WholeFade' has a wrong offset!");
static_assert(offsetof(UFortActivatableMovieWidget_C, ColorFade) == 0x0006A8, "Member 'UFortActivatableMovieWidget_C::ColorFade' has a wrong offset!");
static_assert(offsetof(UFortActivatableMovieWidget_C, MainSafeZone) == 0x0006B0, "Member 'UFortActivatableMovieWidget_C::MainSafeZone' has a wrong offset!");
static_assert(offsetof(UFortActivatableMovieWidget_C, SafeZone_0) == 0x0006B8, "Member 'UFortActivatableMovieWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UFortActivatableMovieWidget_C, NewVar_0) == 0x0006C0, "Member 'UFortActivatableMovieWidget_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UFortActivatableMovieWidget_C, TransitionSound) == 0x0006C8, "Member 'UFortActivatableMovieWidget_C::TransitionSound' has a wrong offset!");

}

