#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Lobby_Background

#include "Basic.hpp"

#include "FrontendBackgroundData_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend_Lobby_Background.Frontend_Lobby_Background_C
// 0x0140 (0x03E0 - 0x02A0)
class AFrontend_Lobby_Background_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FadeIn_Fade_3606FDF647A6577B9DAC47B89146CD85;      // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_3606FDF647A6577B9DAC47B89146CD85; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOut_Fade_44D3B05B49031FA3891648AB32F57584;     // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOut__Direction_44D3B05B49031FA3891648AB32F57584; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeOut;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FadetoBlackFloor;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeGrid;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeGrid_Targetvalue;                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadetoBlackFloor_TargetValue;                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PresetEnvironment;                                 // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture*                               Texture;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      PreBlueMaterial;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FFrontendBackgroundData> Backgrounds;                                       // 0x0310(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class ABP_FrontendBackPlate_C*                Six_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               P_Storm_Rain_01_5_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AEmitter*                               P_Snow_Ambient_Lobby_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NS_SideWays_Volume_InFrontEnd_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   SM_Sideways_Smoke_FrontEnd_159_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   SM_Mother_Crash_BlinkingLights_01_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   SM_Sideways_Smoke_FrontEnd_0_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_1_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NiagaraActor_4_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_Setup_Basic_Background_Data_MERGED_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupGalileo_MERGED_RefProperty;               // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupSpecialEventBackgroundData_MERGED_RefProperty; // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupBasicBackgroundDataWithRenderTarget_MERGED_RefProperty; // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FrontendBackPlate_C*                Six_SetupSpecialEventBackgroundDataWithRenderTarget_MERGED_RefProperty; // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature(const class FString& PresetEnvironmentName);
	void BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature(class UTexture* BackgroundImage);
	void BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature(const struct FFrontendLobbyData& LobbyData);
	void ContinueBackgroundSetup();
	void Convert_Legacy_Frontend_Background_Data(const struct FFrontendBackgroundData& Legacy_Frontend_Background_Data, struct FFrontendLobbyData* Frontend_Lobby_Data);
	void ExecuteUbergraph_Frontend_Lobby_Background(int32 EntryPoint);
	void FadeFromBlue();
	void FadeIn__FinishedFunc();
	void FadeIn__UpdateFunc();
	void FadeOut__FinishedFunc();
	void FadeOut__UpdateFunc();
	void LoadAssets(TSoftObjectPtr<class UTexture> InTexture, TSoftObjectPtr<class UMaterialInstance> InMaterial, TSoftObjectPtr<class UMaterialInstance> InPreBlurMaterial);
	void LoadBackgroundData();
	void OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70(class UObject* Loaded);
	void OnLoaded_7B16DAE04937EECB604410A2EC352CE3(class UObject* Loaded);
	void OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99(class UObject* Loaded);
	void OnLoaded_E5F1E80A4DD36718D41FF68F137C4775(class UObject* Loaded);
	void ReceiveBeginPlay();
	void SetShowPedestalSparkles(bool Show);
	void Setup_Basic_Background_Data(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void SetupBasicBackgroundDataWithRenderTarget(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void SetupGalileo();
	void SetupSpecialEventBackgroundData(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void SetupSpecialEventBackgroundDataWithRenderTarget(bool EnableRealtimeUpdate, double InFadeGridTargetValue, double InFadeToBlackFloorTargetValue);
	void TestDynColor();
	void UpdateFade(double FadeValue, double FadeFloorToBlack, double InFadeGrid);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Frontend_Lobby_Background_C">();
	}
	static class AFrontend_Lobby_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_Lobby_Background_C>();
	}
};
static_assert(alignof(AFrontend_Lobby_Background_C) == 0x000008, "Wrong alignment on AFrontend_Lobby_Background_C");
static_assert(sizeof(AFrontend_Lobby_Background_C) == 0x0003E0, "Wrong size on AFrontend_Lobby_Background_C");
static_assert(offsetof(AFrontend_Lobby_Background_C, UberGraphFrame) == 0x0002A0, "Member 'AFrontend_Lobby_Background_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeIn_Fade_3606FDF647A6577B9DAC47B89146CD85) == 0x0002A8, "Member 'AFrontend_Lobby_Background_C::FadeIn_Fade_3606FDF647A6577B9DAC47B89146CD85' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeIn__Direction_3606FDF647A6577B9DAC47B89146CD85) == 0x0002AC, "Member 'AFrontend_Lobby_Background_C::FadeIn__Direction_3606FDF647A6577B9DAC47B89146CD85' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeIn) == 0x0002B0, "Member 'AFrontend_Lobby_Background_C::FadeIn' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeOut_Fade_44D3B05B49031FA3891648AB32F57584) == 0x0002B8, "Member 'AFrontend_Lobby_Background_C::FadeOut_Fade_44D3B05B49031FA3891648AB32F57584' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeOut__Direction_44D3B05B49031FA3891648AB32F57584) == 0x0002BC, "Member 'AFrontend_Lobby_Background_C::FadeOut__Direction_44D3B05B49031FA3891648AB32F57584' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeOut) == 0x0002C0, "Member 'AFrontend_Lobby_Background_C::FadeOut' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadetoBlackFloor) == 0x0002C8, "Member 'AFrontend_Lobby_Background_C::FadetoBlackFloor' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeGrid) == 0x0002D0, "Member 'AFrontend_Lobby_Background_C::FadeGrid' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadeGrid_Targetvalue) == 0x0002D8, "Member 'AFrontend_Lobby_Background_C::FadeGrid_Targetvalue' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, FadetoBlackFloor_TargetValue) == 0x0002E0, "Member 'AFrontend_Lobby_Background_C::FadetoBlackFloor_TargetValue' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, PresetEnvironment) == 0x0002E8, "Member 'AFrontend_Lobby_Background_C::PresetEnvironment' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Texture) == 0x0002F8, "Member 'AFrontend_Lobby_Background_C::Texture' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Material) == 0x000300, "Member 'AFrontend_Lobby_Background_C::Material' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, PreBlueMaterial) == 0x000308, "Member 'AFrontend_Lobby_Background_C::PreBlueMaterial' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Backgrounds) == 0x000310, "Member 'AFrontend_Lobby_Background_C::Backgrounds' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Six_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000360, "Member 'AFrontend_Lobby_Background_C::Six_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, P_Storm_Rain_01_5_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000368, "Member 'AFrontend_Lobby_Background_C::P_Storm_Rain_01_5_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, P_Snow_Ambient_Lobby_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000370, "Member 'AFrontend_Lobby_Background_C::P_Snow_Ambient_Lobby_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, NS_SideWays_Volume_InFrontEnd_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000378, "Member 'AFrontend_Lobby_Background_C::NS_SideWays_Volume_InFrontEnd_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, SM_Sideways_Smoke_FrontEnd_159_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000380, "Member 'AFrontend_Lobby_Background_C::SM_Sideways_Smoke_FrontEnd_159_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, SM_Mother_Crash_BlinkingLights_01_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000388, "Member 'AFrontend_Lobby_Background_C::SM_Mother_Crash_BlinkingLights_01_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, NiagaraActor_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000390, "Member 'AFrontend_Lobby_Background_C::NiagaraActor_3_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, SM_Sideways_Smoke_FrontEnd_0_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x000398, "Member 'AFrontend_Lobby_Background_C::SM_Sideways_Smoke_FrontEnd_0_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, NiagaraActor_1_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x0003A0, "Member 'AFrontend_Lobby_Background_C::NiagaraActor_1_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, NiagaraActor_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x0003A8, "Member 'AFrontend_Lobby_Background_C::NiagaraActor_2_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, NiagaraActor_4_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty) == 0x0003B0, "Member 'AFrontend_Lobby_Background_C::NiagaraActor_4_ExecuteUbergraph_Frontend_Lobby_Background_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Six_Setup_Basic_Background_Data_MERGED_RefProperty) == 0x0003B8, "Member 'AFrontend_Lobby_Background_C::Six_Setup_Basic_Background_Data_MERGED_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Six_SetupGalileo_MERGED_RefProperty) == 0x0003C0, "Member 'AFrontend_Lobby_Background_C::Six_SetupGalileo_MERGED_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Six_SetupSpecialEventBackgroundData_MERGED_RefProperty) == 0x0003C8, "Member 'AFrontend_Lobby_Background_C::Six_SetupSpecialEventBackgroundData_MERGED_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Six_SetupBasicBackgroundDataWithRenderTarget_MERGED_RefProperty) == 0x0003D0, "Member 'AFrontend_Lobby_Background_C::Six_SetupBasicBackgroundDataWithRenderTarget_MERGED_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_Background_C, Six_SetupSpecialEventBackgroundDataWithRenderTarget_MERGED_RefProperty) == 0x0003D8, "Member 'AFrontend_Lobby_Background_C::Six_SetupSpecialEventBackgroundDataWithRenderTarget_MERGED_RefProperty' has a wrong offset!");

}

