#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Lobby_Background

#include "Basic.hpp"

#include "FrontendBackgroundData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FrontendFXData_structs.hpp"


namespace SDK::Params
{

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature final
{
public:
	class FString                                 PresetEnvironmentName;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature, PresetEnvironmentName) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature::PresetEnvironmentName' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature final
{
public:
	class UTexture*                               BackgroundImage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature, BackgroundImage) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature::BackgroundImage' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature final
{
public:
	struct FFrontendLobbyData                     LobbyData;                                         // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature) == 0x000090, "Wrong size on Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature, LobbyData) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__Frontend_Lobby_Background_CMSLobbyDirector_3_K2Node_ActorBoundEvent_2_OnLobbyDataChanged__DelegateSignature::LobbyData' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.Convert Legacy Frontend Background Data
// 0x0310 (0x0310 - 0x0000)
struct Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data final
{
public:
	struct FFrontendBackgroundData                Legacy_Frontend_Background_Data;                   // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FFrontendLobbyData                     Frontend_Lobby_Data;                               // 0x0090(0x0090)(Parm, OutParm)
	TArray<struct FFrontendLobbyFXData>           ConvertedFrontendLobbyFXData;                      // 0x0120(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendFXData                        CallFunc_Array_Get_Item;                           // 0x0140(0x0090)(HasGetValueTypeHash)
	struct FFrontendLobbyFXData                   K2Node_MakeStruct_FrontendLobbyFXData;             // 0x01D0(0x0090)()
	struct FFrontendLobbyData                     K2Node_MakeStruct_FrontendLobbyData;               // 0x0260(0x0090)()
	TArray<struct FFrontendLobbyFXData>           K2Node_MakeArray_Array;                            // 0x02F0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data) == 0x000010, "Wrong alignment on Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data");
static_assert(sizeof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data) == 0x000310, "Wrong size on Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, Legacy_Frontend_Background_Data) == 0x000000, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::Legacy_Frontend_Background_Data' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, Frontend_Lobby_Data) == 0x000090, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::Frontend_Lobby_Data' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, ConvertedFrontendLobbyFXData) == 0x000120, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::ConvertedFrontendLobbyFXData' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, Temp_int_Array_Index_Variable) == 0x000130, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, CallFunc_Array_Length_ReturnValue) == 0x000134, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, CallFunc_Array_Get_Item) == 0x000140, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, K2Node_MakeStruct_FrontendLobbyFXData) == 0x0001D0, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::K2Node_MakeStruct_FrontendLobbyFXData' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, K2Node_MakeStruct_FrontendLobbyData) == 0x000260, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::K2Node_MakeStruct_FrontendLobbyData' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, K2Node_MakeArray_Array) == 0x0002F0, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, Temp_int_Loop_Counter_Variable) == 0x000300, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, CallFunc_Less_IntInt_ReturnValue) == 0x000304, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data, CallFunc_Add_IntInt_ReturnValue) == 0x000308, "Member 'Frontend_Lobby_Background_C_Convert_Legacy_Frontend_Background_Data::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.ExecuteUbergraph_Frontend_Lobby_Background
// 0x0430 (0x0430 - 0x0000)
struct Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendLobbyData                     K2Node_ActorBoundEvent_LobbyData;                  // 0x0008(0x0090)()
	class UObject*                                Temp_object_Variable;                              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ActorBoundEvent_PresetEnvironmentName;      // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_ActorBoundEvent_BackgroundImage;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_1;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x013C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0160(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                K2Node_CustomEvent_InTexture;                      // 0x0170(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       K2Node_CustomEvent_InMaterial;                     // 0x0198(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       K2Node_CustomEvent_InPreBlurMaterial;              // 0x01C0(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0208(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendBackgroundData                CallFunc_Map_Find_Value;                           // 0x0220(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendBackgroundData                CallFunc_Map_Find_Value_1;                         // 0x02B8(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrontendFXData                        CallFunc_Array_Get_Item;                           // 0x0350(0x0090)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x03E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E6[0x2];                                      // 0x03E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_FadeGrid_ImplicitCast;          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_FadetoBlackFloor_ImplicitCast;  // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateFade_FadeValue_ImplicitCast;        // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateFade_FadeValue_ImplicitCast_1;      // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Setup_Basic_Background_Data_InFadeGridTargetValue_ImplicitCast; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Setup_Basic_Background_Data_InFadeToBlackFloorTargetValue_ImplicitCast; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background) == 0x000010, "Wrong alignment on Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background");
static_assert(sizeof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background) == 0x000430, "Wrong size on Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, EntryPoint) == 0x000000, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::EntryPoint' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_LobbyData) == 0x000008, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_LobbyData' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_object_Variable) == 0x000098, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_AsMaterial_Instance) == 0x0000A0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_Loaded) == 0x0000B0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_object_Variable_1) == 0x0000B8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_AsNiagara_System) == 0x0000C0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_GetScalarParameterValue_ReturnValue) == 0x0000CC, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_PresetEnvironmentName) == 0x0000D0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_PresetEnvironmentName' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_BackgroundImage) == 0x0000E0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_BackgroundImage' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_Loaded_1) == 0x0000E8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_object_Variable_2) == 0x0000F0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_SwitchString_CmpSuccess) == 0x0000F8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_AsMaterial_Instance_1) == 0x000100, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_AsMaterial_Instance_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_Loaded_2) == 0x000110, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_object_Variable_3) == 0x000118, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_AsTexture) == 0x000120, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_Loaded_3) == 0x000130, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000138, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_MakeColor_ReturnValue) == 0x00013C, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000150, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000158, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CreateDelegate_OutputDelegate) == 0x000160, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_InTexture) == 0x000170, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_InTexture' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_InMaterial) == 0x000198, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_InMaterial' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CustomEvent_InPreBlurMaterial) == 0x0001C0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CustomEvent_InPreBlurMaterial' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F4, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_int_Array_Index_Variable) == 0x000200, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_bool_Variable) == 0x000204, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Not_PreBool_ReturnValue) == 0x000205, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_CreateDelegate_OutputDelegate_3) == 0x000208, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, Temp_int_Loop_Counter_Variable) == 0x000214, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Add_IntInt_ReturnValue) == 0x000218, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Map_Find_Value) == 0x000220, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Map_Find_ReturnValue) == 0x0002B0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Map_Find_Value_1) == 0x0002B8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Map_Find_ReturnValue_1) == 0x000348, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Array_Get_Item) == 0x000350, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Array_Length_ReturnValue) == 0x0003E0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Less_IntInt_ReturnValue) == 0x0003E4, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0003E5, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003E8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003F0, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_VariableSet_FadeGrid_ImplicitCast) == 0x0003F8, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_VariableSet_FadeGrid_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_VariableSet_FadetoBlackFloor_ImplicitCast) == 0x000400, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_VariableSet_FadetoBlackFloor_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_UpdateFade_FadeValue_ImplicitCast) == 0x000408, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_UpdateFade_FadeValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_UpdateFade_FadeValue_ImplicitCast_1) == 0x000410, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_UpdateFade_FadeValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Setup_Basic_Background_Data_InFadeGridTargetValue_ImplicitCast) == 0x000418, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Setup_Basic_Background_Data_InFadeGridTargetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_Setup_Basic_Background_Data_InFadeToBlackFloorTargetValue_ImplicitCast) == 0x000420, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_Setup_Basic_Background_Data_InFadeToBlackFloorTargetValue_ImplicitCast' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.LoadAssets
// 0x0078 (0x0078 - 0x0000)
struct Frontend_Lobby_Background_C_LoadAssets final
{
public:
	TSoftObjectPtr<class UTexture>                InTexture;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       InMaterial;                                        // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       InPreBlurMaterial;                                 // 0x0050(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_LoadAssets) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_LoadAssets");
static_assert(sizeof(Frontend_Lobby_Background_C_LoadAssets) == 0x000078, "Wrong size on Frontend_Lobby_Background_C_LoadAssets");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadAssets, InTexture) == 0x000000, "Member 'Frontend_Lobby_Background_C_LoadAssets::InTexture' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadAssets, InMaterial) == 0x000028, "Member 'Frontend_Lobby_Background_C_LoadAssets::InMaterial' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadAssets, InPreBlurMaterial) == 0x000050, "Member 'Frontend_Lobby_Background_C_LoadAssets::InPreBlurMaterial' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.LoadBackgroundData
// 0x0110 (0x0110 - 0x0000)
struct Frontend_Lobby_Background_C_LoadBackgroundData final
{
public:
	TSoftObjectPtr<class UMaterialInstance>       LocalMaterialPreBlur;                              // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       LocalMaterial;                                     // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                LocalTexture;                                      // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFrontendBackgroundData                CallFunc_Map_Find_Value;                           // 0x0078(0x0090)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_LoadBackgroundData) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_LoadBackgroundData");
static_assert(sizeof(Frontend_Lobby_Background_C_LoadBackgroundData) == 0x000110, "Wrong size on Frontend_Lobby_Background_C_LoadBackgroundData");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadBackgroundData, LocalMaterialPreBlur) == 0x000000, "Member 'Frontend_Lobby_Background_C_LoadBackgroundData::LocalMaterialPreBlur' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadBackgroundData, LocalMaterial) == 0x000028, "Member 'Frontend_Lobby_Background_C_LoadBackgroundData::LocalMaterial' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadBackgroundData, LocalTexture) == 0x000050, "Member 'Frontend_Lobby_Background_C_LoadBackgroundData::LocalTexture' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadBackgroundData, CallFunc_Map_Find_Value) == 0x000078, "Member 'Frontend_Lobby_Background_C_LoadBackgroundData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_LoadBackgroundData, CallFunc_Map_Find_ReturnValue) == 0x000108, "Member 'Frontend_Lobby_Background_C_LoadBackgroundData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70");
static_assert(sizeof(Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70");
static_assert(offsetof(Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70, Loaded) == 0x000000, "Member 'Frontend_Lobby_Background_C_OnLoaded_1CC0D8274FA1EFC9AE28C89FDF518A70::Loaded' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.OnLoaded_7B16DAE04937EECB604410A2EC352CE3
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3");
static_assert(sizeof(Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3");
static_assert(offsetof(Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3, Loaded) == 0x000000, "Member 'Frontend_Lobby_Background_C_OnLoaded_7B16DAE04937EECB604410A2EC352CE3::Loaded' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99");
static_assert(sizeof(Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99");
static_assert(offsetof(Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99, Loaded) == 0x000000, "Member 'Frontend_Lobby_Background_C_OnLoaded_D6DC1C6545F1A19E2FFC1B9CDACD5E99::Loaded' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.OnLoaded_E5F1E80A4DD36718D41FF68F137C4775
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775");
static_assert(sizeof(Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775");
static_assert(offsetof(Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775, Loaded) == 0x000000, "Member 'Frontend_Lobby_Background_C_OnLoaded_E5F1E80A4DD36718D41FF68F137C4775::Loaded' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.SetShowPedestalSparkles
// 0x0038 (0x0038 - 0x0000)
struct Frontend_Lobby_Background_C_SetShowPedestalSparkles final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATeamMemberPedestal_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATeamMemberPedestal_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_SetShowPedestalSparkles) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_SetShowPedestalSparkles");
static_assert(sizeof(Frontend_Lobby_Background_C_SetShowPedestalSparkles) == 0x000038, "Wrong size on Frontend_Lobby_Background_C_SetShowPedestalSparkles");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, Show) == 0x000000, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::Show' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Array_Get_Item) == 0x000028, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetShowPedestalSparkles, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Frontend_Lobby_Background_C_SetShowPedestalSparkles::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.Setup Basic Background Data
// 0x0018 (0x0018 - 0x0000)
struct Frontend_Lobby_Background_C_Setup_Basic_Background_Data final
{
public:
	bool                                          EnableRealtimeUpdate;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFadeGridTargetValue;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InFadeToBlackFloorTargetValue;                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_Setup_Basic_Background_Data) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_Setup_Basic_Background_Data");
static_assert(sizeof(Frontend_Lobby_Background_C_Setup_Basic_Background_Data) == 0x000018, "Wrong size on Frontend_Lobby_Background_C_Setup_Basic_Background_Data");
static_assert(offsetof(Frontend_Lobby_Background_C_Setup_Basic_Background_Data, EnableRealtimeUpdate) == 0x000000, "Member 'Frontend_Lobby_Background_C_Setup_Basic_Background_Data::EnableRealtimeUpdate' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Setup_Basic_Background_Data, InFadeGridTargetValue) == 0x000008, "Member 'Frontend_Lobby_Background_C_Setup_Basic_Background_Data::InFadeGridTargetValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_Setup_Basic_Background_Data, InFadeToBlackFloorTargetValue) == 0x000010, "Member 'Frontend_Lobby_Background_C_Setup_Basic_Background_Data::InFadeToBlackFloorTargetValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.SetupBasicBackgroundDataWithRenderTarget
// 0x0018 (0x0018 - 0x0000)
struct Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget final
{
public:
	bool                                          EnableRealtimeUpdate;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFadeGridTargetValue;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InFadeToBlackFloorTargetValue;                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget");
static_assert(sizeof(Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget) == 0x000018, "Wrong size on Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget, EnableRealtimeUpdate) == 0x000000, "Member 'Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget::EnableRealtimeUpdate' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget, InFadeGridTargetValue) == 0x000008, "Member 'Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget::InFadeGridTargetValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget, InFadeToBlackFloorTargetValue) == 0x000010, "Member 'Frontend_Lobby_Background_C_SetupBasicBackgroundDataWithRenderTarget::InFadeToBlackFloorTargetValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.SetupSpecialEventBackgroundData
// 0x0018 (0x0018 - 0x0000)
struct Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData final
{
public:
	bool                                          EnableRealtimeUpdate;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFadeGridTargetValue;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InFadeToBlackFloorTargetValue;                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData");
static_assert(sizeof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData) == 0x000018, "Wrong size on Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData, EnableRealtimeUpdate) == 0x000000, "Member 'Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData::EnableRealtimeUpdate' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData, InFadeGridTargetValue) == 0x000008, "Member 'Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData::InFadeGridTargetValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData, InFadeToBlackFloorTargetValue) == 0x000010, "Member 'Frontend_Lobby_Background_C_SetupSpecialEventBackgroundData::InFadeToBlackFloorTargetValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.SetupSpecialEventBackgroundDataWithRenderTarget
// 0x0018 (0x0018 - 0x0000)
struct Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget final
{
public:
	bool                                          EnableRealtimeUpdate;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFadeGridTargetValue;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InFadeToBlackFloorTargetValue;                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget");
static_assert(sizeof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget) == 0x000018, "Wrong size on Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget, EnableRealtimeUpdate) == 0x000000, "Member 'Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget::EnableRealtimeUpdate' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget, InFadeGridTargetValue) == 0x000008, "Member 'Frontend_Lobby_Background_C_SetupSpecialEventBackgroundDataWithRenderTarget::InFadeGridTargetValue' has a wrong offset!");
