#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HidingProp_Hide

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HidingProp_Hide.GA_Athena_HidingProp_Hide_C
// 0x0170 (0x0C98 - 0x0B28)
class UGA_Athena_HidingProp_Hide_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AB_HidingProp_C*                        HidingProp;                                        // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Enter_Anim_Montage;                                // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Wobble;                                         // 0x0B48(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4C[0x4];                                      // 0x0B4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ExitBlockShootDelay;                               // 0x0B50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_Quest;                                          // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_PlayerOwned;                                    // 0x0B98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         RustleMinDelay;                                    // 0x0BB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         RustleMaxDelay;                                    // 0x0BE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerController*                  PlayerController;                                  // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HidingInPropTag;                                   // 0x0C10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GettingInPropTag;                                  // 0x0C30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CurieBurningTag;                                   // 0x0C50(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowCosmetics;                                    // 0x0C54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C55[0x3];                                      // 0x0C55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DisallowCosmeticsTag;                              // 0x0C58(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LandedOnProp;                                      // 0x0C5C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5D[0x3];                                      // 0x0C5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LockOnTimer;                                       // 0x0C60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HideLocationForwardVectorWorldPos;                 // 0x0C68(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HideLocationForwardVectorWorldRot;                 // 0x0C80(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Added_1D4A49874AC422976CAC2C9155DDA736();
	void Added_35C56E354FE08855A837E0BDFB150F20();
	void Added_CD24BC554E955808A88A5B809807A94E();
	void Added_D329D9924DF9DF1B79D0738C6CB8EBA1();
	void Added_D54881A34BC79E85BE563BA220DD924D();
	void Added_E60D990647FDAB06895E738C7A2BAE7E();
	void Added_EAA3FC0B4E27CDA8B4F3289DF7EA9E90();
	void Added_F049BFC743FE176042ECD98641AFE2B9();
	void Cancelled_75B60D4B43DAA553E4C21EA3D2E3AD03(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_75B60D4B43DAA553E4C21EA3D2E3AD03(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void End();
	void Event_LockOnProp();
	void EventReceived_8C4C6D7442A0B18F41B269995833ED85(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Athena_HidingProp_Hide(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinished_35C1D63345930DB9A5BDB7BED8B808BF(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);
	void OnTimedOut_8010F4C64221E8F497C6559558420C32();
	void OnTimedOut_859E251740F1C46B914344A9FC343B19();
	void OnTimedOutAndDestinationReached_8010F4C64221E8F497C6559558420C32();
	void OnTimedOutAndDestinationReached_859E251740F1C46B914344A9FC343B19();
	void RustleLoop();
	void SetAvatarHiddenInGame(bool New_Hidden);
	void SetCosmeticsAllowed(bool Allowed);
	void Triggered_75B60D4B43DAA553E4C21EA3D2E3AD03(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void WobbleHidingProp(double NormalizedMagnitude);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HidingProp_Hide_C">();
	}
	static class UGA_Athena_HidingProp_Hide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HidingProp_Hide_C>();
	}
};
static_assert(alignof(UGA_Athena_HidingProp_Hide_C) == 0x000008, "Wrong alignment on UGA_Athena_HidingProp_Hide_C");
static_assert(sizeof(UGA_Athena_HidingProp_Hide_C) == 0x000C98, "Wrong size on UGA_Athena_HidingProp_Hide_C");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, UberGraphFrame) == 0x000B28, "Member 'UGA_Athena_HidingProp_Hide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, PlayerPawn) == 0x000B30, "Member 'UGA_Athena_HidingProp_Hide_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, HidingProp) == 0x000B38, "Member 'UGA_Athena_HidingProp_Hide_C::HidingProp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, Enter_Anim_Montage) == 0x000B40, "Member 'UGA_Athena_HidingProp_Hide_C::Enter_Anim_Montage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, GC_Wobble) == 0x000B48, "Member 'UGA_Athena_HidingProp_Hide_C::GC_Wobble' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, ExitBlockShootDelay) == 0x000B50, "Member 'UGA_Athena_HidingProp_Hide_C::ExitBlockShootDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, TC_Quest) == 0x000B78, "Member 'UGA_Athena_HidingProp_Hide_C::TC_Quest' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, TC_PlayerOwned) == 0x000B98, "Member 'UGA_Athena_HidingProp_Hide_C::TC_PlayerOwned' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, RustleMinDelay) == 0x000BB8, "Member 'UGA_Athena_HidingProp_Hide_C::RustleMinDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, RustleMaxDelay) == 0x000BE0, "Member 'UGA_Athena_HidingProp_Hide_C::RustleMaxDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, PlayerController) == 0x000C08, "Member 'UGA_Athena_HidingProp_Hide_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, HidingInPropTag) == 0x000C10, "Member 'UGA_Athena_HidingProp_Hide_C::HidingInPropTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, GettingInPropTag) == 0x000C30, "Member 'UGA_Athena_HidingProp_Hide_C::GettingInPropTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, CurieBurningTag) == 0x000C50, "Member 'UGA_Athena_HidingProp_Hide_C::CurieBurningTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, AllowCosmetics) == 0x000C54, "Member 'UGA_Athena_HidingProp_Hide_C::AllowCosmetics' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, DisallowCosmeticsTag) == 0x000C58, "Member 'UGA_Athena_HidingProp_Hide_C::DisallowCosmeticsTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, LandedOnProp) == 0x000C5C, "Member 'UGA_Athena_HidingProp_Hide_C::LandedOnProp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, LockOnTimer) == 0x000C60, "Member 'UGA_Athena_HidingProp_Hide_C::LockOnTimer' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, HideLocationForwardVectorWorldPos) == 0x000C68, "Member 'UGA_Athena_HidingProp_Hide_C::HideLocationForwardVectorWorldPos' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, HideLocationForwardVectorWorldRot) == 0x000C80, "Member 'UGA_Athena_HidingProp_Hide_C::HideLocationForwardVectorWorldRot' has a wrong offset!");

}

