#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Action_Sprint_GrindRail

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C
// 0x0040 (0x0B98 - 0x0B58)
class UGA_Action_Sprint_GrindRail_C final : public UFortGameplayAbility_Action
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   Player;                                            // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BlockingTags;                                      // 0x0B68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_GrindingComponent_C*                GrindingComponent;                                 // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldReplicate;                                   // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAuthority;                                      // 0x0B91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Action_Sprint_GrindRail(int32 EntryPoint);
	void FailedToActivatePassiveAbility(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnPress_BBDAB9B94E9778E3575BD1A1551EA10E(float TimeWaited);
	void OnPress_EB1E0A904B5B510E2C8590AD3B367EDD(float TimeWaited);
	void OnRelease_5B08467A452F5716E7C96290186D3E19(float TimeHeld);
	void OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2(float TimeHeld);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Action_Sprint_GrindRail_C">();
	}
	static class UGA_Action_Sprint_GrindRail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Action_Sprint_GrindRail_C>();
	}
};
static_assert(alignof(UGA_Action_Sprint_GrindRail_C) == 0x000008, "Wrong alignment on UGA_Action_Sprint_GrindRail_C");
static_assert(sizeof(UGA_Action_Sprint_GrindRail_C) == 0x000B98, "Wrong size on UGA_Action_Sprint_GrindRail_C");
static_assert(offsetof(UGA_Action_Sprint_GrindRail_C, UberGraphFrame) == 0x000B58, "Member 'UGA_Action_Sprint_GrindRail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Action_Sprint_GrindRail_C, Player) == 0x000B60, "Member 'UGA_Action_Sprint_GrindRail_C::Player' has a wrong offset!");
static_assert(offsetof(UGA_Action_Sprint_GrindRail_C, BlockingTags) == 0x000B68, "Member 'UGA_Action_Sprint_GrindRail_C::BlockingTags' has a wrong offset!");
static_assert(offsetof(UGA_Action_Sprint_GrindRail_C, GrindingComponent) == 0x000B88, "Member 'UGA_Action_Sprint_GrindRail_C::GrindingComponent' has a wrong offset!");
static_assert(offsetof(UGA_Action_Sprint_GrindRail_C, ShouldReplicate) == 0x000B90, "Member 'UGA_Action_Sprint_GrindRail_C::ShouldReplicate' has a wrong offset!");
static_assert(offsetof(UGA_Action_Sprint_GrindRail_C, HasAuthority) == 0x000B91, "Member 'UGA_Action_Sprint_GrindRail_C::HasAuthority' has a wrong offset!");

}

