#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TillLandFallDamageImmunity_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_TillLandFallDamageImmunity_Parent.GA_Athena_TillLandFallDamageImmunity_Parent_C
// 0x0070 (0x0B98 - 0x0B28)
class UGA_Athena_TillLandFallDamageImmunity_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_FallDamageImmunity;                             // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_FallDamageImmunity;                            // 0x0B38(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Delay_PostLand;                                    // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_SurfaceSwimming;                               // 0x0B48(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_Sliding;                                       // 0x0B4C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_IgnoreApplication;                              // 0x0B50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_InVehicle;                                     // 0x0B70(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B74[0x4];                                      // 0x0B74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay_WaterSwimBind;                               // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyInAirOnly;                                    // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B81[0x3];                                      // 0x0B81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TagIsRiding;                                       // 0x0B84(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAbilityTask_WaitGameplayTagAdded*> WaitTagAsyncTasks;                                 // 0x0B88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Added_052C8416489756AFAF2C5391148ABB52();
	void Added_1195BCDD4C66168D5746C2BD02970859();
	void Added_15DBA1504E74C72F22BBCBAD8E3CD31E();
	void Added_3DBE819D4ED6A0A0909A7690321F9B09();
	void CallEnd();
	void ExecuteUbergraph_GA_Athena_TillLandFallDamageImmunity_Parent(int32 EntryPoint);
	void FailedToActivatePassiveAbility(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void PawnLanded(const struct FHitResult& Hit);
	void SetUpBinds();
	void SetUpWaits();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_TillLandFallDamageImmunity_Parent_C">();
	}
	static class UGA_Athena_TillLandFallDamageImmunity_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_TillLandFallDamageImmunity_Parent_C>();
	}
};
static_assert(alignof(UGA_Athena_TillLandFallDamageImmunity_Parent_C) == 0x000008, "Wrong alignment on UGA_Athena_TillLandFallDamageImmunity_Parent_C");
static_assert(sizeof(UGA_Athena_TillLandFallDamageImmunity_Parent_C) == 0x000B98, "Wrong size on UGA_Athena_TillLandFallDamageImmunity_Parent_C");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, UberGraphFrame) == 0x000B28, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, GE_FallDamageImmunity) == 0x000B30, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::GE_FallDamageImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, GEH_FallDamageImmunity) == 0x000B38, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::GEH_FallDamageImmunity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Delay_PostLand) == 0x000B40, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Delay_PostLand' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Tag_SurfaceSwimming) == 0x000B48, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Tag_SurfaceSwimming' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Tag_Sliding) == 0x000B4C, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Tag_Sliding' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, TC_IgnoreApplication) == 0x000B50, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::TC_IgnoreApplication' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Tag_InVehicle) == 0x000B70, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Tag_InVehicle' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, Delay_WaterSwimBind) == 0x000B78, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::Delay_WaterSwimBind' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, ApplyInAirOnly) == 0x000B80, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::ApplyInAirOnly' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, TagIsRiding) == 0x000B84, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::TagIsRiding' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TillLandFallDamageImmunity_Parent_C, WaitTagAsyncTasks) == 0x000B88, "Member 'UGA_Athena_TillLandFallDamageImmunity_Parent_C::WaitTagAsyncTasks' has a wrong offset!");

}

