#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_SCMachine_Passive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C
// 0x0058 (0x0B80 - 0x0B28)
class UGA_Athena_SCMachine_Passive_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnZOffset;                                      // 0x0B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BlockChipSpawnTag;                                 // 0x0B50(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DropRebootCards;                                   // 0x0B58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Check_Resurrection_Active(bool* bEnabled);
	void CheckPlayerChipSpawnEnabled(bool* IsChipSpawnEnabled);
	void ExecuteUbergraph_GA_Athena_SCMachine_Passive(int32 EntryPoint);
	void HandleOnFortPlayerDied(class AFortPlayerPawnAthena* FortPlayerPawnAthena);
	void K2_ActivateAbility();
	void SaveOutPlayer();
	void Spawn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_SCMachine_Passive_C">();
	}
	static class UGA_Athena_SCMachine_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_SCMachine_Passive_C>();
	}
};
static_assert(alignof(UGA_Athena_SCMachine_Passive_C) == 0x000008, "Wrong alignment on UGA_Athena_SCMachine_Passive_C");
static_assert(sizeof(UGA_Athena_SCMachine_Passive_C) == 0x000B80, "Wrong size on UGA_Athena_SCMachine_Passive_C");
static_assert(offsetof(UGA_Athena_SCMachine_Passive_C, UberGraphFrame) == 0x000B28, "Member 'UGA_Athena_SCMachine_Passive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SCMachine_Passive_C, PlayerPawn) == 0x000B30, "Member 'UGA_Athena_SCMachine_Passive_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SCMachine_Passive_C, SpawnZOffset) == 0x000B38, "Member 'UGA_Athena_SCMachine_Passive_C::SpawnZOffset' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SCMachine_Passive_C, BlockChipSpawnTag) == 0x000B50, "Member 'UGA_Athena_SCMachine_Passive_C::BlockChipSpawnTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SCMachine_Passive_C, DropRebootCards) == 0x000B58, "Member 'UGA_Athena_SCMachine_Passive_C::DropRebootCards' has a wrong offset!");

}

