#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Action_ADS_GrindRail

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Action_ADS_GrindRail.GA_Action_ADS_GrindRail_C
// 0x0038 (0x0B90 - 0x0B58)
class UGA_Action_ADS_GrindRail_C final : public UFortGameplayAbility_Action
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   Player;                                            // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BlockingTags;                                      // 0x0B68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_GrindingComponent_C*                GrindingComponent;                                 // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Action_ADS_GrindRail(int32 EntryPoint);
	void FailedToActivatePassiveAbility(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnPress_01A3E1CF477913F9711F7E90D15EAD37(float TimeWaited);
	void OnPress_C7DC18CB4B236FAE1117CE939CBC57AB(float TimeWaited);
	void OnRelease_E541412844A2A5A5D2D062A55EEC6C29(float TimeHeld);
	void OnRelease_F2AFF35A4A031EDEC04ECF9706FAA922(float TimeHeld);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Action_ADS_GrindRail_C">();
	}
	static class UGA_Action_ADS_GrindRail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Action_ADS_GrindRail_C>();
	}
};
static_assert(alignof(UGA_Action_ADS_GrindRail_C) == 0x000008, "Wrong alignment on UGA_Action_ADS_GrindRail_C");
static_assert(sizeof(UGA_Action_ADS_GrindRail_C) == 0x000B90, "Wrong size on UGA_Action_ADS_GrindRail_C");
static_assert(offsetof(UGA_Action_ADS_GrindRail_C, UberGraphFrame) == 0x000B58, "Member 'UGA_Action_ADS_GrindRail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Action_ADS_GrindRail_C, Player) == 0x000B60, "Member 'UGA_Action_ADS_GrindRail_C::Player' has a wrong offset!");
static_assert(offsetof(UGA_Action_ADS_GrindRail_C, BlockingTags) == 0x000B68, "Member 'UGA_Action_ADS_GrindRail_C::BlockingTags' has a wrong offset!");
static_assert(offsetof(UGA_Action_ADS_GrindRail_C, GrindingComponent) == 0x000B88, "Member 'UGA_Action_ADS_GrindRail_C::GrindingComponent' has a wrong offset!");

}

