#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Action_Sprint_GrindRail

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.ExecuteUbergraph_GA_Action_Sprint_GrindRail
// 0x0140 (0x0140 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputPress*            CallFunc_WaitInputPress_ReturnValue_1;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0080(0x0048)(ContainsInstancedReference)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GrindingComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x00E8(0x0048)(ContainsInstancedReference)
	float                                         Temp_real_Variable_3;                              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited_1;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail) == 0x000008, "Wrong alignment on GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail) == 0x000140, "Wrong size on GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, EntryPoint) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CustomEvent_TimeHeld_1) == 0x000014, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CustomEvent_TimeHeld_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, Temp_real_Variable) == 0x000018, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CustomEvent_TimeWaited) == 0x000038, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, Temp_real_Variable_1) == 0x00003C, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_WaitInputPress_ReturnValue) == 0x000040, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_WaitInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CustomEvent_TimeHeld) == 0x000058, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, Temp_real_Variable_2) == 0x00005C, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_WaitInputRelease_ReturnValue_1) == 0x000060, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_WaitInputRelease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_Event_bWasCancelled) == 0x000069, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CreateDelegate_OutputDelegate_3) == 0x00006C, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_WaitInputPress_ReturnValue_1) == 0x000078, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_WaitInputPress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_GetActorInfo_ReturnValue) == 0x000080, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000C8, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_IsValid_ReturnValue_3) == 0x0000D1, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D8, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_IsValid_ReturnValue_4) == 0x0000E0, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_Event_ActorInfo) == 0x0000E8, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, Temp_real_Variable_3) == 0x000130, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, K2Node_CustomEvent_TimeWaited_1) == 0x000134, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::K2Node_CustomEvent_TimeWaited_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000138, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_Not_PreBool_ReturnValue_1) == 0x000139, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_BooleanAND_ReturnValue) == 0x00013A, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_K2_HasAuthority_ReturnValue) == 0x00013B, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail, CallFunc_BooleanOR_ReturnValue) == 0x00013C, "Member 'GA_Action_Sprint_GrindRail_C_ExecuteUbergraph_GA_Action_Sprint_GrindRail::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.FailedToActivatePassiveAbility
// 0x0048 (0x0048 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility) == 0x000008, "Wrong alignment on GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility) == 0x000048, "Wrong size on GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility, ActorInfo) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_FailedToActivatePassiveAbility::ActorInfo' has a wrong offset!");

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Action_Sprint_GrindRail_C_K2_OnEndAbility");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Action_Sprint_GrindRail_C_K2_OnEndAbility");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.OnPress_BBDAB9B94E9778E3575BD1A1551EA10E
// 0x0004 (0x0004 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E) == 0x000004, "Wrong alignment on GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E) == 0x000004, "Wrong size on GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E, TimeWaited) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_OnPress_BBDAB9B94E9778E3575BD1A1551EA10E::TimeWaited' has a wrong offset!");

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.OnPress_EB1E0A904B5B510E2C8590AD3B367EDD
// 0x0004 (0x0004 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD final
{
public:
	float                                         TimeWaited;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD) == 0x000004, "Wrong alignment on GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD) == 0x000004, "Wrong size on GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD, TimeWaited) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_OnPress_EB1E0A904B5B510E2C8590AD3B367EDD::TimeWaited' has a wrong offset!");

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.OnRelease_5B08467A452F5716E7C96290186D3E19
// 0x0004 (0x0004 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19) == 0x000004, "Wrong alignment on GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19) == 0x000004, "Wrong size on GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19, TimeHeld) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_OnRelease_5B08467A452F5716E7C96290186D3E19::TimeHeld' has a wrong offset!");

// Function GA_Action_Sprint_GrindRail.GA_Action_Sprint_GrindRail_C.OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2
// 0x0004 (0x0004 - 0x0000)
struct GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2) == 0x000004, "Wrong alignment on GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2");
static_assert(sizeof(GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2) == 0x000004, "Wrong size on GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2");
static_assert(offsetof(GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2, TimeHeld) == 0x000000, "Member 'GA_Action_Sprint_GrindRail_C_OnRelease_CFE6F71C4CB50BE9AD6253AFAA0862C2::TimeHeld' has a wrong offset!");

}

