#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Player_Slide

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndAbilityClientSide
// 0x0010 (0x0010 - 0x0000)
struct GA_Athena_Player_Slide_C_EndAbilityClientSide final
{
public:
	class UCameraModifier_Athena_Sliding_C*       K2Node_DynamicCast_AsCamera_Modifier_Athena_Sliding; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_EndAbilityClientSide) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_EndAbilityClientSide");
static_assert(sizeof(GA_Athena_Player_Slide_C_EndAbilityClientSide) == 0x000010, "Wrong size on GA_Athena_Player_Slide_C_EndAbilityClientSide");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityClientSide, K2Node_DynamicCast_AsCamera_Modifier_Athena_Sliding) == 0x000000, "Member 'GA_Athena_Player_Slide_C_EndAbilityClientSide::K2Node_DynamicCast_AsCamera_Modifier_Athena_Sliding' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityClientSide, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'GA_Athena_Player_Slide_C_EndAbilityClientSide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityClientSide, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'GA_Athena_Player_Slide_C_EndAbilityClientSide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.EndAbilityServerSide
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Player_Slide_C_EndAbilityServerSide final
{
public:
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_EndAbilityServerSide) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_EndAbilityServerSide");
static_assert(sizeof(GA_Athena_Player_Slide_C_EndAbilityServerSide) == 0x000028, "Wrong size on GA_Athena_Player_Slide_C_EndAbilityServerSide");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000000, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x000008, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x000018, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_EndAbilityServerSide, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'GA_Athena_Player_Slide_C_EndAbilityServerSide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.ExecuteUbergraph_GA_Athena_Player_Slide
// 0x0338 (0x0338 - 0x0000)
struct GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLastUpdateVelocity_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0058(0x00B0)(ConstParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2;  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_3;  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character_1; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_4;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_3;                // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_5;  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_6;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_C*           K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic;   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_7;  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_CustomEvent_Pawn;                           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_8;  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortPlayerPawn* Pawn)>  K2Node_CreateDelegate_OutputDelegate;              // 0x01E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_9;  // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character_2; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_10; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character_3; // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B[0x5];                                      // 0x031B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_11; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveCameraModifier_ReturnValue;         // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide");
static_assert(sizeof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide) == 0x000338, "Wrong size on GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, EntryPoint) == 0x000000, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x000010, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000018, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsFalling_ReturnValue) == 0x000020, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetLastUpdateVelocity_ReturnValue) == 0x000028, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetLastUpdateVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000049, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_Event_bWasCancelled) == 0x00004A, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1) == 0x000050, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_Event_EventData) == 0x000058, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, Temp_bool_Has_Been_Initd_Variable) == 0x000108, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2) == 0x000110, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_3) == 0x000118, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character) == 0x000128, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character_1) == 0x000138, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_4) == 0x000148, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetValueAtLevel_ReturnValue) == 0x000150, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_2) == 0x000154, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000158, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000160, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_3) == 0x000168, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue) == 0x000170, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_AddCameraModifierForOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsServer_ReturnValue) == 0x000178, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_K2_SetTimer_ReturnValue_3) == 0x000180, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_K2_SetTimer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_5) == 0x000188, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000190, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_StartCameraShake_ReturnValue) == 0x000198, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_6) == 0x0001A0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x0001A8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_2) == 0x0001B0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic) == 0x0001B8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_3) == 0x0001C0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsServer_ReturnValue_1) == 0x0001C1, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsServer_ReturnValue_2) == 0x0001C2, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_7) == 0x0001C8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_CustomEvent_Pawn) == 0x0001D0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_4) == 0x0001D8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_8) == 0x0001E0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_CreateDelegate_OutputDelegate) == 0x0001E8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_5) == 0x0001F4, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, Temp_bool_IsClosed_Variable) == 0x0001F5, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_9) == 0x0001F8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character_2) == 0x000200, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_4) == 0x000208, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_10) == 0x000210, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_bBlockingHit) == 0x000218, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_bInitialOverlap) == 0x000219, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Time) == 0x00021C, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Distance) == 0x000220, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Location) == 0x000228, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_ImpactPoint) == 0x000240, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_Normal) == 0x000258, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_ImpactNormal) == 0x000270, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_PhysMat) == 0x000288, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitActor) == 0x000290, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitComponent) == 0x000298, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitBoneName) == 0x0002A0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_BoneName) == 0x0002A4, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_HitItem) == 0x0002A8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_ElementIndex) == 0x0002AC, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_FaceIndex) == 0x0002B0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_TraceStart) == 0x0002B8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BreakHitResult_TraceEnd) == 0x0002D0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_IsValid_ReturnValue_6) == 0x0002E8, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_MakeRotFromZ_ReturnValue) == 0x0002F0, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000308, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_AsFort_Movement_Comp_Character_3) == 0x000310, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_AsFort_Movement_Comp_Character_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, K2Node_DynamicCast_bSuccess_5) == 0x000318, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000319, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_BooleanAND_ReturnValue) == 0x00031A, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_11) == 0x000320, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x000328, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide, CallFunc_RemoveCameraModifier_ReturnValue) == 0x000330, "Member 'GA_Athena_Player_Slide_C_ExecuteUbergraph_GA_Athena_Player_Slide::CallFunc_RemoveCameraModifier_ReturnValue' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_Player_Slide_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Player_Slide_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Player_Slide_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Player_Slide_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Player_Slide_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Player_Slide_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Player_Slide_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.OnFinishedCharacterCustomization_Event_0
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0 final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0");
static_assert(sizeof(GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0) == 0x000008, "Wrong size on GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0");
static_assert(offsetof(GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0, Pawn) == 0x000000, "Member 'GA_Athena_Player_Slide_C_OnFinishedCharacterCustomization_Event_0::Pawn' has a wrong offset!");

// Function GA_Athena_Player_Slide.GA_Athena_Player_Slide_C.BuildDataRegistryResolverScope
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope final
{
public:
	TArray<class FName>                           InOutResolverScopes;                               // 0x0000(0x0010)(Parm, OutParm)
	int32                                         InOutPriority;                                     // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope) == 0x000008, "Wrong alignment on GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope");
static_assert(sizeof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope) == 0x000018, "Wrong size on GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope");
static_assert(offsetof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope, InOutResolverScopes) == 0x000000, "Member 'GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope::InOutResolverScopes' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope, InOutPriority) == 0x000010, "Member 'GA_Athena_Player_Slide_C_BuildDataRegistryResolverScope::InOutPriority' has a wrong offset!");
