#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GrindRail_Smash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GrindRail_Smash.GA_GrindRail_Smash_C
// 0x0048 (0x0B88 - 0x0B40)
class UGA_GrindRail_Smash_C final : public UFortGameplayAbility_ZiplineSmashBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         SF_IntervalSmash;                                  // 0x0B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4C[0x4];                                      // 0x0B4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SurroundingCheckTimer;                             // 0x0B50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SmashBoxExtent;                                    // 0x0B60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GrindingComponent_C*                GrindingComp;                                      // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bSmashNonPlayerBuilt;                              // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EndAsyncBreakNearbyStructuresOverlap(const TArray<class AActor*>& OverlapActors);
	void ExecuteUbergraph_GA_GrindRail_Smash(int32 EntryPoint);
	void FailedToActivatePassiveAbility(const struct FGameplayAbilityActorInfo& ActorInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void SurroundingCheck();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_GrindRail_Smash_C">();
	}
	static class UGA_GrindRail_Smash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GrindRail_Smash_C>();
	}
};
static_assert(alignof(UGA_GrindRail_Smash_C) == 0x000008, "Wrong alignment on UGA_GrindRail_Smash_C");
static_assert(sizeof(UGA_GrindRail_Smash_C) == 0x000B88, "Wrong size on UGA_GrindRail_Smash_C");
static_assert(offsetof(UGA_GrindRail_Smash_C, UberGraphFrame) == 0x000B40, "Member 'UGA_GrindRail_Smash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_GrindRail_Smash_C, SF_IntervalSmash) == 0x000B48, "Member 'UGA_GrindRail_Smash_C::SF_IntervalSmash' has a wrong offset!");
static_assert(offsetof(UGA_GrindRail_Smash_C, SurroundingCheckTimer) == 0x000B50, "Member 'UGA_GrindRail_Smash_C::SurroundingCheckTimer' has a wrong offset!");
static_assert(offsetof(UGA_GrindRail_Smash_C, PlayerPawn) == 0x000B58, "Member 'UGA_GrindRail_Smash_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_GrindRail_Smash_C, SmashBoxExtent) == 0x000B60, "Member 'UGA_GrindRail_Smash_C::SmashBoxExtent' has a wrong offset!");
static_assert(offsetof(UGA_GrindRail_Smash_C, GrindingComp) == 0x000B78, "Member 'UGA_GrindRail_Smash_C::GrindingComp' has a wrong offset!");
static_assert(offsetof(UGA_GrindRail_Smash_C, bSmashNonPlayerBuilt) == 0x000B80, "Member 'UGA_GrindRail_Smash_C::bSmashNonPlayerBuilt' has a wrong offset!");

}

