#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GrindRail_Smash

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_GrindRail_Smash.GA_GrindRail_Smash_C.EndAsyncBreakNearbyStructuresOverlap
// 0x0010 (0x0010 - 0x0000)
struct GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap final
{
public:
	TArray<class AActor*>                         OverlapActors;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap) == 0x000008, "Wrong alignment on GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap");
static_assert(sizeof(GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap) == 0x000010, "Wrong size on GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap");
static_assert(offsetof(GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap, OverlapActors) == 0x000000, "Member 'GA_GrindRail_Smash_C_EndAsyncBreakNearbyStructuresOverlap::OverlapActors' has a wrong offset!");

// Function GA_GrindRail_Smash.GA_GrindRail_Smash_C.ExecuteUbergraph_GA_GrindRail_Smash
// 0x01C0 (0x01C0 - 0x0000)
struct GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0068(0x0048)(ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_Event_OverlapActors;                        // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABGA_GrindRail_C*                       K2Node_DynamicCast_AsBGA_Grind_Rail;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerBuilt_ReturnValue;                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaSupplyDropBalloon*           K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon; // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeldObjectComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue_1; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GrindingComponent_C*                CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash) == 0x000008, "Wrong alignment on GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash");
static_assert(sizeof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash) == 0x0001C0, "Wrong size on GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, EntryPoint) == 0x000000, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_IsServer_ReturnValue) == 0x000018, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_Event_bWasCancelled) == 0x000019, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000030, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_MakeArray_Array) == 0x000058, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_Event_ActorInfo) == 0x000068, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_MakeArray_Array_1) == 0x0000B0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_Event_OverlapActors) == 0x0000C0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_Event_OverlapActors' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_AsBGA_Grind_Rail) == 0x0000E8, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_AsBGA_Grind_Rail' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_AsBuilding_Actor) == 0x0000F8, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000108, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000110, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000120, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Not_PreBool_ReturnValue) == 0x000121, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000122, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000128, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000138, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_BooleanAND_ReturnValue) == 0x000139, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_IsPlayerBuilt_ReturnValue) == 0x00013A, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_IsPlayerBuilt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Not_PreBool_ReturnValue_1) == 0x00013B, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon) == 0x000140, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_AsFort_Athena_Supply_Drop_Balloon' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_BooleanAND_ReturnValue_1) == 0x000149, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetComponentByClass_ReturnValue) == 0x000150, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetController_ReturnValue) == 0x000160, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000168, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x00016C, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetConsoleVariableFloatValue_ReturnValue_1) == 0x000170, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetConsoleVariableFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_MakeVector_ReturnValue) == 0x000178, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_BooleanOR_ReturnValue) == 0x000190, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000198, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001A0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_BooleanAND_ReturnValue_2) == 0x0001A1, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_MakeVector_X_ImplicitCast) == 0x0001A8, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_MakeVector_Y_ImplicitCast) == 0x0001B0, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash, CallFunc_MakeVector_Z_ImplicitCast) == 0x0001B8, "Member 'GA_GrindRail_Smash_C_ExecuteUbergraph_GA_GrindRail_Smash::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function GA_GrindRail_Smash.GA_GrindRail_Smash_C.FailedToActivatePassiveAbility
// 0x0048 (0x0048 - 0x0000)
struct GA_GrindRail_Smash_C_FailedToActivatePassiveAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(GA_GrindRail_Smash_C_FailedToActivatePassiveAbility) == 0x000008, "Wrong alignment on GA_GrindRail_Smash_C_FailedToActivatePassiveAbility");
static_assert(sizeof(GA_GrindRail_Smash_C_FailedToActivatePassiveAbility) == 0x000048, "Wrong size on GA_GrindRail_Smash_C_FailedToActivatePassiveAbility");
static_assert(offsetof(GA_GrindRail_Smash_C_FailedToActivatePassiveAbility, ActorInfo) == 0x000000, "Member 'GA_GrindRail_Smash_C_FailedToActivatePassiveAbility::ActorInfo' has a wrong offset!");

// Function GA_GrindRail_Smash.GA_GrindRail_Smash_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_GrindRail_Smash_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GrindRail_Smash_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_GrindRail_Smash_C_K2_OnEndAbility");
static_assert(sizeof(GA_GrindRail_Smash_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_GrindRail_Smash_C_K2_OnEndAbility");
static_assert(offsetof(GA_GrindRail_Smash_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_GrindRail_Smash_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

