#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_AthenaDBNO

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_AthenaDBNO.GAB_AthenaDBNO_C
// 0x01B8 (0x0CE0 - 0x0B28)
class UGAB_AthenaDBNO_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           DeathMontage;                                      // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeathHitDirection;                                 // 0x0B38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             DeathHitResult;                                    // 0x0B50(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0C30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GameplayStatusAfflicted;                           // 0x0C50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           DeathMontageSkydive;                               // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            DBNOBleedGEHandle;                                 // 0x0C78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   HolsterId;                                         // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C84[0x4];                                      // 0x0C84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           DeathMontageSwimming;                              // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  FortPlayerPawn;                                    // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DBNOStart_GE_Class;                                // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ImprovedDBNO;                                      // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA1[0x7];                                      // 0x0CA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Old_DBNO_Block_Tags;                               // 0x0CA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            GE_Handle__Health_Bonus;                           // 0x0CC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TenacityAmount;                                    // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETenacityType                                 TenacityType;                                      // 0x0CD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_Health_Bonus(struct FActiveGameplayEffectHandle* EffectHandle);
	void ApplyBleeding(struct FActiveGameplayEffectHandle* EffectHandle);
	void DropHeldObjects();
	void ExecuteUbergraph_GAB_AthenaDBNO(int32 EntryPoint);
	void Get_Custom_Tenacity(double* Tenacity);
	class UAnimMontage* Get_DBNO_Montage();
	void Get_Initial_Heal_Amount(double* Health);
	void Get_Max_Health_Tenacity(double* Tenacity);
	void InitializeDeathHitDirection(const struct FGameplayEventData& EventHitData);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_F0F6785443BD2E74F5591884CB19F35F();
	void OnCancelled_F0F6785443BD2E74F5591884CB19F35F();
	void OnCompleted_F0F6785443BD2E74F5591884CB19F35F();
	void OnInterrupted_F0F6785443BD2E74F5591884CB19F35F();
	void OnStateEnded_C85094F843D5075FE4872C95AFC5D6B6();
	void OnStateInterrupted_C85094F843D5075FE4872C95AFC5D6B6();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_AthenaDBNO_C">();
	}
	static class UGAB_AthenaDBNO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_AthenaDBNO_C>();
	}
};
static_assert(alignof(UGAB_AthenaDBNO_C) == 0x000008, "Wrong alignment on UGAB_AthenaDBNO_C");
static_assert(sizeof(UGAB_AthenaDBNO_C) == 0x000CE0, "Wrong size on UGAB_AthenaDBNO_C");
static_assert(offsetof(UGAB_AthenaDBNO_C, UberGraphFrame) == 0x000B28, "Member 'UGAB_AthenaDBNO_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DeathMontage) == 0x000B30, "Member 'UGAB_AthenaDBNO_C::DeathMontage' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DeathHitDirection) == 0x000B38, "Member 'UGAB_AthenaDBNO_C::DeathHitDirection' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DeathHitResult) == 0x000B50, "Member 'UGAB_AthenaDBNO_C::DeathHitResult' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DamageTags) == 0x000C30, "Member 'UGAB_AthenaDBNO_C::DamageTags' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, GameplayStatusAfflicted) == 0x000C50, "Member 'UGAB_AthenaDBNO_C::GameplayStatusAfflicted' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DeathMontageSkydive) == 0x000C70, "Member 'UGAB_AthenaDBNO_C::DeathMontageSkydive' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DBNOBleedGEHandle) == 0x000C78, "Member 'UGAB_AthenaDBNO_C::DBNOBleedGEHandle' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, HolsterId) == 0x000C80, "Member 'UGAB_AthenaDBNO_C::HolsterId' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DeathMontageSwimming) == 0x000C88, "Member 'UGAB_AthenaDBNO_C::DeathMontageSwimming' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, FortPlayerPawn) == 0x000C90, "Member 'UGAB_AthenaDBNO_C::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, DBNOStart_GE_Class) == 0x000C98, "Member 'UGAB_AthenaDBNO_C::DBNOStart_GE_Class' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, ImprovedDBNO) == 0x000CA0, "Member 'UGAB_AthenaDBNO_C::ImprovedDBNO' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, Old_DBNO_Block_Tags) == 0x000CA8, "Member 'UGAB_AthenaDBNO_C::Old_DBNO_Block_Tags' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, GE_Handle__Health_Bonus) == 0x000CC8, "Member 'UGAB_AthenaDBNO_C::GE_Handle__Health_Bonus' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, TenacityAmount) == 0x000CD0, "Member 'UGAB_AthenaDBNO_C::TenacityAmount' has a wrong offset!");
static_assert(offsetof(UGAB_AthenaDBNO_C, TenacityType) == 0x000CD8, "Member 'UGAB_AthenaDBNO_C::TenacityType' has a wrong offset!");

}

