#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gameplay_FaceSystem_StateMachine_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Gameplay_FaceSystem_StateMachine_AnimBP.Gameplay_FaceSystem_StateMachine_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01AF (0x01B0 - 0x0001)
struct Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_633;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_634;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_635;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_636;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_637;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_638;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_639;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_640;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_641;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_642;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_643;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_644;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_645;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_646;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_647;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_648;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_649;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_650;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_651;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_652;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_653;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_654;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_655;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_656;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_657;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_658;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_659;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_660;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_661;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_662;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_663;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_664;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_665;                                 // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_666;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_667;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_668;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_669;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_670;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_671;                                 // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_672;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_673;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_674;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_675;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_676;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_677;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_678;                              // 0x00B8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_679;                               // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_680;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_681;                                // 0x00E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_682;                                // 0x00EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_683;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_684;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_685;                              // 0x00F8(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_686;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_687;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0118(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0198(0x0018)()
};
static_assert(alignof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001B0, "Wrong size on Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_633) == 0x000004, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_633' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_634) == 0x000008, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_634' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_635) == 0x00000C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_635' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_636) == 0x000010, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_636' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_637) == 0x000014, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_637' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_638) == 0x000018, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_638' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_639) == 0x00001C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_639' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_640) == 0x000020, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_640' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_641) == 0x000024, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_641' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_642) == 0x000028, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_642' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_643) == 0x00002C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_643' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_644) == 0x000030, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_644' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_645) == 0x000034, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_645' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_646) == 0x000038, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_646' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_647) == 0x00003C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_647' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_648) == 0x000040, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_648' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_649) == 0x000044, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_649' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_650) == 0x000048, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_650' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_651) == 0x00004C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_651' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_652) == 0x000050, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_652' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_653) == 0x000054, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_653' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_654) == 0x000058, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_654' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_655) == 0x00005C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_655' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_656) == 0x000060, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_656' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_657) == 0x000064, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_657' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_658) == 0x000068, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_658' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_659) == 0x00006C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_659' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_660) == 0x000070, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_660' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_661) == 0x000074, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_661' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_662) == 0x000078, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_662' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_663) == 0x00007C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_663' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_664) == 0x000080, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_664' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_665) == 0x000084, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_665' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_666) == 0x000088, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_666' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_667) == 0x00008C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_667' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_668) == 0x000090, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_668' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_669) == 0x000094, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_669' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_670) == 0x000098, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_670' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_671) == 0x00009C, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_671' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_672) == 0x0000A0, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_672' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_673) == 0x0000A4, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_673' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_674) == 0x0000A8, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_674' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_675) == 0x0000AC, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_675' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_676) == 0x0000B0, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_676' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_677) == 0x0000B4, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_677' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_678) == 0x0000B8, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_678' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_679) == 0x0000E4, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_679' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_680) == 0x0000E8, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_680' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_681) == 0x0000E9, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_681' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_682) == 0x0000EA, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_682' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_683) == 0x0000EC, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_683' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_684) == 0x0000F0, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_684' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_685) == 0x0000F8, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_685' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_686) == 0x000110, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_686' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_687) == 0x000114, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_687' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000118, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000198, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Gameplay_FaceSystem_StateMachine_AnimBP.Gameplay_FaceSystem_StateMachine_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0013 (0x0014 - 0x0001)
struct Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000014, "Wrong size on Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Gameplay_FaceSystem_StateMachine_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
