#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Loop_SpookyMist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Loop_SpookyMist.GCN_Loop_SpookyMist_C
// 0x0020 (0x0B20 - 0x0B00)
class AGCN_Loop_SpookyMist_C final : public AFortGameplayCueNotifyLoop_SpookyMist
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Interaction_Fade_In_Out_Visbility_5529D6B24898E091AFB4668B43CFAB50; // 0x0B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Interaction_Fade_In_Out__Direction_5529D6B24898E091AFB4668B43CFAB50; // 0x0B14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B15[0x3];                                      // 0x0B15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Interaction_Fade_In_Out;                  // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void EndedInteract();
	void ExecuteUbergraph_GCN_Loop_SpookyMist(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void StartedInteract();
	void Timeline_Interaction_Fade_In_Out__FinishedFunc();
	void Timeline_Interaction_Fade_In_Out__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Loop_SpookyMist_C">();
	}
	static class AGCN_Loop_SpookyMist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Loop_SpookyMist_C>();
	}
};
static_assert(alignof(AGCN_Loop_SpookyMist_C) == 0x000008, "Wrong alignment on AGCN_Loop_SpookyMist_C");
static_assert(sizeof(AGCN_Loop_SpookyMist_C) == 0x000B20, "Wrong size on AGCN_Loop_SpookyMist_C");
static_assert(offsetof(AGCN_Loop_SpookyMist_C, UberGraphFrame) == 0x000B00, "Member 'AGCN_Loop_SpookyMist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_SpookyMist_C, PostProcess) == 0x000B08, "Member 'AGCN_Loop_SpookyMist_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_SpookyMist_C, Timeline_Interaction_Fade_In_Out_Visbility_5529D6B24898E091AFB4668B43CFAB50) == 0x000B10, "Member 'AGCN_Loop_SpookyMist_C::Timeline_Interaction_Fade_In_Out_Visbility_5529D6B24898E091AFB4668B43CFAB50' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_SpookyMist_C, Timeline_Interaction_Fade_In_Out__Direction_5529D6B24898E091AFB4668B43CFAB50) == 0x000B14, "Member 'AGCN_Loop_SpookyMist_C::Timeline_Interaction_Fade_In_Out__Direction_5529D6B24898E091AFB4668B43CFAB50' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_SpookyMist_C, Timeline_Interaction_Fade_In_Out) == 0x000B18, "Member 'AGCN_Loop_SpookyMist_C::Timeline_Interaction_Fade_In_Out' has a wrong offset!");

}

