#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_RezIn

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_RezIn.GCN_RezIn_C
// 0x01C8 (0x06F0 - 0x0528)
class AGCN_RezIn_C : public AFortGameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TFX_ResOutCharacterMesh_LightIntensity_81C5527F43A6972D94623590BA582E8C; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_ResOutCharacterMesh_ZHeightParam_81C5527F43A6972D94623590BA582E8C; // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_ResOutCharacterMesh_TransitionParam_81C5527F43A6972D94623590BA582E8C; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TFX_ResOutCharacterMesh__Direction_81C5527F43A6972D94623590BA582E8C; // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TFX_ResOutCharacterMesh;                           // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TFX_GlowCharacterMesh_EmissiveWarp_9EA15145493A8F1A5915938D5529A028; // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TFX_GlowCharacterMesh__Direction_9EA15145493A8F1A5915938D5529A028; // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TFX_GlowCharacterMesh;                             // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_ANIMATION;                                   // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnDrone;                                        // 0x0559(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_55A[0x6];                                      // 0x055A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Teleportation_Drone;                               // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Teleport_Bot_AnimPlayRate;                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Teleport_Bot_Lifespan;                             // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Teleportation_Point_Light;                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                Teleportation_Light_Offset;                        // 0x0580(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Teleportation_Light_Color;                         // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DissolveMIDs;                                      // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UMaterialInterface*                     Mat_Chracter_Dissolve;                             // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Pawn;                                              // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TSet<class USkeletalMeshComponent*>           Dissolve;                                          // 0x05C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class FName                                   Socket_Mesh_Top;                                   // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Max_Light_Intensity;                               // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_Mesh_Bottom;                                // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         Meshes_to_Dissolve;                                // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class ABP_TeleportationDrone_C*               Drone;                                             // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          DEBUG_CHILDCOMPONENTS;                             // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             Particle_Components;                               // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class UNiagaraComponent*                      Spawned_Teleport_VFX;                              // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         Teleport_In_Visual_Effect;                         // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Teleport_In_VFX_Attach_Point_Name;                 // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cur_Dissolve_Setup_Attempt;                        // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         AmountOfTimesToAttemptRestoreMats;                 // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Spawn_VFX_Attached;                                // 0x067C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Dissolve_Timeline_Playrate;                        // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Glow_Timeline_Playrate;                            // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Drone_Visual_Effect;                               // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DEBUG_TESTJANUSFX;                                 // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x3];                                      // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Drone_VFX_Attach_Point;                            // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  Material_Override_ID;                              // 0x06A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPawnMaterialOverrideCopiedParameters Copied_Parameters;                                 // 0x06B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDelegateHandleController              Delegate_Handle_Controller;                        // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Clean_Up_Teleportation_Light();
	void ExecuteUbergraph_GCN_RezIn(int32 EntryPoint);
	void OnCosmeticPart(class AFortPlayerPawn* Pawn_0, class UCustomCharacterPart* Part, class USkeletalMeshComponent* MeshPart, const EFortCustomPartType PartType);
	void Pre_Sequence_Change();
	void Restore_Character_Materials(bool* Fully_Completed);
	void Set_Additional_Niagara_Parameter_on_Drone_FX(class UNiagaraComponent* Drone_FX);
	void Set_Additional_Niagara_Parameters_on_Spawned_FX(class UNiagaraComponent* Spawned_Teleport_In_FX);
	void Set_Timelines__Playrates();
	void Spawn_Drone_VFX();
	void Spawn_Teleport_In_VFX();
	void Spawn_Teleportation_Drone();
	void Spawn_Teleportation_Light();
	void Stop_Looping_Audio();
	void TFX_GlowCharacterMesh__FinishedFunc();
	void TFX_GlowCharacterMesh__UpdateFunc();
	void TFX_ResOutCharacterMesh__FinishedFunc();
	void TFX_ResOutCharacterMesh__UpdateFunc();

	void OnBurstGeneric(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UFXSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_RezIn_C">();
	}
	static class AGCN_RezIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_RezIn_C>();
	}
};
static_assert(alignof(AGCN_RezIn_C) == 0x000008, "Wrong alignment on AGCN_RezIn_C");
static_assert(sizeof(AGCN_RezIn_C) == 0x0006F0, "Wrong size on AGCN_RezIn_C");
static_assert(offsetof(AGCN_RezIn_C, UberGraphFrame) == 0x000528, "Member 'AGCN_RezIn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh_LightIntensity_81C5527F43A6972D94623590BA582E8C) == 0x000530, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh_LightIntensity_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh_ZHeightParam_81C5527F43A6972D94623590BA582E8C) == 0x000534, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh_ZHeightParam_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh_TransitionParam_81C5527F43A6972D94623590BA582E8C) == 0x000538, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh_TransitionParam_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh__Direction_81C5527F43A6972D94623590BA582E8C) == 0x00053C, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh__Direction_81C5527F43A6972D94623590BA582E8C' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_ResOutCharacterMesh) == 0x000540, "Member 'AGCN_RezIn_C::TFX_ResOutCharacterMesh' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_GlowCharacterMesh_EmissiveWarp_9EA15145493A8F1A5915938D5529A028) == 0x000548, "Member 'AGCN_RezIn_C::TFX_GlowCharacterMesh_EmissiveWarp_9EA15145493A8F1A5915938D5529A028' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_GlowCharacterMesh__Direction_9EA15145493A8F1A5915938D5529A028) == 0x00054C, "Member 'AGCN_RezIn_C::TFX_GlowCharacterMesh__Direction_9EA15145493A8F1A5915938D5529A028' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, TFX_GlowCharacterMesh) == 0x000550, "Member 'AGCN_RezIn_C::TFX_GlowCharacterMesh' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DEBUG_ANIMATION) == 0x000558, "Member 'AGCN_RezIn_C::DEBUG_ANIMATION' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, SpawnDrone) == 0x000559, "Member 'AGCN_RezIn_C::SpawnDrone' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Drone) == 0x000560, "Member 'AGCN_RezIn_C::Teleportation_Drone' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_Bot_AnimPlayRate) == 0x000568, "Member 'AGCN_RezIn_C::Teleport_Bot_AnimPlayRate' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_Bot_Lifespan) == 0x000570, "Member 'AGCN_RezIn_C::Teleport_Bot_Lifespan' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Point_Light) == 0x000578, "Member 'AGCN_RezIn_C::Teleportation_Point_Light' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Light_Offset) == 0x000580, "Member 'AGCN_RezIn_C::Teleportation_Light_Offset' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleportation_Light_Color) == 0x000598, "Member 'AGCN_RezIn_C::Teleportation_Light_Color' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DissolveMIDs) == 0x0005A8, "Member 'AGCN_RezIn_C::DissolveMIDs' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Mat_Chracter_Dissolve) == 0x0005B8, "Member 'AGCN_RezIn_C::Mat_Chracter_Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Pawn) == 0x0005C0, "Member 'AGCN_RezIn_C::Pawn' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Dissolve) == 0x0005C8, "Member 'AGCN_RezIn_C::Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Socket_Mesh_Top) == 0x000618, "Member 'AGCN_RezIn_C::Socket_Mesh_Top' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Max_Light_Intensity) == 0x000620, "Member 'AGCN_RezIn_C::Max_Light_Intensity' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Socket_Mesh_Bottom) == 0x000628, "Member 'AGCN_RezIn_C::Socket_Mesh_Bottom' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Meshes_to_Dissolve) == 0x000630, "Member 'AGCN_RezIn_C::Meshes_to_Dissolve' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Drone) == 0x000640, "Member 'AGCN_RezIn_C::Drone' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DEBUG_CHILDCOMPONENTS) == 0x000648, "Member 'AGCN_RezIn_C::DEBUG_CHILDCOMPONENTS' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Particle_Components) == 0x000650, "Member 'AGCN_RezIn_C::Particle_Components' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Spawned_Teleport_VFX) == 0x000660, "Member 'AGCN_RezIn_C::Spawned_Teleport_VFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_In_Visual_Effect) == 0x000668, "Member 'AGCN_RezIn_C::Teleport_In_Visual_Effect' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Teleport_In_VFX_Attach_Point_Name) == 0x000670, "Member 'AGCN_RezIn_C::Teleport_In_VFX_Attach_Point_Name' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Cur_Dissolve_Setup_Attempt) == 0x000674, "Member 'AGCN_RezIn_C::Cur_Dissolve_Setup_Attempt' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, AmountOfTimesToAttemptRestoreMats) == 0x000678, "Member 'AGCN_RezIn_C::AmountOfTimesToAttemptRestoreMats' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Spawn_VFX_Attached) == 0x00067C, "Member 'AGCN_RezIn_C::Spawn_VFX_Attached' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Dissolve_Timeline_Playrate) == 0x000680, "Member 'AGCN_RezIn_C::Dissolve_Timeline_Playrate' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Glow_Timeline_Playrate) == 0x000688, "Member 'AGCN_RezIn_C::Glow_Timeline_Playrate' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Drone_Visual_Effect) == 0x000690, "Member 'AGCN_RezIn_C::Drone_Visual_Effect' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, DEBUG_TESTJANUSFX) == 0x000698, "Member 'AGCN_RezIn_C::DEBUG_TESTJANUSFX' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Drone_VFX_Attach_Point) == 0x00069C, "Member 'AGCN_RezIn_C::Drone_VFX_Attach_Point' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Material_Override_ID) == 0x0006A0, "Member 'AGCN_RezIn_C::Material_Override_ID' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Copied_Parameters) == 0x0006B0, "Member 'AGCN_RezIn_C::Copied_Parameters' has a wrong offset!");
static_assert(offsetof(AGCN_RezIn_C, Delegate_Handle_Controller) == 0x0006E0, "Member 'AGCN_RezIn_C::Delegate_Handle_Controller' has a wrong offset!");

}

