#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Loop_Snow_Whiteout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Loop_Snow_Whiteout.GCN_Loop_Snow_Whiteout_C
// 0x0038 (0x0998 - 0x0960)
class AGCN_Loop_Snow_Whiteout_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeinOut_Post_BDCA5FC943E3CD00D42B59A9A0D1C530;   // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeinOut_Fade_BDCA5FC943E3CD00D42B59A9A0D1C530;   // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeinOut__Direction_BDCA5FC943E3CD00D42B59A9A0D1C530; // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x7];                                      // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeInOut;                                         // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFadeIn;                                     // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFadeOut;                                    // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Loop_Snow_Whiteout(int32 EntryPoint);
	void FadeinOut__FinishedFunc();
	void FadeinOut__UpdateFunc();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Loop_Snow_Whiteout_C">();
	}
	static class AGCN_Loop_Snow_Whiteout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Loop_Snow_Whiteout_C>();
	}
};
static_assert(alignof(AGCN_Loop_Snow_Whiteout_C) == 0x000008, "Wrong alignment on AGCN_Loop_Snow_Whiteout_C");
static_assert(sizeof(AGCN_Loop_Snow_Whiteout_C) == 0x000998, "Wrong size on AGCN_Loop_Snow_Whiteout_C");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, UberGraphFrame) == 0x000960, "Member 'AGCN_Loop_Snow_Whiteout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, PostProcess) == 0x000968, "Member 'AGCN_Loop_Snow_Whiteout_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, FadeinOut_Post_BDCA5FC943E3CD00D42B59A9A0D1C530) == 0x000970, "Member 'AGCN_Loop_Snow_Whiteout_C::FadeinOut_Post_BDCA5FC943E3CD00D42B59A9A0D1C530' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, FadeinOut_Fade_BDCA5FC943E3CD00D42B59A9A0D1C530) == 0x000974, "Member 'AGCN_Loop_Snow_Whiteout_C::FadeinOut_Fade_BDCA5FC943E3CD00D42B59A9A0D1C530' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, FadeinOut__Direction_BDCA5FC943E3CD00D42B59A9A0D1C530) == 0x000978, "Member 'AGCN_Loop_Snow_Whiteout_C::FadeinOut__Direction_BDCA5FC943E3CD00D42B59A9A0D1C530' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, FadeInOut) == 0x000980, "Member 'AGCN_Loop_Snow_Whiteout_C::FadeInOut' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, SoundOnFadeIn) == 0x000988, "Member 'AGCN_Loop_Snow_Whiteout_C::SoundOnFadeIn' has a wrong offset!");
static_assert(offsetof(AGCN_Loop_Snow_Whiteout_C, SoundOnFadeOut) == 0x000990, "Member 'AGCN_Loop_Snow_Whiteout_C::SoundOnFadeOut' has a wrong offset!");

}

