#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_EnvCampFire_Stoke

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_EnvCampFire_Stoke.GCNL_EnvCampFire_Stoke_C
// 0x0058 (0x09B8 - 0x0960)
class AGCNL_EnvCampFire_Stoke_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_TickInterval;                                  // 0x0968(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxHeals;                                      // 0x0990(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCNL_EnvCampFire_Stoke(int32 EntryPoint);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_EnvCampFire_Stoke_C">();
	}
	static class AGCNL_EnvCampFire_Stoke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_EnvCampFire_Stoke_C>();
	}
};
static_assert(alignof(AGCNL_EnvCampFire_Stoke_C) == 0x000008, "Wrong alignment on AGCNL_EnvCampFire_Stoke_C");
static_assert(sizeof(AGCNL_EnvCampFire_Stoke_C) == 0x0009B8, "Wrong size on AGCNL_EnvCampFire_Stoke_C");
static_assert(offsetof(AGCNL_EnvCampFire_Stoke_C, UberGraphFrame) == 0x000960, "Member 'AGCNL_EnvCampFire_Stoke_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Stoke_C, Row_TickInterval) == 0x000968, "Member 'AGCNL_EnvCampFire_Stoke_C::Row_TickInterval' has a wrong offset!");
static_assert(offsetof(AGCNL_EnvCampFire_Stoke_C, Row_MaxHeals) == 0x000990, "Member 'AGCNL_EnvCampFire_Stoke_C::Row_MaxHeals' has a wrong offset!");

}

