#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Vent_Enter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Vent_Enter.GCNL_Vent_Enter_C
// 0x0038 (0x0998 - 0x0960)
class AGCNL_Vent_Enter_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadePPVol_LERP_6D28D8B64202D10F474B48B80194DA6D;   // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadePPVol__Direction_6D28D8B64202D10F474B48B80194DA6D; // 0x0974(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_975[0x3];                                      // 0x0975(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadePPVol;                                         // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShakeClass;                                  // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULegacyCameraShake*                     CameraShake;                                       // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePP;                                             // 0x0990(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Vent_Enter(int32 EntryPoint);
	void FadePPVol__FinishedFunc();
	void FadePPVol__UpdateFunc();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class ULegacyCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Vent_Enter_C">();
	}
	static class AGCNL_Vent_Enter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Vent_Enter_C>();
	}
};
static_assert(alignof(AGCNL_Vent_Enter_C) == 0x000008, "Wrong alignment on AGCNL_Vent_Enter_C");
static_assert(sizeof(AGCNL_Vent_Enter_C) == 0x000998, "Wrong size on AGCNL_Vent_Enter_C");
static_assert(offsetof(AGCNL_Vent_Enter_C, UberGraphFrame) == 0x000960, "Member 'AGCNL_Vent_Enter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, PostProcess) == 0x000968, "Member 'AGCNL_Vent_Enter_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, FadePPVol_LERP_6D28D8B64202D10F474B48B80194DA6D) == 0x000970, "Member 'AGCNL_Vent_Enter_C::FadePPVol_LERP_6D28D8B64202D10F474B48B80194DA6D' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, FadePPVol__Direction_6D28D8B64202D10F474B48B80194DA6D) == 0x000974, "Member 'AGCNL_Vent_Enter_C::FadePPVol__Direction_6D28D8B64202D10F474B48B80194DA6D' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, FadePPVol) == 0x000978, "Member 'AGCNL_Vent_Enter_C::FadePPVol' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, CameraShakeClass) == 0x000980, "Member 'AGCNL_Vent_Enter_C::CameraShakeClass' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, CameraShake) == 0x000988, "Member 'AGCNL_Vent_Enter_C::CameraShake' has a wrong offset!");
static_assert(offsetof(AGCNL_Vent_Enter_C, UsePP) == 0x000990, "Member 'AGCNL_Vent_Enter_C::UsePP' has a wrong offset!");

}

