#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericModalButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GenericModalButton.GenericModalButton_C
// 0x00A0 (0x14D0 - 0x1430)
class UGenericModalButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover2;                                            // 0x1438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x1448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x1450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x1458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Right_Image;                               // 0x1460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_Text;                                         // 0x1468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Height;                                    // 0x1470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x1478(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x1490(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_14A4[0x4];                                     // 0x14A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material_Brush;                                    // 0x14A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x14B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x14B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x14B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SimpleHover;                                       // 0x14BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOverride;                                  // 0x14BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x14BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShearText;                                         // 0x14C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_GenericModalButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBorderShowEffectWhenDisable(bool ShowEffectWhenDisabled);
	void SetButtonText(const class FText& ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GenericModalButton_C">();
	}
	static class UGenericModalButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericModalButton_C>();
	}
};
static_assert(alignof(UGenericModalButton_C) == 0x000010, "Wrong alignment on UGenericModalButton_C");
static_assert(sizeof(UGenericModalButton_C) == 0x0014D0, "Wrong size on UGenericModalButton_C");
static_assert(offsetof(UGenericModalButton_C, UberGraphFrame) == 0x001430, "Member 'UGenericModalButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Hover2) == 0x001438, "Member 'UGenericModalButton_C::Hover2' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Hover) == 0x001440, "Member 'UGenericModalButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Border_Material) == 0x001448, "Member 'UGenericModalButton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Image) == 0x001450, "Member 'UGenericModalButton_C::Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Image_45) == 0x001458, "Member 'UGenericModalButton_C::Image_45' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Overlay_Right_Image) == 0x001460, "Member 'UGenericModalButton_C::Overlay_Right_Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Rich_Text) == 0x001468, "Member 'UGenericModalButton_C::Rich_Text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, SizeBox_Height) == 0x001470, "Member 'UGenericModalButton_C::SizeBox_Height' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Button_text) == 0x001478, "Member 'UGenericModalButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Text_Color) == 0x001490, "Member 'UGenericModalButton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Material_Brush) == 0x0014A8, "Member 'UGenericModalButton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Right_Image) == 0x0014B0, "Member 'UGenericModalButton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Justifiction) == 0x0014B8, "Member 'UGenericModalButton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, Auto_wrap_text) == 0x0014B9, "Member 'UGenericModalButton_C::Auto_wrap_text' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, SimpleHover) == 0x0014BA, "Member 'UGenericModalButton_C::SimpleHover' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, FontSizeOverride) == 0x0014BB, "Member 'UGenericModalButton_C::FontSizeOverride' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, FontSize) == 0x0014BC, "Member 'UGenericModalButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(UGenericModalButton_C, ShearText) == 0x0014C0, "Member 'UGenericModalButton_C::ShearText' has a wrong offset!");

}

