#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grandma_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0247 (0x0248 - 0x0001)
struct Grandma_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1286;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1287;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1288;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1289;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1290;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1291;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1292;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1293;                              // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1294;                              // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1295;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1296;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1297;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1298;                              // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1299;                              // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1300;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1301;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1302;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1303;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1304;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1305;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1306;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1307;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1308;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1309;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1310;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1311;                               // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1312;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1313;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1314;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1315;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1316;                              // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1317;                               // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1318;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1319;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1320;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1321;                               // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1322;                              // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1323;                              // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1324;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1325;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1326;                              // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1327;                              // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1328;                               // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1329;                               // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1330;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1331;                               // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1332;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1333;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1334;                                 // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1335;                               // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1336;                               // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1337;                              // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1338;                               // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1339;                              // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1340;                             // 0x0148(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1341;                              // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1342;                               // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1343;                               // 0x0179(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1344;                               // 0x017A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1345;                               // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1346;                                // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1347;                               // 0x0184(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1348;                               // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1349;                               // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1350;                                // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1351;                             // 0x0198(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0230(0x0018)()
};
static_assert(alignof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Grandma_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000248, "Wrong size on Grandma_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1286) == 0x000004, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1286' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1287) == 0x000008, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1287' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1288) == 0x00000C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1288' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1289) == 0x000010, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1289' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1290) == 0x000014, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1290' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1291) == 0x000018, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1291' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1292) == 0x00001C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1292' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1293) == 0x000020, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1293' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1294) == 0x000030, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1294' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1295) == 0x000040, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1295' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1296) == 0x000044, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1296' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1297) == 0x000048, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1297' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1298) == 0x00004C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1298' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1299) == 0x000050, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1299' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1300) == 0x000060, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1300' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1301) == 0x000064, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1301' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1302) == 0x000068, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1302' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1303) == 0x00006C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1303' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1304) == 0x000070, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1304' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1305) == 0x000074, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1305' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1306) == 0x000078, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1306' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1307) == 0x00007C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1307' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1308) == 0x000080, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1308' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1309) == 0x000084, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1309' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1310) == 0x000088, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1310' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1311) == 0x00008C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1311' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1312) == 0x000090, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1312' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1313) == 0x000094, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1313' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1314) == 0x000098, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1314' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1315) == 0x00009C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1315' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1316) == 0x0000A0, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1316' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1317) == 0x0000A4, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1317' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1318) == 0x0000A8, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1318' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1319) == 0x0000AC, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1319' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1320) == 0x0000B0, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1320' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1321) == 0x0000B4, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1321' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1322) == 0x0000B8, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1322' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1323) == 0x0000C8, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1323' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1324) == 0x0000D8, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1324' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1325) == 0x0000DC, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1325' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1326) == 0x0000E0, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1326' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1327) == 0x0000F0, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1327' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1328) == 0x000100, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1328' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1329) == 0x000104, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1329' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1330) == 0x000108, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1330' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1331) == 0x00010C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1331' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1332) == 0x000110, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1332' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1333) == 0x000118, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1333' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1334) == 0x000120, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1334' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1335) == 0x000128, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1335' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1336) == 0x000129, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1336' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1337) == 0x000130, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1337' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1338) == 0x000140, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1338' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1339) == 0x000144, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1339' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1340) == 0x000148, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1340' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1341) == 0x000174, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1341' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1342) == 0x000178, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1342' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1343) == 0x000179, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1343' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1344) == 0x00017A, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1344' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1345) == 0x00017C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1345' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1346) == 0x000180, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1346' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1347) == 0x000184, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1347' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1348) == 0x000188, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1348' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1349) == 0x00018C, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1349' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1350) == 0x000190, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1350' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1351) == 0x000198, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1351' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001B0, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000230, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Grandma_AnimBP.Grandma_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0073 (0x0074 - 0x0001)
struct Grandma_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0023(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_19;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_24;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_26;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_29;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_31;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grandma_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Grandma_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Grandma_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000074, "Wrong size on Grandma_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Grandma_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'Grandma_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
