#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrindRail_Connection

#include "Basic.hpp"

#include "RailConnectionOption_structs.hpp"


namespace SDK
{

// UserDefinedStruct GrindRail_Connection.GrindRail_Connection
// 0x0148 (0x0148 - 0x0000)
struct FGrindRail_Connection final
{
public:
	double                                        ConnectionLocation_2_0B59101340934B78FA685DBB3072546E; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRailConnectionOption                  EntryOption_26_995FF26243CC37929AF1D08E02F6B471;   // 0x0008(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRailConnectionOption                  ExitLeft_29_4173695B49EAD891743609975CA99BF2;      // 0x0058(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRailConnectionOption                  ExitCenter_31_A7524DDC48E637B63412739891613E21;    // 0x00A8(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRailConnectionOption                  ExitRight_33_5514ADD6402DE1855D3D758296BC53F3;     // 0x00F8(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FGrindRail_Connection) == 0x000008, "Wrong alignment on FGrindRail_Connection");
static_assert(sizeof(FGrindRail_Connection) == 0x000148, "Wrong size on FGrindRail_Connection");
static_assert(offsetof(FGrindRail_Connection, ConnectionLocation_2_0B59101340934B78FA685DBB3072546E) == 0x000000, "Member 'FGrindRail_Connection::ConnectionLocation_2_0B59101340934B78FA685DBB3072546E' has a wrong offset!");
static_assert(offsetof(FGrindRail_Connection, EntryOption_26_995FF26243CC37929AF1D08E02F6B471) == 0x000008, "Member 'FGrindRail_Connection::EntryOption_26_995FF26243CC37929AF1D08E02F6B471' has a wrong offset!");
static_assert(offsetof(FGrindRail_Connection, ExitLeft_29_4173695B49EAD891743609975CA99BF2) == 0x000058, "Member 'FGrindRail_Connection::ExitLeft_29_4173695B49EAD891743609975CA99BF2' has a wrong offset!");
static_assert(offsetof(FGrindRail_Connection, ExitCenter_31_A7524DDC48E637B63412739891613E21) == 0x0000A8, "Member 'FGrindRail_Connection::ExitCenter_31_A7524DDC48E637B63412739891613E21' has a wrong offset!");
static_assert(offsetof(FGrindRail_Connection, ExitRight_33_5514ADD6402DE1855D3D758296BC53F3) == 0x0000F8, "Member 'FGrindRail_Connection::ExitRight_33_5514ADD6402DE1855D3D758296BC53F3' has a wrong offset!");

}

