#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrindRail_ResourceSpawns

#include "Basic.hpp"

#include "GrindRail_ResourceSpawns_Type_structs.hpp"


namespace SDK
{

// UserDefinedStruct GrindRail_ResourceSpawns.GrindRail_ResourceSpawns
// 0x0018 (0x0018 - 0x0000)
struct FGrindRail_ResourceSpawns final
{
public:
	double                                        LocationOnRail_22_72B92E3B4647946BC77E16B7C38E3157; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrindRail_ResourceSpawns_Type                Type_19_4C298D7E43D6D531E9294D9EBF6D35AF;          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Number_20_D9BE37E4489CFFA0623801A1D586E741;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceBetween_23_6D6ECC5845390875BEC167B11090B704; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FGrindRail_ResourceSpawns) == 0x000008, "Wrong alignment on FGrindRail_ResourceSpawns");
static_assert(sizeof(FGrindRail_ResourceSpawns) == 0x000018, "Wrong size on FGrindRail_ResourceSpawns");
static_assert(offsetof(FGrindRail_ResourceSpawns, LocationOnRail_22_72B92E3B4647946BC77E16B7C38E3157) == 0x000000, "Member 'FGrindRail_ResourceSpawns::LocationOnRail_22_72B92E3B4647946BC77E16B7C38E3157' has a wrong offset!");
static_assert(offsetof(FGrindRail_ResourceSpawns, Type_19_4C298D7E43D6D531E9294D9EBF6D35AF) == 0x000008, "Member 'FGrindRail_ResourceSpawns::Type_19_4C298D7E43D6D531E9294D9EBF6D35AF' has a wrong offset!");
static_assert(offsetof(FGrindRail_ResourceSpawns, Number_20_D9BE37E4489CFFA0623801A1D586E741) == 0x00000C, "Member 'FGrindRail_ResourceSpawns::Number_20_D9BE37E4489CFFA0623801A1D586E741' has a wrong offset!");
static_assert(offsetof(FGrindRail_ResourceSpawns, DistanceBetween_23_6D6ECC5845390875BEC167B11090B704) == 0x000010, "Member 'FGrindRail_ResourceSpawns::DistanceBetween_23_6D6ECC5845390875BEC167B11090B704' has a wrong offset!");

}

