#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrindRail_Player_LayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0237 (0x0238 - 0x0001)
struct GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1296;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1297;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1298;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1299;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1300;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1301;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1302;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1303;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1304;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1305;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1306;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1307;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1308;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1309;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1310;                              // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1311;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1312;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1313;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1314;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_1315;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1316;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1317;                               // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1318;                               // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1319;                              // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1320;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1321;                               // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1322;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1323;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1324;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1325;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1326;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1327;                               // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1328;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1329;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1330;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1331;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1332;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1333;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1334;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1335;                               // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1336;                               // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1337;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1338;                               // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1339;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1340;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1341;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1342;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1343;                               // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1344;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1345;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1346;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1347;                               // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1348;                               // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1349;                               // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1350;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1351;                               // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1352;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1353;                               // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1354;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1355;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1356;                             // 0x0118(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1357;                               // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1358;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1359;                               // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1360;                                // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1361;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1362;                                // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1363;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1364;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1365;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1366;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1367;                               // 0x016C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1368;                              // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1369;                              // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1370;                               // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1371;                               // 0x0179(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1372;                               // 0x017A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1373;                             // 0x0180(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1374;                               // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1375;                               // 0x019C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0220(0x0018)()
};
static_assert(alignof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000238, "Wrong size on GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1296) == 0x000004, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1296' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1297) == 0x000008, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1297' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1298) == 0x00000C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1298' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1299) == 0x000010, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1299' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1300) == 0x000014, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1300' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1301) == 0x000018, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1301' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1302) == 0x00001C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1302' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1303) == 0x000020, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1303' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1304) == 0x000024, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1304' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1305) == 0x000028, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1305' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1306) == 0x00002C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1306' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1307) == 0x000030, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1307' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1308) == 0x000034, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1308' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1309) == 0x000038, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1309' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1310) == 0x000040, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1310' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1311) == 0x000050, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1311' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1312) == 0x000054, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1312' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1313) == 0x000058, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1313' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1314) == 0x00005C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1314' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1315) == 0x000060, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1315' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1316) == 0x000068, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1316' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1317) == 0x000070, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1317' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1318) == 0x000071, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1318' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1319) == 0x000078, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1319' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1320) == 0x000088, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1320' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1321) == 0x00008C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1321' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1322) == 0x000090, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1322' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1323) == 0x000094, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1323' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1324) == 0x000098, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1324' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1325) == 0x00009C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1325' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1326) == 0x0000A0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1326' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1327) == 0x0000A4, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1327' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1328) == 0x0000A8, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1328' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1329) == 0x0000AC, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1329' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1330) == 0x0000B0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1330' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1331) == 0x0000B4, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1331' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1332) == 0x0000B8, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1332' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1333) == 0x0000BC, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1333' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1334) == 0x0000C0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1334' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1335) == 0x0000C4, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1335' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1336) == 0x0000C8, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1336' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1337) == 0x0000CC, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1337' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1338) == 0x0000D0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1338' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1339) == 0x0000D4, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1339' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1340) == 0x0000D8, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1340' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1341) == 0x0000DC, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1341' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1342) == 0x0000E0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1342' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1343) == 0x0000E4, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1343' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1344) == 0x0000E8, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1344' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1345) == 0x0000EC, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1345' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1346) == 0x0000F0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1346' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1347) == 0x0000F4, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1347' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1348) == 0x0000F8, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1348' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1349) == 0x0000FC, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1349' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1350) == 0x000100, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1350' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1351) == 0x000104, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1351' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1352) == 0x000108, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1352' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1353) == 0x00010C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1353' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1354) == 0x000110, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1354' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1355) == 0x000114, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1355' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1356) == 0x000118, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1356' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1357) == 0x000144, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1357' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1358) == 0x000148, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1358' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1359) == 0x00014C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1359' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1360) == 0x000150, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1360' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1361) == 0x000154, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1361' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1362) == 0x000158, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1362' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1363) == 0x00015C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1363' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1364) == 0x000160, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1364' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1365) == 0x000164, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1365' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1366) == 0x000168, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1366' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1367) == 0x00016C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1367' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1368) == 0x000170, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1368' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1369) == 0x000174, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1369' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1370) == 0x000178, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1370' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1371) == 0x000179, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1371' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1372) == 0x00017A, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1372' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1373) == 0x000180, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1373' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1374) == 0x000198, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1374' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1375) == 0x00019C, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1375' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001A0, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000220, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct GrindRail_Player_LayerAnimBP.GrindRail_Player_LayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0057 (0x0058 - 0x0001)
struct GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_5;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000058, "Wrong size on GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'GrindRail_Player_LayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
