#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroupChallengeTag

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GroupChallengeTag.GroupChallengeTag_C.ExecuteUbergraph_GroupChallengeTag
// 0x0048 (0x0048 - 0x0000)
struct GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag) == 0x000008, "Wrong alignment on GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag");
static_assert(sizeof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag) == 0x000048, "Wrong size on GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, EntryPoint) == 0x000000, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, K2Node_Event_IsDesignTime) == 0x000004, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, K2Node_MakeStruct_Margin) == 0x000010, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, Temp_bool_Variable) == 0x000030, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, K2Node_Select_Default) == 0x000034, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000044, "Member 'GroupChallengeTag_C_ExecuteUbergraph_GroupChallengeTag::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function GroupChallengeTag.GroupChallengeTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GroupChallengeTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GroupChallengeTag_C_PreConstruct) == 0x000001, "Wrong alignment on GroupChallengeTag_C_PreConstruct");
static_assert(sizeof(GroupChallengeTag_C_PreConstruct) == 0x000001, "Wrong size on GroupChallengeTag_C_PreConstruct");
static_assert(offsetof(GroupChallengeTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GroupChallengeTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function GroupChallengeTag.GroupChallengeTag_C.SetRarity
// 0x00A0 (0x00A0 - 0x0000)
struct GroupChallengeTag_C_SetRarity final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0018(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GroupChallengeTag_C_SetRarity) == 0x000008, "Wrong alignment on GroupChallengeTag_C_SetRarity");
static_assert(sizeof(GroupChallengeTag_C_SetRarity) == 0x0000A0, "Wrong size on GroupChallengeTag_C_SetRarity");
static_assert(offsetof(GroupChallengeTag_C_SetRarity, Rarity) == 0x000000, "Member 'GroupChallengeTag_C_SetRarity::Rarity' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_SetRarity, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'GroupChallengeTag_C_SetRarity::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_SetRarity, CallFunc_BPGetRarityData_ReturnValue) == 0x000018, "Member 'GroupChallengeTag_C_SetRarity::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupChallengeTag_C_SetRarity, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000098, "Member 'GroupChallengeTag_C_SetRarity::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

