#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxAudio

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "HmxAudio_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "AudioMixer_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HmxCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class HmxAudio.MidiMusicInterface
// 0x0000 (0x0028 - 0x0028)
class IMidiMusicInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicInterface">();
	}
	static class IMidiMusicInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMidiMusicInterface>();
	}
};
static_assert(alignof(IMidiMusicInterface) == 0x000008, "Wrong alignment on IMidiMusicInterface");
static_assert(sizeof(IMidiMusicInterface) == 0x000028, "Wrong size on IMidiMusicInterface");

// Class HmxAudio.HmxResourceAssetBase
// 0x00B0 (0x00D8 - 0x0028)
class UHmxResourceAssetBase : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        mReferencedChildAssets;                            // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x78];                                      // 0x0060(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HmxResourceAssetBase">();
	}
	static class UHmxResourceAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHmxResourceAssetBase>();
	}
};
static_assert(alignof(UHmxResourceAssetBase) == 0x000008, "Wrong alignment on UHmxResourceAssetBase");
static_assert(sizeof(UHmxResourceAssetBase) == 0x0000D8, "Wrong size on UHmxResourceAssetBase");
static_assert(offsetof(UHmxResourceAssetBase, mReferencedChildAssets) == 0x000050, "Member 'UHmxResourceAssetBase::mReferencedChildAssets' has a wrong offset!");

// Class HmxAudio.MusicalAssetBase
// 0x0008 (0x00E0 - 0x00D8)
class UMusicalAssetBase : public UHmxResourceAssetBase
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicalAssetBase">();
	}
	static class UMusicalAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicalAssetBase>();
	}
};
static_assert(alignof(UMusicalAssetBase) == 0x000008, "Wrong alignment on UMusicalAssetBase");
static_assert(sizeof(UMusicalAssetBase) == 0x0000E0, "Wrong size on UMusicalAssetBase");

// Class HmxAudio.MusicAssetBase
// 0x0010 (0x00F0 - 0x00E0)
class UMusicAssetBase : public UMusicalAssetBase
{
public:
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetLengthMs() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicAssetBase">();
	}
	static class UMusicAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicAssetBase>();
	}
};
static_assert(alignof(UMusicAssetBase) == 0x000008, "Wrong alignment on UMusicAssetBase");
static_assert(sizeof(UMusicAssetBase) == 0x0000F0, "Wrong size on UMusicAssetBase");

// Class HmxAudio.SongPosInterface
// 0x0000 (0x0028 - 0x0028)
class ISongPosInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SongPosInterface">();
	}
	static class ISongPosInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISongPosInterface>();
	}
};
static_assert(alignof(ISongPosInterface) == 0x000008, "Wrong alignment on ISongPosInterface");
static_assert(sizeof(ISongPosInterface) == 0x000028, "Wrong size on ISongPosInterface");

// Class HmxAudio.SynthesizerPatchAssetBase
// 0x0000 (0x00E0 - 0x00E0)
class USynthesizerPatchAssetBase : public UMusicalAssetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SynthesizerPatchAssetBase">();
	}
	static class USynthesizerPatchAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USynthesizerPatchAssetBase>();
	}
};
static_assert(alignof(USynthesizerPatchAssetBase) == 0x000008, "Wrong alignment on USynthesizerPatchAssetBase");
static_assert(sizeof(USynthesizerPatchAssetBase) == 0x0000E0, "Wrong size on USynthesizerPatchAssetBase");

// Class HmxAudio.DaggerPatchAsset
// 0x0000 (0x00E0 - 0x00E0)
class UDaggerPatchAsset final : public USynthesizerPatchAssetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaggerPatchAsset">();
	}
	static class UDaggerPatchAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaggerPatchAsset>();
	}
};
static_assert(alignof(UDaggerPatchAsset) == 0x000008, "Wrong alignment on UDaggerPatchAsset");
static_assert(sizeof(UDaggerPatchAsset) == 0x0000E0, "Wrong size on UDaggerPatchAsset");

// Class HmxAudio.FusionPatchAsset
// 0x0008 (0x00E8 - 0x00E0)
class UFusionPatchAsset final : public USynthesizerPatchAssetBase
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FusionPatchAsset">();
	}
	static class UFusionPatchAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFusionPatchAsset>();
	}
};
static_assert(alignof(UFusionPatchAsset) == 0x000008, "Wrong alignment on UFusionPatchAsset");
static_assert(sizeof(UFusionPatchAsset) == 0x0000E8, "Wrong size on UFusionPatchAsset");

// Class HmxAudio.MidiFileAsset
// 0x0168 (0x0190 - 0x0028)
class UMidiFileAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MidiFilePath;                                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x150];                                     // 0x0040(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiFileAsset">();
	}
	static class UMidiFileAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiFileAsset>();
	}
};
static_assert(alignof(UMidiFileAsset) == 0x000008, "Wrong alignment on UMidiFileAsset");
static_assert(sizeof(UMidiFileAsset) == 0x000190, "Wrong size on UMidiFileAsset");
static_assert(offsetof(UMidiFileAsset, MidiFilePath) == 0x000030, "Member 'UMidiFileAsset::MidiFilePath' has a wrong offset!");

// Class HmxAudio.MidiMusicAsset
// 0x0130 (0x0220 - 0x00F0)
class UMidiMusicAsset final : public UMusicAssetBase
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMidiFileAsset*                         MidiFileAsset;                                     // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MidiMusicPath;                                     // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFusionPatchAsset*>   FusionPatchMap;                                    // 0x0128(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, class UDaggerPatchAsset*>   DaggerPatchMap;                                    // 0x0178(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FRemapRecord>        TrackRemaps;                                       // 0x01C8(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicAsset">();
	}
	static class UMidiMusicAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiMusicAsset>();
	}
};
static_assert(alignof(UMidiMusicAsset) == 0x000008, "Wrong alignment on UMidiMusicAsset");
static_assert(sizeof(UMidiMusicAsset) == 0x000220, "Wrong size on UMidiMusicAsset");
static_assert(offsetof(UMidiMusicAsset, MidiFileAsset) == 0x0000F8, "Member 'UMidiMusicAsset::MidiFileAsset' has a wrong offset!");
static_assert(offsetof(UMidiMusicAsset, MidiMusicPath) == 0x000108, "Member 'UMidiMusicAsset::MidiMusicPath' has a wrong offset!");
static_assert(offsetof(UMidiMusicAsset, FusionPatchMap) == 0x000128, "Member 'UMidiMusicAsset::FusionPatchMap' has a wrong offset!");
static_assert(offsetof(UMidiMusicAsset, DaggerPatchMap) == 0x000178, "Member 'UMidiMusicAsset::DaggerPatchMap' has a wrong offset!");
static_assert(offsetof(UMidiMusicAsset, TrackRemaps) == 0x0001C8, "Member 'UMidiMusicAsset::TrackRemaps' has a wrong offset!");

// Class HmxAudio.MoggDataAsset
// 0x0000 (0x00D8 - 0x00D8)
class UMoggDataAsset final : public UHmxResourceAssetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoggDataAsset">();
	}
	static class UMoggDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoggDataAsset>();
	}
};
static_assert(alignof(UMoggDataAsset) == 0x000008, "Wrong alignment on UMoggDataAsset");
static_assert(sizeof(UMoggDataAsset) == 0x0000D8, "Wrong size on UMoggDataAsset");

// Class HmxAudio.MoggMusicAsset
// 0x0008 (0x00F8 - 0x00F0)
class UMoggMusicAsset final : public UMusicAssetBase
{
public:
	class UMidiFileAsset*                         MidiFileAsset;                                     // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoggMusicAsset">();
	}
	static class UMoggMusicAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoggMusicAsset>();
	}
};
static_assert(alignof(UMoggMusicAsset) == 0x000008, "Wrong alignment on UMoggMusicAsset");
static_assert(sizeof(UMoggMusicAsset) == 0x0000F8, "Wrong size on UMoggMusicAsset");
static_assert(offsetof(UMoggMusicAsset, MidiFileAsset) == 0x0000F0, "Member 'UMoggMusicAsset::MidiFileAsset' has a wrong offset!");

// Class HmxAudio.BTDecorator_StopAfterSpan
// 0x0038 (0x00C8 - 0x0090)
class UBTDecorator_StopAfterSpan final : public UBTDecorator_BlackboardBase
{
public:
	float                                         Length;                                            // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELengthType                                   LengthUnits;                                       // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESynchronizationType                          SynchronizeTo;                                     // 0x0095(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlopWindow;                                        // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x2C];                                      // 0x009C(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNextBeat(int32 beatNumber, int32 beatInBar);
	void OnNextMeasure(int32 measureNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_StopAfterSpan">();
	}
	static class UBTDecorator_StopAfterSpan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_StopAfterSpan>();
	}
};
static_assert(alignof(UBTDecorator_StopAfterSpan) == 0x000008, "Wrong alignment on UBTDecorator_StopAfterSpan");
static_assert(sizeof(UBTDecorator_StopAfterSpan) == 0x0000C8, "Wrong size on UBTDecorator_StopAfterSpan");
static_assert(offsetof(UBTDecorator_StopAfterSpan, Length) == 0x000090, "Member 'UBTDecorator_StopAfterSpan::Length' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAfterSpan, LengthUnits) == 0x000094, "Member 'UBTDecorator_StopAfterSpan::LengthUnits' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAfterSpan, SynchronizeTo) == 0x000095, "Member 'UBTDecorator_StopAfterSpan::SynchronizeTo' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAfterSpan, SlopWindow) == 0x000098, "Member 'UBTDecorator_StopAfterSpan::SlopWindow' has a wrong offset!");

// Class HmxAudio.BTDecorator_StopAtMidiMsg
// 0x0068 (0x00F8 - 0x0090)
class UBTDecorator_StopAtMidiMsg final : public UBTDecorator_BlackboardBase
{
public:
	EMidiMsgType                                  MessageType;                                       // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpecificTextMessage;                               // 0x0098(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                 TextMessageCapture;                                // 0x00A8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	int32                                         SpecificChannel;                                   // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificNote;                                      // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificVelocityMin;                               // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificVelocityMax;                               // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyTextMessage;                                // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyChannel;                                    // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyNote;                                       // 0x00E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyVelocityRange;                              // 0x00E3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x14];                                      // 0x00E4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNoteOffMessage(const class FString& CursorName, int32 Channel, int32 Note);
	void OnNoteOnMessage(const class FString& CursorName, int32 Channel, int32 Note, int32 Velocity);
	void OnTextMessage(const class FString& CursorName, const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_StopAtMidiMsg">();
	}
	static class UBTDecorator_StopAtMidiMsg* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_StopAtMidiMsg>();
	}
};
static_assert(alignof(UBTDecorator_StopAtMidiMsg) == 0x000008, "Wrong alignment on UBTDecorator_StopAtMidiMsg");
static_assert(sizeof(UBTDecorator_StopAtMidiMsg) == 0x0000F8, "Wrong size on UBTDecorator_StopAtMidiMsg");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, MessageType) == 0x000090, "Member 'UBTDecorator_StopAtMidiMsg::MessageType' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecificTextMessage) == 0x000098, "Member 'UBTDecorator_StopAtMidiMsg::SpecificTextMessage' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, TextMessageCapture) == 0x0000A8, "Member 'UBTDecorator_StopAtMidiMsg::TextMessageCapture' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecificChannel) == 0x0000D0, "Member 'UBTDecorator_StopAtMidiMsg::SpecificChannel' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecificNote) == 0x0000D4, "Member 'UBTDecorator_StopAtMidiMsg::SpecificNote' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecificVelocityMin) == 0x0000D8, "Member 'UBTDecorator_StopAtMidiMsg::SpecificVelocityMin' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecificVelocityMax) == 0x0000DC, "Member 'UBTDecorator_StopAtMidiMsg::SpecificVelocityMax' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecifyTextMessage) == 0x0000E0, "Member 'UBTDecorator_StopAtMidiMsg::SpecifyTextMessage' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecifyChannel) == 0x0000E1, "Member 'UBTDecorator_StopAtMidiMsg::SpecifyChannel' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecifyNote) == 0x0000E2, "Member 'UBTDecorator_StopAtMidiMsg::SpecifyNote' has a wrong offset!");
static_assert(offsetof(UBTDecorator_StopAtMidiMsg, SpecifyVelocityRange) == 0x0000E3, "Member 'UBTDecorator_StopAtMidiMsg::SpecifyVelocityRange' has a wrong offset!");

// Class HmxAudio.BTDecorator_StopAtNext
// 0x0018 (0x00A8 - 0x0090)
class UBTDecorator_StopAtNext final : public UBTDecorator_BlackboardBase
{
public:
	EBTLengthType                                 StopAtNext;                                        // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0x17];                                      // 0x0091(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNextBeat(int32 beatNumber, int32 beatInBar);
	void OnNextMeasure(int32 measureNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_StopAtNext">();
	}
	static class UBTDecorator_StopAtNext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_StopAtNext>();
	}
};
static_assert(alignof(UBTDecorator_StopAtNext) == 0x000008, "Wrong alignment on UBTDecorator_StopAtNext");
static_assert(sizeof(UBTDecorator_StopAtNext) == 0x0000A8, "Wrong size on UBTDecorator_StopAtNext");
static_assert(offsetof(UBTDecorator_StopAtNext, StopAtNext) == 0x000090, "Member 'UBTDecorator_StopAtNext::StopAtNext' has a wrong offset!");

// Class HmxAudio.BTTask_WaitForMidiMsg
// 0x0040 (0x00D8 - 0x0098)
class UBTTask_WaitForMidiMsg final : public UBTTask_BlackboardBase
{
public:
	EMidiMsgType                                  MessageType;                                       // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpecificTextMessage;                               // 0x00A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificChannel;                                   // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificNote;                                      // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificVelocityMin;                               // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SpecificVelocityMax;                               // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyTextMessage;                                // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyChannel;                                    // 0x00C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyNote;                                       // 0x00C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpecifyVelocityRange;                              // 0x00C3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C4[0x14];                                      // 0x00C4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNoteOffMessage(const class FString& CursorName, int32 Channel, int32 Note);
	void OnNoteOnMessage(const class FString& CursorName, int32 Channel, int32 Note, int32 Velocity);
	void OnTextMessage(const class FString& CursorName, const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_WaitForMidiMsg">();
	}
	static class UBTTask_WaitForMidiMsg* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_WaitForMidiMsg>();
	}
};
static_assert(alignof(UBTTask_WaitForMidiMsg) == 0x000008, "Wrong alignment on UBTTask_WaitForMidiMsg");
static_assert(sizeof(UBTTask_WaitForMidiMsg) == 0x0000D8, "Wrong size on UBTTask_WaitForMidiMsg");
static_assert(offsetof(UBTTask_WaitForMidiMsg, MessageType) == 0x000098, "Member 'UBTTask_WaitForMidiMsg::MessageType' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecificTextMessage) == 0x0000A0, "Member 'UBTTask_WaitForMidiMsg::SpecificTextMessage' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecificChannel) == 0x0000B0, "Member 'UBTTask_WaitForMidiMsg::SpecificChannel' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecificNote) == 0x0000B4, "Member 'UBTTask_WaitForMidiMsg::SpecificNote' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecificVelocityMin) == 0x0000B8, "Member 'UBTTask_WaitForMidiMsg::SpecificVelocityMin' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecificVelocityMax) == 0x0000BC, "Member 'UBTTask_WaitForMidiMsg::SpecificVelocityMax' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecifyTextMessage) == 0x0000C0, "Member 'UBTTask_WaitForMidiMsg::SpecifyTextMessage' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecifyChannel) == 0x0000C1, "Member 'UBTTask_WaitForMidiMsg::SpecifyChannel' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecifyNote) == 0x0000C2, "Member 'UBTTask_WaitForMidiMsg::SpecifyNote' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForMidiMsg, SpecifyVelocityRange) == 0x0000C3, "Member 'UBTTask_WaitForMidiMsg::SpecifyVelocityRange' has a wrong offset!");

// Class HmxAudio.BTTask_WaitForNext
// 0x0018 (0x00B0 - 0x0098)
class UBTTask_WaitForNext final : public UBTTask_BlackboardBase
{
public:
	EBTLengthType                                 WaitForNext;                                       // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x17];                                      // 0x0099(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNextBeat(int32 beatNumber, int32 beatInBar);
	void OnNextMeasure(int32 measureNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_WaitForNext">();
	}
	static class UBTTask_WaitForNext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_WaitForNext>();
	}
};
static_assert(alignof(UBTTask_WaitForNext) == 0x000008, "Wrong alignment on UBTTask_WaitForNext");
static_assert(sizeof(UBTTask_WaitForNext) == 0x0000B0, "Wrong size on UBTTask_WaitForNext");
static_assert(offsetof(UBTTask_WaitForNext, WaitForNext) == 0x000098, "Member 'UBTTask_WaitForNext::WaitForNext' has a wrong offset!");

// Class HmxAudio.BTTask_WaitForSpan
// 0x0060 (0x00F8 - 0x0098)
class UBTTask_WaitForSpan final : public UBTTask_BlackboardBase
{
public:
	float                                         Length;                                            // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 LengthKey;                                         // 0x00A0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	bool                                          UseLengthFromBlackboard;                           // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ELengthType                                   LengthUnits;                                       // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESynchronizationType                          SynchronizeTo;                                     // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlopWindow;                                        // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x28];                                      // 0x00D0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNextBeat(int32 beatNumber, int32 beatInBar);
	void OnNextMeasure(int32 measureNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_WaitForSpan">();
	}
	static class UBTTask_WaitForSpan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_WaitForSpan>();
	}
};
static_assert(alignof(UBTTask_WaitForSpan) == 0x000008, "Wrong alignment on UBTTask_WaitForSpan");
static_assert(sizeof(UBTTask_WaitForSpan) == 0x0000F8, "Wrong size on UBTTask_WaitForSpan");
static_assert(offsetof(UBTTask_WaitForSpan, Length) == 0x000098, "Member 'UBTTask_WaitForSpan::Length' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForSpan, LengthKey) == 0x0000A0, "Member 'UBTTask_WaitForSpan::LengthKey' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForSpan, UseLengthFromBlackboard) == 0x0000C8, "Member 'UBTTask_WaitForSpan::UseLengthFromBlackboard' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForSpan, LengthUnits) == 0x0000C9, "Member 'UBTTask_WaitForSpan::LengthUnits' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForSpan, SynchronizeTo) == 0x0000CA, "Member 'UBTTask_WaitForSpan::SynchronizeTo' has a wrong offset!");
static_assert(offsetof(UBTTask_WaitForSpan, SlopWindow) == 0x0000CC, "Member 'UBTTask_WaitForSpan::SlopWindow' has a wrong offset!");

// Class HmxAudio.HmxAudioBlueprintUtil
// 0x0000 (0x0028 - 0x0028)
class UHmxAudioBlueprintUtil final : public UBlueprintFunctionLibrary
{
public:
	static float FrequencyToMidiNote(float freq);
	static float GetAudioLatencyMs(class UObject* worldContextObj);
	static class FString GetNoteNameFromNoteNumber(int32 midiNoteNumber);
	static int32 GetNoteNumberFromNoteName(const class FString& Name_0);
	static int32 GetNoteOctaveFromNoteNumber(int32 midiNoteNumber);
	static float GetVideoLatencyMs(class UObject* worldContextObj);
	static void SetAudioLatencyMs(class UObject* worldContextObj, float InAudioLatencyMs);
	static void SetVideoLatencyMs(class UObject* worldContextObj, float InVideoLatencyMs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HmxAudioBlueprintUtil">();
	}
	static class UHmxAudioBlueprintUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHmxAudioBlueprintUtil>();
	}
};
static_assert(alignof(UHmxAudioBlueprintUtil) == 0x000008, "Wrong alignment on UHmxAudioBlueprintUtil");
static_assert(sizeof(UHmxAudioBlueprintUtil) == 0x000028, "Wrong size on UHmxAudioBlueprintUtil");

// Class HmxAudio.MidiNoteFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMidiNoteFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMidiNote ByteToMidiNote(uint8 InByte);
	static struct FMidiNote GetMaxMidiNote();
	static uint8 GetMaxNoteNumber();
	static uint8 GetMaxNoteVelocity();
	static int32 GetMaxNumNotes();
	static struct FMidiNote GetMinMidiNote();
	static uint8 GetMinNoteNumber();
	static uint8 GetMinNoteVelocity();
	static struct FMidiNote IntToMidiNote(int32 inInt);
	static struct FMidiNote MakeLiteralMidiNote(const struct FMidiNote& Value);
	static uint8 MidiNoteToByte(const struct FMidiNote& InMidiNote);
	static int32 MidiNoteToInt(const struct FMidiNote& InMidiNote);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiNoteFunctionLibrary">();
	}
	static class UMidiNoteFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiNoteFunctionLibrary>();
	}
};
static_assert(alignof(UMidiNoteFunctionLibrary) == 0x000008, "Wrong alignment on UMidiNoteFunctionLibrary");
static_assert(sizeof(UMidiNoteFunctionLibrary) == 0x000028, "Wrong size on UMidiNoteFunctionLibrary");

// Class HmxAudio.MusicalTickFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMusicalTickFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float BeatToTick(float inBeat);
	static float GetBeatsPerTick();
	static float GetTicksPerBeat();
	static int32 GetTicksPerBeatInt();
	static float TickToBeat(float inTick);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicalTickFunctionLibrary">();
	}
	static class UMusicalTickFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicalTickFunctionLibrary>();
	}
};
static_assert(alignof(UMusicalTickFunctionLibrary) == 0x000008, "Wrong alignment on UMusicalTickFunctionLibrary");
static_assert(sizeof(UMusicalTickFunctionLibrary) == 0x000028, "Wrong size on UMusicalTickFunctionLibrary");

// Class HmxAudio.TickSpanFuncitonLibrary
// 0x0000 (0x0028 - 0x0028)
class UTickSpanFuncitonLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FTickSpan ClampTickSpan(const struct FTickSpan& Target, const struct FTickSpan& clampSpan);
	static void ClampTickSpanByRef(struct FTickSpan& Target, const struct FTickSpan& clampSpan, struct FTickSpan* Result);
	static float GetEndBeat(const struct FTickSpan& Target);
	static int32 GetEndTick(const struct FTickSpan& Target);
	static float GetLengthBeats(const struct FTickSpan& Target);
	static int32 GetLengthTicks(const struct FTickSpan& Target);
	static float GetOffsetBeat(const struct FTickSpan& Target);
	static int32 GetOffsetTick(const struct FTickSpan& Target);
	static struct FTickSpan MakeTickSpan(int32 Offset, int32 Length);
	static struct FTickSpan MakeTickSpanFromBeats(float Offset, float Length);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TickSpanFuncitonLibrary">();
	}
	static class UTickSpanFuncitonLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTickSpanFuncitonLibrary>();
	}
};
static_assert(alignof(UTickSpanFuncitonLibrary) == 0x000008, "Wrong alignment on UTickSpanFuncitonLibrary");
static_assert(sizeof(UTickSpanFuncitonLibrary) == 0x000028, "Wrong size on UTickSpanFuncitonLibrary");

// Class HmxAudio.MidiMusicChord
// 0x0020 (0x0048 - 0x0028)
class UMidiMusicChord final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMidiNote>                      MidiNotes;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Velocity;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicChord">();
	}
	static class UMidiMusicChord* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiMusicChord>();
	}
};
static_assert(alignof(UMidiMusicChord) == 0x000008, "Wrong alignment on UMidiMusicChord");
static_assert(sizeof(UMidiMusicChord) == 0x000048, "Wrong size on UMidiMusicChord");
static_assert(offsetof(UMidiMusicChord, MidiNotes) == 0x000030, "Member 'UMidiMusicChord::MidiNotes' has a wrong offset!");
static_assert(offsetof(UMidiMusicChord, Velocity) == 0x000040, "Member 'UMidiMusicChord::Velocity' has a wrong offset!");

// Class HmxAudio.MidiMusicMidiFile
// 0x0050 (0x0078 - 0x0028)
class UMidiMusicMidiFile final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMidiFileAsset>          MidiFileAsset;                                     // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TrackId;                                           // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrackIndex;                                        // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTickSpan                              TickSpan;                                          // 0x006C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicMidiFile">();
	}
	static class UMidiMusicMidiFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiMusicMidiFile>();
	}
};
static_assert(alignof(UMidiMusicMidiFile) == 0x000008, "Wrong alignment on UMidiMusicMidiFile");
static_assert(sizeof(UMidiMusicMidiFile) == 0x000078, "Wrong size on UMidiMusicMidiFile");
static_assert(offsetof(UMidiMusicMidiFile, MidiFileAsset) == 0x000030, "Member 'UMidiMusicMidiFile::MidiFileAsset' has a wrong offset!");
static_assert(offsetof(UMidiMusicMidiFile, TrackId) == 0x000058, "Member 'UMidiMusicMidiFile::TrackId' has a wrong offset!");
static_assert(offsetof(UMidiMusicMidiFile, TrackIndex) == 0x000068, "Member 'UMidiMusicMidiFile::TrackIndex' has a wrong offset!");
static_assert(offsetof(UMidiMusicMidiFile, TickSpan) == 0x00006C, "Member 'UMidiMusicMidiFile::TickSpan' has a wrong offset!");

// Class HmxAudio.MidiMusicNote
// 0x0010 (0x0038 - 0x0028)
class UMidiMusicNote final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMidiNote                              MidiNote;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Velocity;                                          // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicNote">();
	}
	static class UMidiMusicNote* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiMusicNote>();
	}
};
static_assert(alignof(UMidiMusicNote) == 0x000008, "Wrong alignment on UMidiMusicNote");
static_assert(sizeof(UMidiMusicNote) == 0x000038, "Wrong size on UMidiMusicNote");
static_assert(offsetof(UMidiMusicNote, MidiNote) == 0x000030, "Member 'UMidiMusicNote::MidiNote' has a wrong offset!");
static_assert(offsetof(UMidiMusicNote, Velocity) == 0x000031, "Member 'UMidiMusicNote::Velocity' has a wrong offset!");

// Class HmxAudio.MidiMusicSequence
// 0x0080 (0x00A8 - 0x0028)
class UMidiMusicSequence final : public UObject
{
public:
	uint8                                         Pad_28[0x70];                                      // 0x0028(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMidiMusicTimeSlot*>             TimeSlots;                                         // 0x0098(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	class UMidiMusicTimeSlot* AppendTimeSlot(const struct FMidiMusicTimeSlotArgs& args);
	class UMidiMusicTimeSlot* InsertTimeSlot(const struct FMidiMusicTimeSlotArgs& args);

	class UMidiMusicTimeSlot* FindTimeSlotAt(int32 Index_0) const;
	class UMidiMusicTimeSlot* FindTimeSlotAtTick(int32 Tick) const;
	class UMidiMusicTimeSlot* GetLastTimeSlot() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicSequence">();
	}
	static class UMidiMusicSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiMusicSequence>();
	}
};
static_assert(alignof(UMidiMusicSequence) == 0x000008, "Wrong alignment on UMidiMusicSequence");
static_assert(sizeof(UMidiMusicSequence) == 0x0000A8, "Wrong size on UMidiMusicSequence");
static_assert(offsetof(UMidiMusicSequence, TimeSlots) == 0x000098, "Member 'UMidiMusicSequence::TimeSlots' has a wrong offset!");

// Class HmxAudio.MidiMusicTimeSlot
// 0x0030 (0x0058 - 0x0028)
class UMidiMusicTimeSlot final : public UObject
{
public:
	struct FTickSpan                              TickSpan;                                          // 0x0028(0x0008)(BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          Enabled;                                           // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x17];                                      // 0x0031(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMidiMusicInterface>   MidiMusicItem;                                     // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetCurrentPage(int32 inCurrentPage);
	void SetEnabled(bool InEnabled);
	void SetLengthTick(int32 inLength);
	void SetMidiMusicItem(TScriptInterface<class IMidiMusicInterface> inMidiMusicItem);
	void SetNumPages(int32 inNumPages);
	void SetOffsetTick(int32 InOffset);
	void SetPages(const TArray<bool>& inPages);
	void SetTickSpan(const struct FTickSpan& inTickSpan);

	int32 GetCurrentPage() const;
	bool GetEnabled() const;
	int32 GetEndBeat() const;
	int32 GetEndTick() const;
	int32 GetIndexInSequence() const;
	int32 GetLengthBeats() const;
	int32 GetLengthTick() const;
	TScriptInterface<class IMidiMusicInterface> GetMidiMusicItem() const;
	int32 GetNumPages() const;
	int32 GetOffsetBeat() const;
	int32 GetOffsetTick() const;
	const TArray<bool> GetPages() const;
	struct FTickSpan GetTickSpan() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiMusicTimeSlot">();
	}
	static class UMidiMusicTimeSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiMusicTimeSlot>();
	}
};
static_assert(alignof(UMidiMusicTimeSlot) == 0x000008, "Wrong alignment on UMidiMusicTimeSlot");
static_assert(sizeof(UMidiMusicTimeSlot) == 0x000058, "Wrong size on UMidiMusicTimeSlot");
static_assert(offsetof(UMidiMusicTimeSlot, TickSpan) == 0x000028, "Member 'UMidiMusicTimeSlot::TickSpan' has a wrong offset!");
static_assert(offsetof(UMidiMusicTimeSlot, Enabled) == 0x000030, "Member 'UMidiMusicTimeSlot::Enabled' has a wrong offset!");
static_assert(offsetof(UMidiMusicTimeSlot, MidiMusicItem) == 0x000048, "Member 'UMidiMusicTimeSlot::MidiMusicItem' has a wrong offset!");

// Class HmxAudio.MusicalGridEvent
// 0x0028 (0x0050 - 0x0028)
class UMusicalGridEvent final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool Cancel();
	float GetProgress();
	void OnTriggered();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicalGridEvent">();
	}
	static class UMusicalGridEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicalGridEvent>();
	}
};
static_assert(alignof(UMusicalGridEvent) == 0x000008, "Wrong alignment on UMusicalGridEvent");
static_assert(sizeof(UMusicalGridEvent) == 0x000050, "Wrong size on UMusicalGridEvent");

// Class HmxAudio.StepSequencerTrack
// 0x00B8 (0x00E0 - 0x0028)
class UStepSequencerTrack final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USynthesizerPatchAssetBase> SynthPatch;                                        // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMidiMusicSequence*                     MidiMusicSequence;                                 // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrackIndex;                                        // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x14];                                      // 0x0064(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UStepSequencerTrack* track)> EventOnNumGridSquaresChanged;                      // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStepSequencerTrack* track, float gridSquareBeats)> EventOnGridSquareBeatsChanged;                     // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStepSequencerTrack* track, int32 currentPage)> EventOnCurrentPageChanged;                         // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStepSequencerTrack* track)> EventOnAnyGridsquareStateChanged;                  // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStepSequencerTrack* track, class UMidiMusicTimeSlot* Slot)> EventOnGridsquareStateChanged;                     // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AppendGridSquares(int32 appendSquares, bool copyStates, bool copyMusicItems);
	void InitGridSquares(int32 inGridSquareNum, int32 inMaxGridSquares, float inGridSquareBeats);
	void OnTimeSlotEnabledChanged(class UMidiMusicTimeSlot* timeSlot);
	void OnTimeSlotMusicItemChanged(class UMidiMusicTimeSlot* timeSlot);
	void OnTimeSlotTimeSpanChanged(class UMidiMusicTimeSlot* timeSlot);
	void PopGridSquares(int32 popSquares);
	void SetCurrentPage(int32 Page);
	void SetGridSquareBeats(float inGridSquareBeats);
	void SetGridSquareState(int32 gridSquareIndex, bool isOn);
	void SetGridSquareStateOnPage(int32 gridSquareIndex, int32 PageIndex, bool isOn);
	void SetMusicItemAtGridSquare(int32 gridSquareIndex, TScriptInterface<class IMidiMusicInterface> MusicItem);
	void SetMusicItemForWholeTrack(TScriptInterface<class IMidiMusicInterface> MusicItem);
	void SetMusicItemsInTrack(const TArray<TScriptInterface<class IMidiMusicInterface>>& musicItems);
	void SetNumPages(int32 inNumPages);
	void ToggleGridSquareState(int32 gridSquareIndex);

	class UMidiMusicTimeSlot* FindGridSquareAtIndex(int32 Index_0) const;
	class UMidiMusicTimeSlot* FindGridSquareAtTick(int32 Tick) const;
	int32 GetEndTick() const;
	int32 GetGridSquareBeats() const;
	bool GetGridSquareState(int32 gridSquareIndex) const;
	int32 GetNumGridSquares() const;
	int32 TicksPerSquare() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StepSequencerTrack">();
	}
	static class UStepSequencerTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStepSequencerTrack>();
	}
};
static_assert(alignof(UStepSequencerTrack) == 0x000008, "Wrong alignment on UStepSequencerTrack");
static_assert(sizeof(UStepSequencerTrack) == 0x0000E0, "Wrong size on UStepSequencerTrack");
static_assert(offsetof(UStepSequencerTrack, SynthPatch) == 0x000030, "Member 'UStepSequencerTrack::SynthPatch' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, MidiMusicSequence) == 0x000058, "Member 'UStepSequencerTrack::MidiMusicSequence' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, TrackIndex) == 0x000060, "Member 'UStepSequencerTrack::TrackIndex' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, EventOnNumGridSquaresChanged) == 0x000078, "Member 'UStepSequencerTrack::EventOnNumGridSquaresChanged' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, EventOnGridSquareBeatsChanged) == 0x000088, "Member 'UStepSequencerTrack::EventOnGridSquareBeatsChanged' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, EventOnCurrentPageChanged) == 0x000098, "Member 'UStepSequencerTrack::EventOnCurrentPageChanged' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, EventOnAnyGridsquareStateChanged) == 0x0000A8, "Member 'UStepSequencerTrack::EventOnAnyGridsquareStateChanged' has a wrong offset!");
static_assert(offsetof(UStepSequencerTrack, EventOnGridsquareStateChanged) == 0x0000B8, "Member 'UStepSequencerTrack::EventOnGridsquareStateChanged' has a wrong offset!");

// Class HmxAudio.HarmonixPlayerComponentBase
// 0x0140 (0x01E0 - 0x00A0)
class UHarmonixPlayerComponentBase : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(bool IsPlaying)> PlayStateEvent;                                    // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool IsTriggered)> TriggerStateEvent;                                 // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FStartCondition                        StartCondition;                                    // 0x00C0(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EAudioClipStartPosition                       StartPosition;                                     // 0x00D0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TickOffset;                                        // 0x00D4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EWaitAtLeastMode                              AtLeastMode;                                       // 0x00D8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitAtLeast;                                       // 0x00DC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayEmitterFindMethod                        PlayEmitterSpec;                                   // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PlayEmitterObj;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PlayEmitterTag;                                    // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESyncEmitterFindMethod                        syncEmitterSpec;                                   // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SyncEmitterObj;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMusicPlayerComponentBase*              syncClip;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SyncEmitterTag;                                    // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Gain;                                              // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Volume;                                            // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VolumeTransitionTime;                              // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          mute;                                              // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAudioParam>                    Parameters;                                        // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMusicalPlayerRuntimeState             RuntimeState;                                      // 0x0140(0x0014)(Edit, DisableEditOnTemplate, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0x8C];                                     // 0x0154(0x008C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool Continue();
	void FadeAndStop(float Seconds);
	class UHarmonixHandle* GetHarmonixHandle();
	class UMusicPlayerComponentBase* GetSyncClip(class UHarmonixPlayerComponentBase* syncClip_0);
	bool Pause();
	void SetGain(float Gain_0);
	void SetMute(bool mute_0);
	bool SetParameterValue(class FName Name_0, float Value);
	void SetPlayEmitterFindMethod(EPlayEmitterFindMethod Method);
	void SetStartPosition(EAudioClipStartPosition Pos);
	void SetSyncClip(class UMusicPlayerComponentBase* syncClip_0);
	void SetSyncEmitterSpec(ESyncEmitterFindMethod syncEmitterSpec_0);
	void SetTickOffset(int32 Tick);
	void SetVolume(float Volume_0);
	bool Stop();
	bool Trigger();

	float GetElapsedMs() const;
	bool GetParameterValue(class FName Name_0, float* Value) const;
	float GetSecsUntilNextPlay() const;
	EAudioClipStartPosition GetStartPosition() const;
	ESyncEmitterFindMethod GetSyncEmitterSpec() const;
	int32 GetTickOffset() const;
	bool IsFinished() const;
	bool IsNotPlaying() const;
	bool IsPaused() const;
	bool IsPlaying() const;
	bool IsStarted() const;
	bool IsTriggered() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixPlayerComponentBase">();
	}
	static class UHarmonixPlayerComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixPlayerComponentBase>();
	}
};
static_assert(alignof(UHarmonixPlayerComponentBase) == 0x000008, "Wrong alignment on UHarmonixPlayerComponentBase");
static_assert(sizeof(UHarmonixPlayerComponentBase) == 0x0001E0, "Wrong size on UHarmonixPlayerComponentBase");
static_assert(offsetof(UHarmonixPlayerComponentBase, PlayStateEvent) == 0x0000A0, "Member 'UHarmonixPlayerComponentBase::PlayStateEvent' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, TriggerStateEvent) == 0x0000B0, "Member 'UHarmonixPlayerComponentBase::TriggerStateEvent' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, StartCondition) == 0x0000C0, "Member 'UHarmonixPlayerComponentBase::StartCondition' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, StartPosition) == 0x0000D0, "Member 'UHarmonixPlayerComponentBase::StartPosition' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, TickOffset) == 0x0000D4, "Member 'UHarmonixPlayerComponentBase::TickOffset' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, AtLeastMode) == 0x0000D8, "Member 'UHarmonixPlayerComponentBase::AtLeastMode' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, WaitAtLeast) == 0x0000DC, "Member 'UHarmonixPlayerComponentBase::WaitAtLeast' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, PlayEmitterSpec) == 0x0000E0, "Member 'UHarmonixPlayerComponentBase::PlayEmitterSpec' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, PlayEmitterObj) == 0x0000E8, "Member 'UHarmonixPlayerComponentBase::PlayEmitterObj' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, PlayEmitterTag) == 0x0000F0, "Member 'UHarmonixPlayerComponentBase::PlayEmitterTag' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, syncEmitterSpec) == 0x0000F4, "Member 'UHarmonixPlayerComponentBase::syncEmitterSpec' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, SyncEmitterObj) == 0x0000F8, "Member 'UHarmonixPlayerComponentBase::SyncEmitterObj' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, syncClip) == 0x000100, "Member 'UHarmonixPlayerComponentBase::syncClip' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, SyncEmitterTag) == 0x000108, "Member 'UHarmonixPlayerComponentBase::SyncEmitterTag' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, Gain) == 0x00010C, "Member 'UHarmonixPlayerComponentBase::Gain' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, Volume) == 0x000110, "Member 'UHarmonixPlayerComponentBase::Volume' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, VolumeTransitionTime) == 0x000114, "Member 'UHarmonixPlayerComponentBase::VolumeTransitionTime' has a wrong offset!");
static_assert(offsetof(UHarmonixPlayerComponentBase, mute) == 0x000118, "Member 'UHarmonixPlayerComponentBase::mute' has a wrong offset!");
