#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxAudio

#include "Basic.hpp"

#include "HmxAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "HmxCore_structs.hpp"


namespace SDK::Params
{

// Function HmxAudio.MusicAssetBase.GetLengthMs
// 0x0004 (0x0004 - 0x0000)
struct MusicAssetBase_GetLengthMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MusicAssetBase_GetLengthMs) == 0x000004, "Wrong alignment on MusicAssetBase_GetLengthMs");
static_assert(sizeof(MusicAssetBase_GetLengthMs) == 0x000004, "Wrong size on MusicAssetBase_GetLengthMs");
static_assert(offsetof(MusicAssetBase_GetLengthMs, ReturnValue) == 0x000000, "Member 'MusicAssetBase_GetLengthMs::ReturnValue' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAfterSpan.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTDecorator_StopAfterSpan_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTDecorator_StopAfterSpan_OnNextBeat) == 0x000004, "Wrong alignment on BTDecorator_StopAfterSpan_OnNextBeat");
static_assert(sizeof(BTDecorator_StopAfterSpan_OnNextBeat) == 0x000008, "Wrong size on BTDecorator_StopAfterSpan_OnNextBeat");
static_assert(offsetof(BTDecorator_StopAfterSpan_OnNextBeat, beatNumber) == 0x000000, "Member 'BTDecorator_StopAfterSpan_OnNextBeat::beatNumber' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAfterSpan_OnNextBeat, beatInBar) == 0x000004, "Member 'BTDecorator_StopAfterSpan_OnNextBeat::beatInBar' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAfterSpan.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTDecorator_StopAfterSpan_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTDecorator_StopAfterSpan_OnNextMeasure) == 0x000004, "Wrong alignment on BTDecorator_StopAfterSpan_OnNextMeasure");
static_assert(sizeof(BTDecorator_StopAfterSpan_OnNextMeasure) == 0x000004, "Wrong size on BTDecorator_StopAfterSpan_OnNextMeasure");
static_assert(offsetof(BTDecorator_StopAfterSpan_OnNextMeasure, measureNumber) == 0x000000, "Member 'BTDecorator_StopAfterSpan_OnNextMeasure::measureNumber' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAtMidiMsg.OnNoteOffMessage
// 0x0018 (0x0018 - 0x0000)
struct BTDecorator_StopAtMidiMsg_OnNoteOffMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTDecorator_StopAtMidiMsg_OnNoteOffMessage) == 0x000008, "Wrong alignment on BTDecorator_StopAtMidiMsg_OnNoteOffMessage");
static_assert(sizeof(BTDecorator_StopAtMidiMsg_OnNoteOffMessage) == 0x000018, "Wrong size on BTDecorator_StopAtMidiMsg_OnNoteOffMessage");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOffMessage, CursorName) == 0x000000, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOffMessage::CursorName' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOffMessage, Channel) == 0x000010, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOffMessage::Channel' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOffMessage, Note) == 0x000014, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOffMessage::Note' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAtMidiMsg.OnNoteOnMessage
// 0x0020 (0x0020 - 0x0000)
struct BTDecorator_StopAtMidiMsg_OnNoteOnMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BTDecorator_StopAtMidiMsg_OnNoteOnMessage) == 0x000008, "Wrong alignment on BTDecorator_StopAtMidiMsg_OnNoteOnMessage");
static_assert(sizeof(BTDecorator_StopAtMidiMsg_OnNoteOnMessage) == 0x000020, "Wrong size on BTDecorator_StopAtMidiMsg_OnNoteOnMessage");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOnMessage, CursorName) == 0x000000, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOnMessage::CursorName' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOnMessage, Channel) == 0x000010, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOnMessage::Channel' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOnMessage, Note) == 0x000014, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOnMessage::Note' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnNoteOnMessage, Velocity) == 0x000018, "Member 'BTDecorator_StopAtMidiMsg_OnNoteOnMessage::Velocity' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAtMidiMsg.OnTextMessage
// 0x0020 (0x0020 - 0x0000)
struct BTDecorator_StopAtMidiMsg_OnTextMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTDecorator_StopAtMidiMsg_OnTextMessage) == 0x000008, "Wrong alignment on BTDecorator_StopAtMidiMsg_OnTextMessage");
static_assert(sizeof(BTDecorator_StopAtMidiMsg_OnTextMessage) == 0x000020, "Wrong size on BTDecorator_StopAtMidiMsg_OnTextMessage");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnTextMessage, CursorName) == 0x000000, "Member 'BTDecorator_StopAtMidiMsg_OnTextMessage::CursorName' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtMidiMsg_OnTextMessage, Text) == 0x000010, "Member 'BTDecorator_StopAtMidiMsg_OnTextMessage::Text' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAtNext.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTDecorator_StopAtNext_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTDecorator_StopAtNext_OnNextBeat) == 0x000004, "Wrong alignment on BTDecorator_StopAtNext_OnNextBeat");
static_assert(sizeof(BTDecorator_StopAtNext_OnNextBeat) == 0x000008, "Wrong size on BTDecorator_StopAtNext_OnNextBeat");
static_assert(offsetof(BTDecorator_StopAtNext_OnNextBeat, beatNumber) == 0x000000, "Member 'BTDecorator_StopAtNext_OnNextBeat::beatNumber' has a wrong offset!");
static_assert(offsetof(BTDecorator_StopAtNext_OnNextBeat, beatInBar) == 0x000004, "Member 'BTDecorator_StopAtNext_OnNextBeat::beatInBar' has a wrong offset!");

// Function HmxAudio.BTDecorator_StopAtNext.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTDecorator_StopAtNext_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTDecorator_StopAtNext_OnNextMeasure) == 0x000004, "Wrong alignment on BTDecorator_StopAtNext_OnNextMeasure");
static_assert(sizeof(BTDecorator_StopAtNext_OnNextMeasure) == 0x000004, "Wrong size on BTDecorator_StopAtNext_OnNextMeasure");
static_assert(offsetof(BTDecorator_StopAtNext_OnNextMeasure, measureNumber) == 0x000000, "Member 'BTDecorator_StopAtNext_OnNextMeasure::measureNumber' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForMidiMsg.OnNoteOffMessage
// 0x0018 (0x0018 - 0x0000)
struct BTTask_WaitForMidiMsg_OnNoteOffMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTTask_WaitForMidiMsg_OnNoteOffMessage) == 0x000008, "Wrong alignment on BTTask_WaitForMidiMsg_OnNoteOffMessage");
static_assert(sizeof(BTTask_WaitForMidiMsg_OnNoteOffMessage) == 0x000018, "Wrong size on BTTask_WaitForMidiMsg_OnNoteOffMessage");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOffMessage, CursorName) == 0x000000, "Member 'BTTask_WaitForMidiMsg_OnNoteOffMessage::CursorName' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOffMessage, Channel) == 0x000010, "Member 'BTTask_WaitForMidiMsg_OnNoteOffMessage::Channel' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOffMessage, Note) == 0x000014, "Member 'BTTask_WaitForMidiMsg_OnNoteOffMessage::Note' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForMidiMsg.OnNoteOnMessage
// 0x0020 (0x0020 - 0x0000)
struct BTTask_WaitForMidiMsg_OnNoteOnMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BTTask_WaitForMidiMsg_OnNoteOnMessage) == 0x000008, "Wrong alignment on BTTask_WaitForMidiMsg_OnNoteOnMessage");
static_assert(sizeof(BTTask_WaitForMidiMsg_OnNoteOnMessage) == 0x000020, "Wrong size on BTTask_WaitForMidiMsg_OnNoteOnMessage");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOnMessage, CursorName) == 0x000000, "Member 'BTTask_WaitForMidiMsg_OnNoteOnMessage::CursorName' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOnMessage, Channel) == 0x000010, "Member 'BTTask_WaitForMidiMsg_OnNoteOnMessage::Channel' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOnMessage, Note) == 0x000014, "Member 'BTTask_WaitForMidiMsg_OnNoteOnMessage::Note' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnNoteOnMessage, Velocity) == 0x000018, "Member 'BTTask_WaitForMidiMsg_OnNoteOnMessage::Velocity' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForMidiMsg.OnTextMessage
// 0x0020 (0x0020 - 0x0000)
struct BTTask_WaitForMidiMsg_OnTextMessage final
{
public:
	class FString                                 CursorName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTTask_WaitForMidiMsg_OnTextMessage) == 0x000008, "Wrong alignment on BTTask_WaitForMidiMsg_OnTextMessage");
static_assert(sizeof(BTTask_WaitForMidiMsg_OnTextMessage) == 0x000020, "Wrong size on BTTask_WaitForMidiMsg_OnTextMessage");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnTextMessage, CursorName) == 0x000000, "Member 'BTTask_WaitForMidiMsg_OnTextMessage::CursorName' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForMidiMsg_OnTextMessage, Text) == 0x000010, "Member 'BTTask_WaitForMidiMsg_OnTextMessage::Text' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForNext.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTTask_WaitForNext_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTTask_WaitForNext_OnNextBeat) == 0x000004, "Wrong alignment on BTTask_WaitForNext_OnNextBeat");
static_assert(sizeof(BTTask_WaitForNext_OnNextBeat) == 0x000008, "Wrong size on BTTask_WaitForNext_OnNextBeat");
static_assert(offsetof(BTTask_WaitForNext_OnNextBeat, beatNumber) == 0x000000, "Member 'BTTask_WaitForNext_OnNextBeat::beatNumber' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForNext_OnNextBeat, beatInBar) == 0x000004, "Member 'BTTask_WaitForNext_OnNextBeat::beatInBar' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForNext.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTTask_WaitForNext_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTTask_WaitForNext_OnNextMeasure) == 0x000004, "Wrong alignment on BTTask_WaitForNext_OnNextMeasure");
static_assert(sizeof(BTTask_WaitForNext_OnNextMeasure) == 0x000004, "Wrong size on BTTask_WaitForNext_OnNextMeasure");
static_assert(offsetof(BTTask_WaitForNext_OnNextMeasure, measureNumber) == 0x000000, "Member 'BTTask_WaitForNext_OnNextMeasure::measureNumber' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForSpan.OnNextBeat
// 0x0008 (0x0008 - 0x0000)
struct BTTask_WaitForSpan_OnNextBeat final
{
public:
	int32                                         beatNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         beatInBar;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTTask_WaitForSpan_OnNextBeat) == 0x000004, "Wrong alignment on BTTask_WaitForSpan_OnNextBeat");
static_assert(sizeof(BTTask_WaitForSpan_OnNextBeat) == 0x000008, "Wrong size on BTTask_WaitForSpan_OnNextBeat");
static_assert(offsetof(BTTask_WaitForSpan_OnNextBeat, beatNumber) == 0x000000, "Member 'BTTask_WaitForSpan_OnNextBeat::beatNumber' has a wrong offset!");
static_assert(offsetof(BTTask_WaitForSpan_OnNextBeat, beatInBar) == 0x000004, "Member 'BTTask_WaitForSpan_OnNextBeat::beatInBar' has a wrong offset!");

// Function HmxAudio.BTTask_WaitForSpan.OnNextMeasure
// 0x0004 (0x0004 - 0x0000)
struct BTTask_WaitForSpan_OnNextMeasure final
{
public:
	int32                                         measureNumber;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTTask_WaitForSpan_OnNextMeasure) == 0x000004, "Wrong alignment on BTTask_WaitForSpan_OnNextMeasure");
static_assert(sizeof(BTTask_WaitForSpan_OnNextMeasure) == 0x000004, "Wrong size on BTTask_WaitForSpan_OnNextMeasure");
static_assert(offsetof(BTTask_WaitForSpan_OnNextMeasure, measureNumber) == 0x000000, "Member 'BTTask_WaitForSpan_OnNextMeasure::measureNumber' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.FrequencyToMidiNote
// 0x0008 (0x0008 - 0x0000)
struct HmxAudioBlueprintUtil_FrequencyToMidiNote final
{
public:
	float                                         freq;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HmxAudioBlueprintUtil_FrequencyToMidiNote) == 0x000004, "Wrong alignment on HmxAudioBlueprintUtil_FrequencyToMidiNote");
static_assert(sizeof(HmxAudioBlueprintUtil_FrequencyToMidiNote) == 0x000008, "Wrong size on HmxAudioBlueprintUtil_FrequencyToMidiNote");
static_assert(offsetof(HmxAudioBlueprintUtil_FrequencyToMidiNote, freq) == 0x000000, "Member 'HmxAudioBlueprintUtil_FrequencyToMidiNote::freq' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_FrequencyToMidiNote, ReturnValue) == 0x000004, "Member 'HmxAudioBlueprintUtil_FrequencyToMidiNote::ReturnValue' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.GetAudioLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_GetAudioLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HmxAudioBlueprintUtil_GetAudioLatencyMs) == 0x000008, "Wrong alignment on HmxAudioBlueprintUtil_GetAudioLatencyMs");
static_assert(sizeof(HmxAudioBlueprintUtil_GetAudioLatencyMs) == 0x000010, "Wrong size on HmxAudioBlueprintUtil_GetAudioLatencyMs");
static_assert(offsetof(HmxAudioBlueprintUtil_GetAudioLatencyMs, worldContextObj) == 0x000000, "Member 'HmxAudioBlueprintUtil_GetAudioLatencyMs::worldContextObj' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_GetAudioLatencyMs, ReturnValue) == 0x000008, "Member 'HmxAudioBlueprintUtil_GetAudioLatencyMs::ReturnValue' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.GetNoteNameFromNoteNumber
// 0x0018 (0x0018 - 0x0000)
struct HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber final
{
public:
	int32                                         midiNoteNumber;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber) == 0x000008, "Wrong alignment on HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber");
static_assert(sizeof(HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber) == 0x000018, "Wrong size on HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber");
static_assert(offsetof(HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber, midiNoteNumber) == 0x000000, "Member 'HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber::midiNoteNumber' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber, ReturnValue) == 0x000008, "Member 'HmxAudioBlueprintUtil_GetNoteNameFromNoteNumber::ReturnValue' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.GetNoteNumberFromNoteName
// 0x0018 (0x0018 - 0x0000)
struct HmxAudioBlueprintUtil_GetNoteNumberFromNoteName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HmxAudioBlueprintUtil_GetNoteNumberFromNoteName) == 0x000008, "Wrong alignment on HmxAudioBlueprintUtil_GetNoteNumberFromNoteName");
static_assert(sizeof(HmxAudioBlueprintUtil_GetNoteNumberFromNoteName) == 0x000018, "Wrong size on HmxAudioBlueprintUtil_GetNoteNumberFromNoteName");
static_assert(offsetof(HmxAudioBlueprintUtil_GetNoteNumberFromNoteName, Name_0) == 0x000000, "Member 'HmxAudioBlueprintUtil_GetNoteNumberFromNoteName::Name_0' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_GetNoteNumberFromNoteName, ReturnValue) == 0x000010, "Member 'HmxAudioBlueprintUtil_GetNoteNumberFromNoteName::ReturnValue' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.GetNoteOctaveFromNoteNumber
// 0x0008 (0x0008 - 0x0000)
struct HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber final
{
public:
	int32                                         midiNoteNumber;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber) == 0x000004, "Wrong alignment on HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber");
static_assert(sizeof(HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber) == 0x000008, "Wrong size on HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber");
static_assert(offsetof(HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber, midiNoteNumber) == 0x000000, "Member 'HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber::midiNoteNumber' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber, ReturnValue) == 0x000004, "Member 'HmxAudioBlueprintUtil_GetNoteOctaveFromNoteNumber::ReturnValue' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.GetVideoLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_GetVideoLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HmxAudioBlueprintUtil_GetVideoLatencyMs) == 0x000008, "Wrong alignment on HmxAudioBlueprintUtil_GetVideoLatencyMs");
static_assert(sizeof(HmxAudioBlueprintUtil_GetVideoLatencyMs) == 0x000010, "Wrong size on HmxAudioBlueprintUtil_GetVideoLatencyMs");
static_assert(offsetof(HmxAudioBlueprintUtil_GetVideoLatencyMs, worldContextObj) == 0x000000, "Member 'HmxAudioBlueprintUtil_GetVideoLatencyMs::worldContextObj' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_GetVideoLatencyMs, ReturnValue) == 0x000008, "Member 'HmxAudioBlueprintUtil_GetVideoLatencyMs::ReturnValue' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.SetAudioLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_SetAudioLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAudioLatencyMs;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HmxAudioBlueprintUtil_SetAudioLatencyMs) == 0x000008, "Wrong alignment on HmxAudioBlueprintUtil_SetAudioLatencyMs");
static_assert(sizeof(HmxAudioBlueprintUtil_SetAudioLatencyMs) == 0x000010, "Wrong size on HmxAudioBlueprintUtil_SetAudioLatencyMs");
static_assert(offsetof(HmxAudioBlueprintUtil_SetAudioLatencyMs, worldContextObj) == 0x000000, "Member 'HmxAudioBlueprintUtil_SetAudioLatencyMs::worldContextObj' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_SetAudioLatencyMs, InAudioLatencyMs) == 0x000008, "Member 'HmxAudioBlueprintUtil_SetAudioLatencyMs::InAudioLatencyMs' has a wrong offset!");

// Function HmxAudio.HmxAudioBlueprintUtil.SetVideoLatencyMs
// 0x0010 (0x0010 - 0x0000)
struct HmxAudioBlueprintUtil_SetVideoLatencyMs final
{
public:
	class UObject*                                worldContextObj;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVideoLatencyMs;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HmxAudioBlueprintUtil_SetVideoLatencyMs) == 0x000008, "Wrong alignment on HmxAudioBlueprintUtil_SetVideoLatencyMs");
static_assert(sizeof(HmxAudioBlueprintUtil_SetVideoLatencyMs) == 0x000010, "Wrong size on HmxAudioBlueprintUtil_SetVideoLatencyMs");
static_assert(offsetof(HmxAudioBlueprintUtil_SetVideoLatencyMs, worldContextObj) == 0x000000, "Member 'HmxAudioBlueprintUtil_SetVideoLatencyMs::worldContextObj' has a wrong offset!");
static_assert(offsetof(HmxAudioBlueprintUtil_SetVideoLatencyMs, InVideoLatencyMs) == 0x000008, "Member 'HmxAudioBlueprintUtil_SetVideoLatencyMs::InVideoLatencyMs' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.ByteToMidiNote
// 0x0002 (0x0002 - 0x0000)
struct MidiNoteFunctionLibrary_ByteToMidiNote final
{
public:
	uint8                                         InByte;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_ByteToMidiNote) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_ByteToMidiNote");
static_assert(sizeof(MidiNoteFunctionLibrary_ByteToMidiNote) == 0x000002, "Wrong size on MidiNoteFunctionLibrary_ByteToMidiNote");
static_assert(offsetof(MidiNoteFunctionLibrary_ByteToMidiNote, InByte) == 0x000000, "Member 'MidiNoteFunctionLibrary_ByteToMidiNote::InByte' has a wrong offset!");
static_assert(offsetof(MidiNoteFunctionLibrary_ByteToMidiNote, ReturnValue) == 0x000001, "Member 'MidiNoteFunctionLibrary_ByteToMidiNote::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxMidiNote
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxMidiNote final
{
public:
	struct FMidiNote                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMaxMidiNote) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_GetMaxMidiNote");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMaxMidiNote) == 0x000001, "Wrong size on MidiNoteFunctionLibrary_GetMaxMidiNote");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMaxMidiNote, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMaxMidiNote::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxNoteNumber
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxNoteNumber final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMaxNoteNumber) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_GetMaxNoteNumber");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMaxNoteNumber) == 0x000001, "Wrong size on MidiNoteFunctionLibrary_GetMaxNoteNumber");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMaxNoteNumber, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMaxNoteNumber::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxNoteVelocity
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxNoteVelocity final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMaxNoteVelocity) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_GetMaxNoteVelocity");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMaxNoteVelocity) == 0x000001, "Wrong size on MidiNoteFunctionLibrary_GetMaxNoteVelocity");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMaxNoteVelocity, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMaxNoteVelocity::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMaxNumNotes
// 0x0004 (0x0004 - 0x0000)
struct MidiNoteFunctionLibrary_GetMaxNumNotes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMaxNumNotes) == 0x000004, "Wrong alignment on MidiNoteFunctionLibrary_GetMaxNumNotes");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMaxNumNotes) == 0x000004, "Wrong size on MidiNoteFunctionLibrary_GetMaxNumNotes");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMaxNumNotes, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMaxNumNotes::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMinMidiNote
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMinMidiNote final
{
public:
	struct FMidiNote                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMinMidiNote) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_GetMinMidiNote");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMinMidiNote) == 0x000001, "Wrong size on MidiNoteFunctionLibrary_GetMinMidiNote");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMinMidiNote, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMinMidiNote::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMinNoteNumber
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMinNoteNumber final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMinNoteNumber) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_GetMinNoteNumber");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMinNoteNumber) == 0x000001, "Wrong size on MidiNoteFunctionLibrary_GetMinNoteNumber");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMinNoteNumber, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMinNoteNumber::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.GetMinNoteVelocity
// 0x0001 (0x0001 - 0x0000)
struct MidiNoteFunctionLibrary_GetMinNoteVelocity final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_GetMinNoteVelocity) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_GetMinNoteVelocity");
static_assert(sizeof(MidiNoteFunctionLibrary_GetMinNoteVelocity) == 0x000001, "Wrong size on MidiNoteFunctionLibrary_GetMinNoteVelocity");
static_assert(offsetof(MidiNoteFunctionLibrary_GetMinNoteVelocity, ReturnValue) == 0x000000, "Member 'MidiNoteFunctionLibrary_GetMinNoteVelocity::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.IntToMidiNote
// 0x0008 (0x0008 - 0x0000)
struct MidiNoteFunctionLibrary_IntToMidiNote final
{
public:
	int32                                         inInt;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MidiNoteFunctionLibrary_IntToMidiNote) == 0x000004, "Wrong alignment on MidiNoteFunctionLibrary_IntToMidiNote");
static_assert(sizeof(MidiNoteFunctionLibrary_IntToMidiNote) == 0x000008, "Wrong size on MidiNoteFunctionLibrary_IntToMidiNote");
static_assert(offsetof(MidiNoteFunctionLibrary_IntToMidiNote, inInt) == 0x000000, "Member 'MidiNoteFunctionLibrary_IntToMidiNote::inInt' has a wrong offset!");
static_assert(offsetof(MidiNoteFunctionLibrary_IntToMidiNote, ReturnValue) == 0x000004, "Member 'MidiNoteFunctionLibrary_IntToMidiNote::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.MakeLiteralMidiNote
// 0x0002 (0x0002 - 0x0000)
struct MidiNoteFunctionLibrary_MakeLiteralMidiNote final
{
public:
	struct FMidiNote                              Value;                                             // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_MakeLiteralMidiNote) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_MakeLiteralMidiNote");
static_assert(sizeof(MidiNoteFunctionLibrary_MakeLiteralMidiNote) == 0x000002, "Wrong size on MidiNoteFunctionLibrary_MakeLiteralMidiNote");
static_assert(offsetof(MidiNoteFunctionLibrary_MakeLiteralMidiNote, Value) == 0x000000, "Member 'MidiNoteFunctionLibrary_MakeLiteralMidiNote::Value' has a wrong offset!");
static_assert(offsetof(MidiNoteFunctionLibrary_MakeLiteralMidiNote, ReturnValue) == 0x000001, "Member 'MidiNoteFunctionLibrary_MakeLiteralMidiNote::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.MidiNoteToByte
// 0x0002 (0x0002 - 0x0000)
struct MidiNoteFunctionLibrary_MidiNoteToByte final
{
public:
	struct FMidiNote                              InMidiNote;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_MidiNoteToByte) == 0x000001, "Wrong alignment on MidiNoteFunctionLibrary_MidiNoteToByte");
static_assert(sizeof(MidiNoteFunctionLibrary_MidiNoteToByte) == 0x000002, "Wrong size on MidiNoteFunctionLibrary_MidiNoteToByte");
static_assert(offsetof(MidiNoteFunctionLibrary_MidiNoteToByte, InMidiNote) == 0x000000, "Member 'MidiNoteFunctionLibrary_MidiNoteToByte::InMidiNote' has a wrong offset!");
static_assert(offsetof(MidiNoteFunctionLibrary_MidiNoteToByte, ReturnValue) == 0x000001, "Member 'MidiNoteFunctionLibrary_MidiNoteToByte::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiNoteFunctionLibrary.MidiNoteToInt
// 0x0008 (0x0008 - 0x0000)
struct MidiNoteFunctionLibrary_MidiNoteToInt final
{
public:
	struct FMidiNote                              InMidiNote;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MidiNoteFunctionLibrary_MidiNoteToInt) == 0x000004, "Wrong alignment on MidiNoteFunctionLibrary_MidiNoteToInt");
static_assert(sizeof(MidiNoteFunctionLibrary_MidiNoteToInt) == 0x000008, "Wrong size on MidiNoteFunctionLibrary_MidiNoteToInt");
static_assert(offsetof(MidiNoteFunctionLibrary_MidiNoteToInt, InMidiNote) == 0x000000, "Member 'MidiNoteFunctionLibrary_MidiNoteToInt::InMidiNote' has a wrong offset!");
static_assert(offsetof(MidiNoteFunctionLibrary_MidiNoteToInt, ReturnValue) == 0x000004, "Member 'MidiNoteFunctionLibrary_MidiNoteToInt::ReturnValue' has a wrong offset!");

// Function HmxAudio.MusicalTickFunctionLibrary.BeatToTick
// 0x0008 (0x0008 - 0x0000)
struct MusicalTickFunctionLibrary_BeatToTick final
{
public:
	float                                         inBeat;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MusicalTickFunctionLibrary_BeatToTick) == 0x000004, "Wrong alignment on MusicalTickFunctionLibrary_BeatToTick");
static_assert(sizeof(MusicalTickFunctionLibrary_BeatToTick) == 0x000008, "Wrong size on MusicalTickFunctionLibrary_BeatToTick");
static_assert(offsetof(MusicalTickFunctionLibrary_BeatToTick, inBeat) == 0x000000, "Member 'MusicalTickFunctionLibrary_BeatToTick::inBeat' has a wrong offset!");
static_assert(offsetof(MusicalTickFunctionLibrary_BeatToTick, ReturnValue) == 0x000004, "Member 'MusicalTickFunctionLibrary_BeatToTick::ReturnValue' has a wrong offset!");

// Function HmxAudio.MusicalTickFunctionLibrary.GetBeatsPerTick
// 0x0004 (0x0004 - 0x0000)
struct MusicalTickFunctionLibrary_GetBeatsPerTick final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MusicalTickFunctionLibrary_GetBeatsPerTick) == 0x000004, "Wrong alignment on MusicalTickFunctionLibrary_GetBeatsPerTick");
static_assert(sizeof(MusicalTickFunctionLibrary_GetBeatsPerTick) == 0x000004, "Wrong size on MusicalTickFunctionLibrary_GetBeatsPerTick");
static_assert(offsetof(MusicalTickFunctionLibrary_GetBeatsPerTick, ReturnValue) == 0x000000, "Member 'MusicalTickFunctionLibrary_GetBeatsPerTick::ReturnValue' has a wrong offset!");

// Function HmxAudio.MusicalTickFunctionLibrary.GetTicksPerBeat
// 0x0004 (0x0004 - 0x0000)
struct MusicalTickFunctionLibrary_GetTicksPerBeat final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MusicalTickFunctionLibrary_GetTicksPerBeat) == 0x000004, "Wrong alignment on MusicalTickFunctionLibrary_GetTicksPerBeat");
static_assert(sizeof(MusicalTickFunctionLibrary_GetTicksPerBeat) == 0x000004, "Wrong size on MusicalTickFunctionLibrary_GetTicksPerBeat");
static_assert(offsetof(MusicalTickFunctionLibrary_GetTicksPerBeat, ReturnValue) == 0x000000, "Member 'MusicalTickFunctionLibrary_GetTicksPerBeat::ReturnValue' has a wrong offset!");

// Function HmxAudio.MusicalTickFunctionLibrary.GetTicksPerBeatInt
// 0x0004 (0x0004 - 0x0000)
struct MusicalTickFunctionLibrary_GetTicksPerBeatInt final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MusicalTickFunctionLibrary_GetTicksPerBeatInt) == 0x000004, "Wrong alignment on MusicalTickFunctionLibrary_GetTicksPerBeatInt");
static_assert(sizeof(MusicalTickFunctionLibrary_GetTicksPerBeatInt) == 0x000004, "Wrong size on MusicalTickFunctionLibrary_GetTicksPerBeatInt");
static_assert(offsetof(MusicalTickFunctionLibrary_GetTicksPerBeatInt, ReturnValue) == 0x000000, "Member 'MusicalTickFunctionLibrary_GetTicksPerBeatInt::ReturnValue' has a wrong offset!");

// Function HmxAudio.MusicalTickFunctionLibrary.TickToBeat
// 0x0008 (0x0008 - 0x0000)
struct MusicalTickFunctionLibrary_TickToBeat final
{
public:
	float                                         inTick;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MusicalTickFunctionLibrary_TickToBeat) == 0x000004, "Wrong alignment on MusicalTickFunctionLibrary_TickToBeat");
static_assert(sizeof(MusicalTickFunctionLibrary_TickToBeat) == 0x000008, "Wrong size on MusicalTickFunctionLibrary_TickToBeat");
static_assert(offsetof(MusicalTickFunctionLibrary_TickToBeat, inTick) == 0x000000, "Member 'MusicalTickFunctionLibrary_TickToBeat::inTick' has a wrong offset!");
static_assert(offsetof(MusicalTickFunctionLibrary_TickToBeat, ReturnValue) == 0x000004, "Member 'MusicalTickFunctionLibrary_TickToBeat::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.ClampTickSpan
// 0x0018 (0x0018 - 0x0000)
struct TickSpanFuncitonLibrary_ClampTickSpan final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              clampSpan;                                         // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_ClampTickSpan) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_ClampTickSpan");
static_assert(sizeof(TickSpanFuncitonLibrary_ClampTickSpan) == 0x000018, "Wrong size on TickSpanFuncitonLibrary_ClampTickSpan");
static_assert(offsetof(TickSpanFuncitonLibrary_ClampTickSpan, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_ClampTickSpan::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_ClampTickSpan, clampSpan) == 0x000008, "Member 'TickSpanFuncitonLibrary_ClampTickSpan::clampSpan' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_ClampTickSpan, ReturnValue) == 0x000010, "Member 'TickSpanFuncitonLibrary_ClampTickSpan::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.ClampTickSpanByRef
// 0x0018 (0x0018 - 0x0000)
struct TickSpanFuncitonLibrary_ClampTickSpanByRef final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              clampSpan;                                         // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTickSpan                              Result;                                            // 0x0010(0x0008)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_ClampTickSpanByRef) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_ClampTickSpanByRef");
static_assert(sizeof(TickSpanFuncitonLibrary_ClampTickSpanByRef) == 0x000018, "Wrong size on TickSpanFuncitonLibrary_ClampTickSpanByRef");
static_assert(offsetof(TickSpanFuncitonLibrary_ClampTickSpanByRef, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_ClampTickSpanByRef::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_ClampTickSpanByRef, clampSpan) == 0x000008, "Member 'TickSpanFuncitonLibrary_ClampTickSpanByRef::clampSpan' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_ClampTickSpanByRef, Result) == 0x000010, "Member 'TickSpanFuncitonLibrary_ClampTickSpanByRef::Result' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.GetEndBeat
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetEndBeat final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_GetEndBeat) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_GetEndBeat");
static_assert(sizeof(TickSpanFuncitonLibrary_GetEndBeat) == 0x00000C, "Wrong size on TickSpanFuncitonLibrary_GetEndBeat");
static_assert(offsetof(TickSpanFuncitonLibrary_GetEndBeat, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_GetEndBeat::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_GetEndBeat, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_GetEndBeat::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.GetEndTick
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetEndTick final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_GetEndTick) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_GetEndTick");
static_assert(sizeof(TickSpanFuncitonLibrary_GetEndTick) == 0x00000C, "Wrong size on TickSpanFuncitonLibrary_GetEndTick");
static_assert(offsetof(TickSpanFuncitonLibrary_GetEndTick, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_GetEndTick::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_GetEndTick, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_GetEndTick::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.GetLengthBeats
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetLengthBeats final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_GetLengthBeats) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_GetLengthBeats");
static_assert(sizeof(TickSpanFuncitonLibrary_GetLengthBeats) == 0x00000C, "Wrong size on TickSpanFuncitonLibrary_GetLengthBeats");
static_assert(offsetof(TickSpanFuncitonLibrary_GetLengthBeats, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_GetLengthBeats::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_GetLengthBeats, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_GetLengthBeats::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.GetLengthTicks
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetLengthTicks final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_GetLengthTicks) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_GetLengthTicks");
static_assert(sizeof(TickSpanFuncitonLibrary_GetLengthTicks) == 0x00000C, "Wrong size on TickSpanFuncitonLibrary_GetLengthTicks");
static_assert(offsetof(TickSpanFuncitonLibrary_GetLengthTicks, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_GetLengthTicks::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_GetLengthTicks, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_GetLengthTicks::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.GetOffsetBeat
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetOffsetBeat final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_GetOffsetBeat) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_GetOffsetBeat");
static_assert(sizeof(TickSpanFuncitonLibrary_GetOffsetBeat) == 0x00000C, "Wrong size on TickSpanFuncitonLibrary_GetOffsetBeat");
static_assert(offsetof(TickSpanFuncitonLibrary_GetOffsetBeat, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_GetOffsetBeat::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_GetOffsetBeat, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_GetOffsetBeat::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.GetOffsetTick
// 0x000C (0x000C - 0x0000)
struct TickSpanFuncitonLibrary_GetOffsetTick final
{
public:
	struct FTickSpan                              Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_GetOffsetTick) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_GetOffsetTick");
static_assert(sizeof(TickSpanFuncitonLibrary_GetOffsetTick) == 0x00000C, "Wrong size on TickSpanFuncitonLibrary_GetOffsetTick");
static_assert(offsetof(TickSpanFuncitonLibrary_GetOffsetTick, Target) == 0x000000, "Member 'TickSpanFuncitonLibrary_GetOffsetTick::Target' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_GetOffsetTick, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_GetOffsetTick::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.MakeTickSpan
// 0x0010 (0x0010 - 0x0000)
struct TickSpanFuncitonLibrary_MakeTickSpan final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Length;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTickSpan                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_MakeTickSpan) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_MakeTickSpan");
static_assert(sizeof(TickSpanFuncitonLibrary_MakeTickSpan) == 0x000010, "Wrong size on TickSpanFuncitonLibrary_MakeTickSpan");
static_assert(offsetof(TickSpanFuncitonLibrary_MakeTickSpan, Offset) == 0x000000, "Member 'TickSpanFuncitonLibrary_MakeTickSpan::Offset' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_MakeTickSpan, Length) == 0x000004, "Member 'TickSpanFuncitonLibrary_MakeTickSpan::Length' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_MakeTickSpan, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_MakeTickSpan::ReturnValue' has a wrong offset!");

// Function HmxAudio.TickSpanFuncitonLibrary.MakeTickSpanFromBeats
// 0x0010 (0x0010 - 0x0000)
struct TickSpanFuncitonLibrary_MakeTickSpanFromBeats final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTickSpan                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TickSpanFuncitonLibrary_MakeTickSpanFromBeats) == 0x000004, "Wrong alignment on TickSpanFuncitonLibrary_MakeTickSpanFromBeats");
static_assert(sizeof(TickSpanFuncitonLibrary_MakeTickSpanFromBeats) == 0x000010, "Wrong size on TickSpanFuncitonLibrary_MakeTickSpanFromBeats");
static_assert(offsetof(TickSpanFuncitonLibrary_MakeTickSpanFromBeats, Offset) == 0x000000, "Member 'TickSpanFuncitonLibrary_MakeTickSpanFromBeats::Offset' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_MakeTickSpanFromBeats, Length) == 0x000004, "Member 'TickSpanFuncitonLibrary_MakeTickSpanFromBeats::Length' has a wrong offset!");
static_assert(offsetof(TickSpanFuncitonLibrary_MakeTickSpanFromBeats, ReturnValue) == 0x000008, "Member 'TickSpanFuncitonLibrary_MakeTickSpanFromBeats::ReturnValue' has a wrong offset!");

// Function HmxAudio.MidiMusicSequence.AppendTimeSlot
// 0x0020 (0x0020 - 0x0000)
struct MidiMusicSequence_AppendTimeSlot final
{
public:
