#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HmxAudio

#include "Basic.hpp"

#include "HmxCore_structs.hpp"


namespace SDK
{

// Enum HmxAudio.EHarmonixHandleValidity
// NumValues: 0x0003
enum class EHarmonixHandleValidity : uint8
{
	Invalid                                  = 0,
	Valid                                    = 1,
	EHarmonixHandleValidity_MAX              = 2,
};

// Enum HmxAudio.EOldMusicClockState
// NumValues: 0x0004
enum class EOldMusicClockState : uint8
{
	kStopped                                 = 0,
	kPaused                                  = 1,
	kRunning                                 = 2,
	EOldMusicClockState_MAX                  = 3,
};

// Enum HmxAudio.EOffsetType
// NumValues: 0x0006
enum class EOffsetType : uint8
{
	kMs                                      = 0,
	kTicks                                   = 1,
	kBeats                                   = 2,
	kMeasures                                = 3,
	kPulses                                  = 4,
	EOffsetType_MAX                          = 5,
};

// Enum HmxAudio.ELengthType
// NumValues: 0x0005
enum class ELengthType : uint8
{
	kTicks                                   = 0,
	kBeats                                   = 1,
	kMeasures                                = 2,
	kPulse                                   = 3,
	ELengthType_MAX                          = 4,
};

// Enum HmxAudio.EOldScheduleResult
// NumValues: 0x0003
enum class EOldScheduleResult : uint8
{
	Success                                  = 0,
	Failed                                   = 1,
	EOldScheduleResult_MAX                   = 2,
};

// Enum HmxAudio.ECrushedBitDepth
// NumValues: 0x0011
enum class ECrushedBitDepth : uint8
{
	SixteenBit                               = 0,
	Fifteen                                  = 1,
	Fourteen                                 = 2,
	Thirteen                                 = 3,
	Twelve                                   = 4,
	Eleven                                   = 5,
	Ten                                      = 6,
	Nine                                     = 7,
	Eight                                    = 8,
	Seven                                    = 9,
	Six                                      = 10,
	Five                                     = 11,
	Four                                     = 12,
	Three                                    = 13,
	Two                                      = 14,
	One                                      = 15,
	ECrushedBitDepth_MAX                     = 16,
};

// Enum HmxAudio.EHarmonixDelayFilterType
// NumValues: 0x0004
enum class EHarmonixDelayFilterType : uint8
{
	LowPass                                  = 0,
	HighPass                                 = 1,
	BandPass                                 = 2,
	EHarmonixDelayFilterType_MAX             = 3,
};

// Enum HmxAudio.EHarmonixDelayStereoType
// NumValues: 0x0006
enum class EHarmonixDelayStereoType : uint8
{
	Default                                  = 0,
	CustomSpread                             = 1,
	PingPongForceLR                          = 2,
	PingPongSum                              = 3,
	PingPongIndividual                       = 4,
	EHarmonixDelayStereoType_MAX             = 5,
};

// Enum HmxAudio.EDistortionType
// NumValues: 0x0009
enum class EDistortionType : uint8
{
	Clean                                    = 0,
	Warm                                     = 1,
	Clip                                     = 2,
	Soft                                     = 3,
	Asymmetric                               = 4,
	Cruncher                                 = 5,
	CaptCrunch                               = 6,
	Rectifier                                = 7,
	EDistortionType_MAX                      = 8,
};

// Enum HmxAudio.EDistortionFilterType
// NumValues: 0x0007
enum class EDistortionFilterType : uint8
{
	LowPass                                  = 0,
	HighPass                                 = 1,
	BandPass                                 = 2,
	Peaking                                  = 3,
	LowShelf                                 = 4,
	HighShelf                                = 5,
	EDistortionFilterType_MAX                = 6,
};

// Enum HmxAudio.EHarmonixFlangerShapes
// NumValues: 0x0006
enum class EHarmonixFlangerShapes : uint8
{
	Sine                                     = 0,
	Square                                   = 1,
	SawUp                                    = 2,
	SawDown                                  = 3,
	Triangle                                 = 4,
	EHarmonixFlangerShapes_MAX               = 5,
};

// Enum HmxAudio.EHarmonixPhaserShapes
// NumValues: 0x0006
enum class EHarmonixPhaserShapes : uint8
{
	Sine                                     = 0,
	Square                                   = 1,
	SawUp                                    = 2,
	SawDown                                  = 3,
	Triangle                                 = 4,
	EHarmonixPhaserShapes_MAX                = 5,
};

// Enum HmxAudio.EHarmonixTapeStartStopTransportState
// NumValues: 0x0003
enum class EHarmonixTapeStartStopTransportState : uint8
{
	Playing                                  = 0,
	Stoppped                                 = 1,
	EHarmonixTapeStartStopTransportState_MAX = 2,
};

// Enum HmxAudio.ESynchronizationType
// NumValues: 0x0004
enum class ESynchronizationType : uint8
{
	kNone                                    = 0,
	kNextBeat                                = 1,
	kNextMeasure                             = 2,
	ESynchronizationType_MAX                 = 3,
};

// Enum HmxAudio.EMidiMsgType
// NumValues: 0x0004
enum class EMidiMsgType : uint8
{
	kText                                    = 0,
	kNoteOn                                  = 1,
	kNoteOff                                 = 2,
	EMidiMsgType_MAX                         = 3,
};

// Enum HmxAudio.EBTLengthType
// NumValues: 0x0003
enum class EBTLengthType : uint8
{
	kBeat                                    = 0,
	kMeasure                                 = 1,
	EBTLengthType_MAX                        = 2,
};

// Enum HmxAudio.EAudioClipStartPosition
// NumValues: 0x0009
enum class EAudioClipStartPosition : uint8
{
	kImmediate                               = 0,
	kOnNextDownbeat                          = 1,
	kOnNextBeat                              = 2,
	kOnNextEighth                            = 3,
	kOnTickInBar                             = 4,
	kOnAbsoluteTick                          = 5,
	kSubdivision                             = 6,
	kNumStartPositions                       = 7,
	EAudioClipStartPosition_MAX              = 8,
};

// Enum HmxAudio.EMusicalSubdivision
// NumValues: 0x0009
enum class EMusicalSubdivision : uint8
{
	Noop                                     = 0,
	Whole                                    = 1,
	Half                                     = 2,
	Quarter                                  = 4,
	Eighth                                   = 8,
	Sixteenth                                = 16,
	Thirtysecond                             = 32,
	Sixtyforth                               = 64,
	EMusicalSubdivision_MAX                  = 65,
};

// Enum HmxAudio.EWaitAtLeastMode
// NumValues: 0x0004
enum class EWaitAtLeastMode : uint8
{
	kNone                                    = 0,
	kSecs                                    = 1,
	kTicks                                   = 2,
	EWaitAtLeastMode_MAX                     = 3,
};

// Enum HmxAudio.EPlayEmitterFindMethod
// NumValues: 0x0008
enum class EPlayEmitterFindMethod : uint8
{
	kDefault                                 = 0,
	kSearch                                  = 1,
	kSpecificEmitter                         = 2,
	kTaggedEmitterOnThisActor                = 3,
	kTaggedEmitterOnSpecifiedActor           = 4,
	kTaggedEmitterOnAnyActor                 = 5,
	kSpecificEmitterOnTaggedActor            = 6,
	EPlayEmitterFindMethod_MAX               = 7,
};

// Enum HmxAudio.ESyncEmitterFindMethod
// NumValues: 0x0009
enum class ESyncEmitterFindMethod : uint8
{
	kDefault                                 = 0,
	kSearch                                  = 1,
	kSpecificEmitter                         = 2,
	kTaggedEmitterOnThisActor                = 3,
	kTaggedEmitterOnSpecifiedActor           = 4,
	kTaggedEmitterOnAnyActor                 = 5,
	kSpecificEmittorOnTaggedActor            = 6,
	kAsPlay                                  = 7,
	ESyncEmitterFindMethod_MAX               = 8,
};

// Enum HmxAudio.FLookAheadType
// NumValues: 0x0003
enum class EFLookAheadType : uint8
{
	kTicks                                   = 0,
	kTime                                    = 1,
	FLookAheadType_MAX                       = 2,
};

// Enum HmxAudio.FMidiSourceType
// NumValues: 0x0004
enum class EFMidiSourceType : uint8
{
	MusicEmittersTimeAuthority               = 0,
	MusicPlayersCurrentMusic                 = 1,
	SpecificMusicHandle                      = 2,
	FMidiSourceType_MAX                      = 3,
};

// Enum HmxAudio.EHoldOffUnits
// NumValues: 0x0004
enum class EHoldOffUnits : uint8
{
	kNone                                    = 0,
	kTicks                                   = 1,
	kMs                                      = 2,
	EHoldOffUnits_MAX                        = 3,
};

// Enum HmxAudio.EMusicalUnit
// NumValues: 0x0004
enum class EMusicalUnit : uint8
{
	kBeatSubdivision                         = 0,
	kBarBoundary                             = 1,
	kAbsoluteMBT                             = 2,
	EMusicalUnit_MAX                         = 3,
};

// Enum HmxAudio.EMTSResult
// NumValues: 0x0003
enum class EMTSResult : uint8
{
	Failed                                   = 0,
	Succeeded                                = 1,
	EMTSResult_MAX                           = 2,
};

// Enum HmxAudio.EMusicClipUnmutePoint
// NumValues: 0x0006
enum class EMusicClipUnmutePoint : uint8
{
	Immediate                                = 0,
	NextSixteenth                            = 1,
	NextEigth                                = 2,
	NextQuarter                              = 3,
	NextDownbeat                             = 4,
	EMusicClipUnmutePoint_MAX                = 5,
};

// Enum HmxAudio.EMusicClipSyncOptions
// NumValues: 0x0005
enum class EMusicClipSyncOptions : uint8
{
	Wild                                     = 0,
	TimeAuthority                            = 1,
	TimeFollower                             = 2,
	AssumeTimeAuthority                      = 3,
	EMusicClipSyncOptions_MAX                = 4,
};

// Enum HmxAudio.EMusicClipTimelineMapping
// NumValues: 0x0008
enum class EMusicClipTimelineMapping : uint8
{
	DO_NOT_USE                               = 0,
	FromStart                                = 1,
	FromNextDownbeat                         = 2,
	FromSectionMarkers                       = 3,
	FromNearestBeat                          = 4,
	FromSpecificTick                         = 5,
	FromNextBeat                             = 6,
	EMusicClipTimelineMapping_MAX            = 7,
};

// Enum HmxAudio.EMusicClipSpeedConfigMode
// NumValues: 0x0003
enum class EMusicClipSpeedConfigMode : uint8
{
	SpeedFactor                              = 0,
	BPM                                      = 1,
	EMusicClipSpeedConfigMode_MAX            = 2,
};

// Enum HmxAudio.EMidiChannels
// NumValues: 0x0011
enum class EMidiChannels : uint8
{
	kCh0                                     = 0,
	kCh1                                     = 1,
	kCh2                                     = 2,
	kCh3                                     = 3,
	kCh4                                     = 4,
	kCh5                                     = 5,
	kCh6                                     = 6,
	kCh7                                     = 7,
	kCh8                                     = 8,
	kCh9                                     = 9,
	kCh10                                    = 10,
	kCh11                                    = 11,
	kCh12                                    = 12,
	kCh13                                    = 13,
	kCh14                                    = 14,
	kCh15                                    = 15,
	EMidiChannels_MAX                        = 16,
};

// Enum HmxAudio.FAudioContinuationMode
// NumValues: 0x000A
enum class EFAudioContinuationMode : uint8
{
	kOneshot                                 = 0,
	kRepeatOnDownbeats                       = 1,
	kRepeatOnQuarters                        = 2,
	kRepeatOnEigths                          = 3,
	kRepeatOnEigthTriplets                   = 4,
	kRepeatOn16ths                           = 5,
	kRepeatOnSpecificTickInBar               = 6,
	kStickyOnScheduledStart                  = 7,
	kNumContinuationModes                    = 8,
	FAudioContinuationMode_MAX               = 9,
};

// Enum HmxAudio.EMidiControllerID
// NumValues: 0x002C
enum class EMidiControllerID : uint8
{
	PresetSelection                          = 0,
	PortamentoTime                           = 5,
	Volume                                   = 7,
	PanRight                                 = 10,
	Expression                               = 11,
	BitCrushWetMix                           = 14,
	BitCrushLevel                            = 15,
	BitCrushSampleHold                       = 16,
	LFO0Frequency                            = 22,
	LFO1Frequency                            = 23,
	LFO0Depth                                = 24,
	LFO1Depth                                = 25,
	DelayTime                                = 26,
	DelayDryGain                             = 27,
	DelayWetGain                             = 28,
	DelayFeedback                            = 29,
	CoarsePitchBend                          = 30,
	SampleStartTime                          = 31,
	SubStreamVol1                            = 52,
	SubStreamVol2                            = 53,
	SubStreamVol3                            = 54,
	SubStreamVol4                            = 55,
	SubStreamVol5                            = 56,
	SubStreamVol6                            = 57,
	SubStreamVol7                            = 58,
	SubStreamVol8                            = 59,
	DelayEQEnabled                           = 60,
	DelayEQType                              = 61,
	DelayEQFreq                              = 62,
	DelayEQQ                                 = 63,
	PortamentoSwitch                         = 65,
	FilterQ                                  = 71,
	Release                                  = 72,
	Attack                                   = 73,
	FilterFrequency                          = 74,
	ElastiqueEnvelopeOrder                   = 79,
	DelayLFOBeatSync                         = 80,
	DelayLFOEnabled                          = 81,
	DelayLFORate                             = 82,
	DelayLFODepth                            = 83,
	DelayStereoType                          = 84,
	DelayPanLeft                             = 85,
	DelayPanRight                            = 86,
	EMidiControllerID_MAX                    = 87,
};

// Enum HmxAudio.EVorbisMemoryScheme
// NumValues: 0x0005
enum class EVorbisMemoryScheme : uint8
{
	None                                     = 0,
	Platform                                 = 1,
	PrivateAllocator                         = 2,
	PerStreamStack                           = 3,
	EVorbisMemoryScheme_MAX                  = 4,
};

// Enum HmxAudio.EAudioTransportState
// NumValues: 0x0008
enum class EAudioTransportState : uint8
{
	Invalid                                  = 0,
	PreBuffering                             = 1,
	PlayRequested                            = 2,
	Playing                                  = 3,
	Paused                                   = 4,
	Stopped                                  = 5,
	Stopping                                 = 6,
	EAudioTransportState_MAX                 = 7,
};

// Enum HmxAudio.EParamExists
// NumValues: 0x0003
enum class EParamExists : uint8
{
	DoesExist                                = 0,
	DoesNotExist                             = 1,
	EParamExists_MAX                         = 2,
};

// Enum HmxAudio.EPostFadeOption
// NumValues: 0x0003
enum class EPostFadeOption : uint8
{
	KeepPlaying                              = 0,
	Stop                                     = 1,
	EPostFadeOption_MAX                      = 2,
};

// Enum HmxAudio.EMusicFindResults
// NumValues: 0x0003
enum class EMusicFindResults : uint8
{
	NotFound                                 = 0,
	Found                                    = 1,
	EMusicFindResults_MAX                    = 2,
};

// Enum HmxAudio.FMusicUnmutePoint
// NumValues: 0x0008
enum class EFMusicUnmutePoint : uint8
{
	kUnmutePoint_Immediate                   = 0,
	kUnmutePoint_NextSixteenth               = 1,
	kUnmutePoint_NextEighth                  = 2,
	kUnmutePoint_NextQuarter                 = 3,
	kUnmutePoint_NextDownbeat                = 4,
	kUnmutePoint_SpecificLocalTick           = 5,
	kUnmutePoint_SpecificMasterTick          = 6,
	kUnmutePoint_MAX                         = 7,
};

// Enum HmxAudio.FMusicSyncOptions
// NumValues: 0x0004
enum class EFMusicSyncOptions : uint8
{
	kSync_Wild                               = 0,
	kSync_Master                             = 1,
	kSync_Slave                              = 2,
	kSync_MAX                                = 3,
};

// Enum HmxAudio.FMusicTimelineMapping
// NumValues: 0x0008
enum class EFMusicTimelineMapping : uint8
{
	kTimelineMapping_NOT_USED                = 0,
	kTimelineMapping_FromStart               = 1,
	kTimelineMapping_FromNextDownbeat        = 2,
	kTimelineMapping_FromSectionMarkers      = 3,
	kTimelineMapping_FromNearestBeat         = 4,
	kTimelineMapping_FromSpecificTick        = 5,
	kTimelineMapping_FromNextBeat            = 6,
	kTimelineMapping_MAX                     = 7,
};

// Enum HmxAudio.EPostFadeOptionEnum
// NumValues: 0x0003
enum class EPostFadeOptionEnum : uint8
{
	kPostFadeOption_None                     = 0,
	kPostFadeOption_Stop                     = 1,
	kPostFadeOption_MAX                      = 2,
};

// Enum HmxAudio.FStretcherAlgorithm
// NumValues: 0x0006
enum class EFStretcherAlgorithm : uint8
{
	kAsAuthored                              = 0,
	kDefault                                 = 1,
	kPro                                     = 2,
	kEffWithFormant                          = 3,
	kMobile                                  = 4,
	FStretcherAlgorithm_MAX                  = 5,
};

// Enum HmxAudio.FFormantHandling
// NumValues: 0x0004
enum class EFFormantHandling : uint8
{
	kAsAuthored                              = 0,
	kCorrected                               = 1,
	kUncorrected                             = 2,
	FFormantHandling_MAX                     = 3,
};

// Enum HmxAudio.FInstrumentRenderMode
// NumValues: 0x0004
enum class EFInstrumentRenderMode : uint8
{
	Parent                                   = 0,
	PreFxChild                               = 1,
	PostFxChild                              = 2,
	FInstrumentRenderMode_MAX                = 3,
};

// ScriptStruct HmxAudio.HarmonixDistortionBiquadSettings
// 0x0010 (0x0010 - 0x0000)
struct FHarmonixDistortionBiquadSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistortionFilterType                         Shape;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Frequency;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Q;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GainDb;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixDistortionBiquadSettings) == 0x000004, "Wrong alignment on FHarmonixDistortionBiquadSettings");
static_assert(sizeof(FHarmonixDistortionBiquadSettings) == 0x000010, "Wrong size on FHarmonixDistortionBiquadSettings");
static_assert(offsetof(FHarmonixDistortionBiquadSettings, Enabled) == 0x000000, "Member 'FHarmonixDistortionBiquadSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionBiquadSettings, Shape) == 0x000001, "Member 'FHarmonixDistortionBiquadSettings::Shape' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionBiquadSettings, Frequency) == 0x000004, "Member 'FHarmonixDistortionBiquadSettings::Frequency' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionBiquadSettings, Q) == 0x000008, "Member 'FHarmonixDistortionBiquadSettings::Q' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionBiquadSettings, GainDb) == 0x00000C, "Member 'FHarmonixDistortionBiquadSettings::GainDb' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixDistortionFilterSettings
// 0x0018 (0x0018 - 0x0000)
struct FHarmonixDistortionFilterSettings final
{
public:
	struct FHarmonixDistortionBiquadSettings      biquad;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          PreClip;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Passes;                                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixDistortionFilterSettings) == 0x000004, "Wrong alignment on FHarmonixDistortionFilterSettings");
static_assert(sizeof(FHarmonixDistortionFilterSettings) == 0x000018, "Wrong size on FHarmonixDistortionFilterSettings");
static_assert(offsetof(FHarmonixDistortionFilterSettings, biquad) == 0x000000, "Member 'FHarmonixDistortionFilterSettings::biquad' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionFilterSettings, PreClip) == 0x000010, "Member 'FHarmonixDistortionFilterSettings::PreClip' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionFilterSettings, Passes) == 0x000014, "Member 'FHarmonixDistortionFilterSettings::Passes' has a wrong offset!");

// ScriptStruct HmxAudio.MusicalTimeSpan
// 0x0010 (0x0010 - 0x0000)
struct FMusicalTimeSpan final
{
public:
	ELengthType                                   lengthType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Length;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOffsetType                                   offsetType;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMusicalTimeSpan) == 0x000004, "Wrong alignment on FMusicalTimeSpan");
static_assert(sizeof(FMusicalTimeSpan) == 0x000010, "Wrong size on FMusicalTimeSpan");
static_assert(offsetof(FMusicalTimeSpan, lengthType) == 0x000000, "Member 'FMusicalTimeSpan::lengthType' has a wrong offset!");
static_assert(offsetof(FMusicalTimeSpan, Length) == 0x000004, "Member 'FMusicalTimeSpan::Length' has a wrong offset!");
static_assert(offsetof(FMusicalTimeSpan, offsetType) == 0x000008, "Member 'FMusicalTimeSpan::offsetType' has a wrong offset!");
static_assert(offsetof(FMusicalTimeSpan, Offset) == 0x00000C, "Member 'FMusicalTimeSpan::Offset' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixBitCrusherEffectSettings
// 0x0018 (0x0018 - 0x0000)
struct FHarmonixBitCrusherEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputVolumeDb;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECrushedBitDepth                              Bits;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SampleAndHoldFactor;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutputVolumeDb;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixBitCrusherEffectSettings) == 0x000004, "Wrong alignment on FHarmonixBitCrusherEffectSettings");
static_assert(sizeof(FHarmonixBitCrusherEffectSettings) == 0x000018, "Wrong size on FHarmonixBitCrusherEffectSettings");
static_assert(offsetof(FHarmonixBitCrusherEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixBitCrusherEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixBitCrusherEffectSettings, InputVolumeDb) == 0x000004, "Member 'FHarmonixBitCrusherEffectSettings::InputVolumeDb' has a wrong offset!");
static_assert(offsetof(FHarmonixBitCrusherEffectSettings, Bits) == 0x000008, "Member 'FHarmonixBitCrusherEffectSettings::Bits' has a wrong offset!");
static_assert(offsetof(FHarmonixBitCrusherEffectSettings, SampleAndHoldFactor) == 0x00000C, "Member 'FHarmonixBitCrusherEffectSettings::SampleAndHoldFactor' has a wrong offset!");
static_assert(offsetof(FHarmonixBitCrusherEffectSettings, Depth) == 0x000010, "Member 'FHarmonixBitCrusherEffectSettings::Depth' has a wrong offset!");
static_assert(offsetof(FHarmonixBitCrusherEffectSettings, OutputVolumeDb) == 0x000014, "Member 'FHarmonixBitCrusherEffectSettings::OutputVolumeDb' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixBufferUtilEffectSettings
// 0x0001 (0x0001 - 0x0000)
struct FHarmonixBufferUtilEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixBufferUtilEffectSettings) == 0x000001, "Wrong alignment on FHarmonixBufferUtilEffectSettings");
static_assert(sizeof(FHarmonixBufferUtilEffectSettings) == 0x000001, "Wrong size on FHarmonixBufferUtilEffectSettings");
static_assert(offsetof(FHarmonixBufferUtilEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixBufferUtilEffectSettings::Enabled' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixDelayEffectSettings
// 0x003C (0x003C - 0x0000)
struct FHarmonixDelayEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETempoListenerTimeSyncOption                  TimeSyncOption;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSeconds;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tempo;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DryDb;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WetDb;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FeedbackDb;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EQEnabled;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHarmonixDelayFilterType                      EQType;                                            // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EQFreq;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EQQ;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LFOEnabled;                                        // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETempoListenerTimeSyncOption                  LFOTimeSyncOption;                                 // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LFORate;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LFODepth;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHarmonixDelayStereoType                      StereoType;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PanLeft;                                           // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PanRight;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixDelayEffectSettings) == 0x000004, "Wrong alignment on FHarmonixDelayEffectSettings");
static_assert(sizeof(FHarmonixDelayEffectSettings) == 0x00003C, "Wrong size on FHarmonixDelayEffectSettings");
static_assert(offsetof(FHarmonixDelayEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixDelayEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, TimeSyncOption) == 0x000001, "Member 'FHarmonixDelayEffectSettings::TimeSyncOption' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, TimeSeconds) == 0x000004, "Member 'FHarmonixDelayEffectSettings::TimeSeconds' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, Tempo) == 0x000008, "Member 'FHarmonixDelayEffectSettings::Tempo' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, DryDb) == 0x00000C, "Member 'FHarmonixDelayEffectSettings::DryDb' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, WetDb) == 0x000010, "Member 'FHarmonixDelayEffectSettings::WetDb' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, FeedbackDb) == 0x000014, "Member 'FHarmonixDelayEffectSettings::FeedbackDb' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, EQEnabled) == 0x000018, "Member 'FHarmonixDelayEffectSettings::EQEnabled' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, EQType) == 0x000019, "Member 'FHarmonixDelayEffectSettings::EQType' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, EQFreq) == 0x00001C, "Member 'FHarmonixDelayEffectSettings::EQFreq' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, EQQ) == 0x000020, "Member 'FHarmonixDelayEffectSettings::EQQ' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, LFOEnabled) == 0x000024, "Member 'FHarmonixDelayEffectSettings::LFOEnabled' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, LFOTimeSyncOption) == 0x000025, "Member 'FHarmonixDelayEffectSettings::LFOTimeSyncOption' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, LFORate) == 0x000028, "Member 'FHarmonixDelayEffectSettings::LFORate' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, LFODepth) == 0x00002C, "Member 'FHarmonixDelayEffectSettings::LFODepth' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, StereoType) == 0x000030, "Member 'FHarmonixDelayEffectSettings::StereoType' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, PanLeft) == 0x000034, "Member 'FHarmonixDelayEffectSettings::PanLeft' has a wrong offset!");
static_assert(offsetof(FHarmonixDelayEffectSettings, PanRight) == 0x000038, "Member 'FHarmonixDelayEffectSettings::PanRight' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixDistortionEffectSettings
// 0x0060 (0x0060 - 0x0000)
struct FHarmonixDistortionEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputVolumeDb;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutputVolumeDb;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WetDryMix;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DCOffset;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistortionType                               Algorithm;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Oversample;                                        // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHarmonixDistortionFilterSettings      Filter1;                                           // 0x0018(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FHarmonixDistortionFilterSettings      Filter2;                                           // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FHarmonixDistortionFilterSettings      Filter3;                                           // 0x0048(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixDistortionEffectSettings) == 0x000004, "Wrong alignment on FHarmonixDistortionEffectSettings");
static_assert(sizeof(FHarmonixDistortionEffectSettings) == 0x000060, "Wrong size on FHarmonixDistortionEffectSettings");
static_assert(offsetof(FHarmonixDistortionEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixDistortionEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, InputVolumeDb) == 0x000004, "Member 'FHarmonixDistortionEffectSettings::InputVolumeDb' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, OutputVolumeDb) == 0x000008, "Member 'FHarmonixDistortionEffectSettings::OutputVolumeDb' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, WetDryMix) == 0x00000C, "Member 'FHarmonixDistortionEffectSettings::WetDryMix' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, DCOffset) == 0x000010, "Member 'FHarmonixDistortionEffectSettings::DCOffset' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, Algorithm) == 0x000014, "Member 'FHarmonixDistortionEffectSettings::Algorithm' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, Oversample) == 0x000015, "Member 'FHarmonixDistortionEffectSettings::Oversample' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, Filter1) == 0x000018, "Member 'FHarmonixDistortionEffectSettings::Filter1' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, Filter2) == 0x000030, "Member 'FHarmonixDistortionEffectSettings::Filter2' has a wrong offset!");
static_assert(offsetof(FHarmonixDistortionEffectSettings, Filter3) == 0x000048, "Member 'FHarmonixDistortionEffectSettings::Filter3' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixFlangerEffectSettings
// 0x0028 (0x0028 - 0x0000)
struct FHarmonixFlangerEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Depth;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTimeMs;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHarmonixFlangerShapes                        Shape;                                             // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feedback;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Invert;                                            // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Excursion;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETempoListenerTimeSyncOption                  TimeSyncOption;                                    // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TempoSyncPhaseOffset;                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixFlangerEffectSettings) == 0x000004, "Wrong alignment on FHarmonixFlangerEffectSettings");
static_assert(sizeof(FHarmonixFlangerEffectSettings) == 0x000028, "Wrong size on FHarmonixFlangerEffectSettings");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixFlangerEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Depth) == 0x000004, "Member 'FHarmonixFlangerEffectSettings::Depth' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, DelayTimeMs) == 0x000008, "Member 'FHarmonixFlangerEffectSettings::DelayTimeMs' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Shape) == 0x00000C, "Member 'FHarmonixFlangerEffectSettings::Shape' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Rate) == 0x000010, "Member 'FHarmonixFlangerEffectSettings::Rate' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Feedback) == 0x000014, "Member 'FHarmonixFlangerEffectSettings::Feedback' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Invert) == 0x000018, "Member 'FHarmonixFlangerEffectSettings::Invert' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, Excursion) == 0x00001C, "Member 'FHarmonixFlangerEffectSettings::Excursion' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, TimeSyncOption) == 0x000020, "Member 'FHarmonixFlangerEffectSettings::TimeSyncOption' has a wrong offset!");
static_assert(offsetof(FHarmonixFlangerEffectSettings, TempoSyncPhaseOffset) == 0x000024, "Member 'FHarmonixFlangerEffectSettings::TempoSyncPhaseOffset' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixPhaserEffectSettings
// 0x0028 (0x0028 - 0x0000)
struct FHarmonixPhaserEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WetDryMix;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscDepth;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Feedback;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Poles;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHarmonixPhaserShapes                         Shape;                                             // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rate;                                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETempoListenerTimeSyncOption                  TimeSyncOption;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Color;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhaseShift;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixPhaserEffectSettings) == 0x000004, "Wrong alignment on FHarmonixPhaserEffectSettings");
static_assert(sizeof(FHarmonixPhaserEffectSettings) == 0x000028, "Wrong size on FHarmonixPhaserEffectSettings");
static_assert(offsetof(FHarmonixPhaserEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixPhaserEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, WetDryMix) == 0x000004, "Member 'FHarmonixPhaserEffectSettings::WetDryMix' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, OscDepth) == 0x000008, "Member 'FHarmonixPhaserEffectSettings::OscDepth' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, Feedback) == 0x00000C, "Member 'FHarmonixPhaserEffectSettings::Feedback' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, Poles) == 0x000010, "Member 'FHarmonixPhaserEffectSettings::Poles' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, Shape) == 0x000014, "Member 'FHarmonixPhaserEffectSettings::Shape' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, Rate) == 0x000018, "Member 'FHarmonixPhaserEffectSettings::Rate' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, TimeSyncOption) == 0x00001C, "Member 'FHarmonixPhaserEffectSettings::TimeSyncOption' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, Color) == 0x000020, "Member 'FHarmonixPhaserEffectSettings::Color' has a wrong offset!");
static_assert(offsetof(FHarmonixPhaserEffectSettings, PhaseShift) == 0x000024, "Member 'FHarmonixPhaserEffectSettings::PhaseShift' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixStutterEditEffectSettings
// 0x0010 (0x0010 - 0x0000)
struct FHarmonixStutterEditEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FadeEnabled;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowPassThrough;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SilenceWhileScheduled;                             // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          VarispeedForTempoChanges;                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxCaptureSeconds;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstanceName;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixStutterEditEffectSettings) == 0x000004, "Wrong alignment on FHarmonixStutterEditEffectSettings");
static_assert(sizeof(FHarmonixStutterEditEffectSettings) == 0x000010, "Wrong size on FHarmonixStutterEditEffectSettings");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixStutterEditEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, FadeEnabled) == 0x000001, "Member 'FHarmonixStutterEditEffectSettings::FadeEnabled' has a wrong offset!");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, AllowPassThrough) == 0x000002, "Member 'FHarmonixStutterEditEffectSettings::AllowPassThrough' has a wrong offset!");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, SilenceWhileScheduled) == 0x000003, "Member 'FHarmonixStutterEditEffectSettings::SilenceWhileScheduled' has a wrong offset!");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, VarispeedForTempoChanges) == 0x000004, "Member 'FHarmonixStutterEditEffectSettings::VarispeedForTempoChanges' has a wrong offset!");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, MaxCaptureSeconds) == 0x000008, "Member 'FHarmonixStutterEditEffectSettings::MaxCaptureSeconds' has a wrong offset!");
static_assert(offsetof(FHarmonixStutterEditEffectSettings, InstanceName) == 0x00000C, "Member 'FHarmonixStutterEditEffectSettings::InstanceName' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixTapeStartStopEffectSettings
// 0x000C (0x000C - 0x0000)
struct FHarmonixTapeStartStopEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionDurationInBeats;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHarmonixTapeStartStopTransportState          Transport;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHarmonixTapeStartStopEffectSettings) == 0x000004, "Wrong alignment on FHarmonixTapeStartStopEffectSettings");
static_assert(sizeof(FHarmonixTapeStartStopEffectSettings) == 0x00000C, "Wrong size on FHarmonixTapeStartStopEffectSettings");
static_assert(offsetof(FHarmonixTapeStartStopEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixTapeStartStopEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixTapeStartStopEffectSettings, TransitionDurationInBeats) == 0x000004, "Member 'FHarmonixTapeStartStopEffectSettings::TransitionDurationInBeats' has a wrong offset!");
static_assert(offsetof(FHarmonixTapeStartStopEffectSettings, Transport) == 0x000008, "Member 'FHarmonixTapeStartStopEffectSettings::Transport' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixTremoloEffectSettings
// 0x0018 (0x0018 - 0x0000)
struct FHarmonixTremoloEffectSettings final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Depth;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETempoListenerTimeSyncOption                  TimeSyncOption;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LFORate;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LfoShape;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InvertLfo;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHarmonixTremoloEffectSettings) == 0x000004, "Wrong alignment on FHarmonixTremoloEffectSettings");
static_assert(sizeof(FHarmonixTremoloEffectSettings) == 0x000018, "Wrong size on FHarmonixTremoloEffectSettings");
static_assert(offsetof(FHarmonixTremoloEffectSettings, Enabled) == 0x000000, "Member 'FHarmonixTremoloEffectSettings::Enabled' has a wrong offset!");
static_assert(offsetof(FHarmonixTremoloEffectSettings, Depth) == 0x000004, "Member 'FHarmonixTremoloEffectSettings::Depth' has a wrong offset!");
static_assert(offsetof(FHarmonixTremoloEffectSettings, TimeSyncOption) == 0x000008, "Member 'FHarmonixTremoloEffectSettings::TimeSyncOption' has a wrong offset!");
static_assert(offsetof(FHarmonixTremoloEffectSettings, LFORate) == 0x00000C, "Member 'FHarmonixTremoloEffectSettings::LFORate' has a wrong offset!");
static_assert(offsetof(FHarmonixTremoloEffectSettings, LfoShape) == 0x000010, "Member 'FHarmonixTremoloEffectSettings::LfoShape' has a wrong offset!");
static_assert(offsetof(FHarmonixTremoloEffectSettings, InvertLfo) == 0x000014, "Member 'FHarmonixTremoloEffectSettings::InvertLfo' has a wrong offset!");

// ScriptStruct HmxAudio.HarmonixVibeEffectSettings
// 0x002C (0x002C - 0x0000)
struct FHarmonixVibeEffectSettings final
{
public:
