#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemShopScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemShopScreen.ItemShopScreen_C
// 0x0068 (0x0718 - 0x06B0)
class UItemShopScreen_C final : public UAthenaItemShopScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StandardIntro;                                     // 0x06B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpecialOfferSkippedVideoIntro;                     // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpecialOfferVideoIntro;                            // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_DynamicBackground;                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SpecialBackground;                           // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SpecialIntroOverlay;                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_4;                                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Content;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Sections;                                 // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Sections;                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_ItemShopScreen(int32 EntryPoint);
	void HandleDynamicBackgroundTextureChanged(class UTexture* BackgroundTexture);
	void HideDynamicBackground();
	void OnEstablishingSections();
	void OnSectionsEstablished(bool bEmpty);
	void OnSpecialOfferVideoFinished();
	void OnSpecialOfferVideoSkipped();
	void OnSpecialOfferVideoStarted();
	void SequenceEvent__ENTRYPOINTItemShopScreen();
	void SequenceEvent__ENTRYPOINTItemShopScreen_0();
	void SequencerEvent_EnableShopNavigate(bool bIsNavigationEnabled);
	void ShowDynamicBackground();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemShopScreen_C">();
	}
	static class UItemShopScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemShopScreen_C>();
	}
};
static_assert(alignof(UItemShopScreen_C) == 0x000008, "Wrong alignment on UItemShopScreen_C");
static_assert(sizeof(UItemShopScreen_C) == 0x000718, "Wrong size on UItemShopScreen_C");
static_assert(offsetof(UItemShopScreen_C, UberGraphFrame) == 0x0006B0, "Member 'UItemShopScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, StandardIntro) == 0x0006B8, "Member 'UItemShopScreen_C::StandardIntro' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, SpecialOfferSkippedVideoIntro) == 0x0006C0, "Member 'UItemShopScreen_C::SpecialOfferSkippedVideoIntro' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, SpecialOfferVideoIntro) == 0x0006C8, "Member 'UItemShopScreen_C::SpecialOfferVideoIntro' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, Image_DynamicBackground) == 0x0006D0, "Member 'UItemShopScreen_C::Image_DynamicBackground' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, Image_SpecialBackground) == 0x0006D8, "Member 'UItemShopScreen_C::Image_SpecialBackground' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, Image_SpecialIntroOverlay) == 0x0006E0, "Member 'UItemShopScreen_C::Image_SpecialIntroOverlay' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, NoOffersBox) == 0x0006E8, "Member 'UItemShopScreen_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, ProgressSpinner) == 0x0006F0, "Member 'UItemShopScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, SafeZone_4) == 0x0006F8, "Member 'UItemShopScreen_C::SafeZone_4' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, SafeZone_Content) == 0x000700, "Member 'UItemShopScreen_C::SafeZone_Content' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, Switcher_Sections) == 0x000708, "Member 'UItemShopScreen_C::Switcher_Sections' has a wrong offset!");
static_assert(offsetof(UItemShopScreen_C, VerticalBox_Sections) == 0x000710, "Member 'UItemShopScreen_C::VerticalBox_Sections' has a wrong offset!");

}

