#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinablePartyActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JoinablePartyActionMenu.JoinablePartyActionMenu_C
// 0x0028 (0x04D8 - 0x04B0)
class UJoinablePartyActionMenu_C final : public UFortJoinablePartyActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_JoinablePartyActionMenu(int32 EntryPoint);
	void OnOpened();
	void OnToggleConfirmation(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JoinablePartyActionMenu_C">();
	}
	static class UJoinablePartyActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinablePartyActionMenu_C>();
	}
};
static_assert(alignof(UJoinablePartyActionMenu_C) == 0x000008, "Wrong alignment on UJoinablePartyActionMenu_C");
static_assert(sizeof(UJoinablePartyActionMenu_C) == 0x0004D8, "Wrong size on UJoinablePartyActionMenu_C");
static_assert(offsetof(UJoinablePartyActionMenu_C, UberGraphFrame) == 0x0004B0, "Member 'UJoinablePartyActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, ConfirmationOpened) == 0x0004B8, "Member 'UJoinablePartyActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, Opened) == 0x0004C0, "Member 'UJoinablePartyActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, Border_OnlineStatusIndicator) == 0x0004C8, "Member 'UJoinablePartyActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, EntryBorder) == 0x0004D0, "Member 'UJoinablePartyActionMenu_C::EntryBorder' has a wrong offset!");

}

