#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KoalaUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "KoalaUI_structs.hpp"


namespace SDK
{

// Class KoalaUI.FortGameSettingRegistryExtension_Koala
// 0x0040 (0x0068 - 0x0028)
class UFortGameSettingRegistryExtension_Koala final : public UFortGameSettingRegistryExtension
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortSettingNameExtensions             SettingExtensions;                                 // 0x0030(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameSettingRegistryExtension_Koala">();
	}
	static class UFortGameSettingRegistryExtension_Koala* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameSettingRegistryExtension_Koala>();
	}
};
static_assert(alignof(UFortGameSettingRegistryExtension_Koala) == 0x000008, "Wrong alignment on UFortGameSettingRegistryExtension_Koala");
static_assert(sizeof(UFortGameSettingRegistryExtension_Koala) == 0x000068, "Wrong size on UFortGameSettingRegistryExtension_Koala");
static_assert(offsetof(UFortGameSettingRegistryExtension_Koala, SettingExtensions) == 0x000030, "Member 'UFortGameSettingRegistryExtension_Koala::SettingExtensions' has a wrong offset!");

// Class KoalaUI.FortSidebarPanelKoala
// 0x0038 (0x03E0 - 0x03A8)
class UFortSidebarPanelKoala : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_KoalaDummy;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                         QrCodeImage;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 QRCodeURL;                                         // 0x03D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnConnectionChanged(bool bConnected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSidebarPanelKoala">();
	}
	static class UFortSidebarPanelKoala* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSidebarPanelKoala>();
	}
};
static_assert(alignof(UFortSidebarPanelKoala) == 0x000008, "Wrong alignment on UFortSidebarPanelKoala");
static_assert(sizeof(UFortSidebarPanelKoala) == 0x0003E0, "Wrong size on UFortSidebarPanelKoala");
static_assert(offsetof(UFortSidebarPanelKoala, Button_KoalaDummy) == 0x0003C0, "Member 'UFortSidebarPanelKoala::Button_KoalaDummy' has a wrong offset!");
static_assert(offsetof(UFortSidebarPanelKoala, QrCodeImage) == 0x0003C8, "Member 'UFortSidebarPanelKoala::QrCodeImage' has a wrong offset!");
static_assert(offsetof(UFortSidebarPanelKoala, QRCodeURL) == 0x0003D0, "Member 'UFortSidebarPanelKoala::QRCodeURL' has a wrong offset!");

// Class KoalaUI.FortUIGameFeatureAction_AttemptKoalaModal
// 0x0040 (0x0070 - 0x0030)
class UFortUIGameFeatureAction_AttemptKoalaModal final : public UFortUIGameFeatureAction_PostFrontendFlowActions
{
public:
	TSoftClassPtr<class UClass>                   KoalaGraphicsModalClass;                           // 0x0030(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIGameFeatureAction_AttemptKoalaModal">();
	}
	static class UFortUIGameFeatureAction_AttemptKoalaModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIGameFeatureAction_AttemptKoalaModal>();
	}
};
static_assert(alignof(UFortUIGameFeatureAction_AttemptKoalaModal) == 0x000008, "Wrong alignment on UFortUIGameFeatureAction_AttemptKoalaModal");
static_assert(sizeof(UFortUIGameFeatureAction_AttemptKoalaModal) == 0x000070, "Wrong size on UFortUIGameFeatureAction_AttemptKoalaModal");
static_assert(offsetof(UFortUIGameFeatureAction_AttemptKoalaModal, KoalaGraphicsModalClass) == 0x000030, "Member 'UFortUIGameFeatureAction_AttemptKoalaModal::KoalaGraphicsModalClass' has a wrong offset!");

// Class KoalaUI.KoalaGraphicsModal
// 0x0028 (0x03D0 - 0x03A8)
class UKoalaGraphicsModal final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_KeepEnabled;                                // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Disable;                                    // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KoalaGraphicsModal">();
	}
	static class UKoalaGraphicsModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoalaGraphicsModal>();
	}
};
static_assert(alignof(UKoalaGraphicsModal) == 0x000008, "Wrong alignment on UKoalaGraphicsModal");
static_assert(sizeof(UKoalaGraphicsModal) == 0x0003D0, "Wrong size on UKoalaGraphicsModal");
static_assert(offsetof(UKoalaGraphicsModal, Button_KeepEnabled) == 0x0003C0, "Member 'UKoalaGraphicsModal::Button_KeepEnabled' has a wrong offset!");
static_assert(offsetof(UKoalaGraphicsModal, Button_Disable) == 0x0003C8, "Member 'UKoalaGraphicsModal::Button_Disable' has a wrong offset!");

// Class KoalaUI.KoalaHUDWidget
// 0x0140 (0x04E8 - 0x03A8)
class UKoalaHUDWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClipDebounceTime;                                  // 0x03B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PlayerKilledPlayerReminderTime;                    // 0x03B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MatchEndedReminderTime;                            // 0x03B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClipReminderCooldownTime;                          // 0x03BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EliminationClipReminderDelayTime;                  // 0x03C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubmix*                           ClipAudioSubmix;                                   // 0x03C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActionWidget*                    ClipActionWidget;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ClipObjectInputAction;                             // 0x03D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FKoalaClipInfo>            ClipTracker;                                       // 0x03F0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastClipID;                                        // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44C[0x16];                                     // 0x044C(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	EKoalaMockClipMode                            MockClipMode;                                      // 0x0462(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_463[0x1];                                      // 0x0463(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MockClipUploadShortTime;                           // 0x0464(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MockClipUploadLongTime;                            // 0x0468(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MockClipCreateShortTime;                           // 0x046C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MockClipCreateLongTime;                            // 0x0470(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_474[0x74];                                     // 0x0474(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetTrackedClipCount();
	void HandleAthenaGamePhaseChanged(EAthenaGamePhase GamePhase);
	void HandleLocalPlayerKilledPlayer(const class AFortPlayerStateAthena* Player);
	void HandlePlayerMatchWon();
	void HandlePlayerPawnEmoteStopped(const class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting);
	void OnAvailabilityChanged(EKoalaAvailability Availability);
	void OnClipStatusChanged(int32 InClipID, EKoalaClipStatus InClipStatus, float InUploadProgress);
	void OnConnectionChanged(EKoalaConnectionStatus InStatus);
	void OnInputComplete();
	void OnInputProgress(float Progress);
	void OnRecordingStatusChanged(EKoalaRecording InRecordingStatus);
	void OnReminderEnded();
	void OnReminderTimerStarted(float Time);
	void OnTouchAreaMouseDown();
	void RegisterClipButtonInput();
	void UnregisterClipButtonInput();

	int32 GetUploadingClipCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KoalaHUDWidget">();
	}
	static class UKoalaHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoalaHUDWidget>();
	}
};
static_assert(alignof(UKoalaHUDWidget) == 0x000008, "Wrong alignment on UKoalaHUDWidget");
static_assert(sizeof(UKoalaHUDWidget) == 0x0004E8, "Wrong size on UKoalaHUDWidget");
static_assert(offsetof(UKoalaHUDWidget, ClipDebounceTime) == 0x0003B0, "Member 'UKoalaHUDWidget::ClipDebounceTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, PlayerKilledPlayerReminderTime) == 0x0003B4, "Member 'UKoalaHUDWidget::PlayerKilledPlayerReminderTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, MatchEndedReminderTime) == 0x0003B8, "Member 'UKoalaHUDWidget::MatchEndedReminderTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, ClipReminderCooldownTime) == 0x0003BC, "Member 'UKoalaHUDWidget::ClipReminderCooldownTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, EliminationClipReminderDelayTime) == 0x0003C0, "Member 'UKoalaHUDWidget::EliminationClipReminderDelayTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, ClipAudioSubmix) == 0x0003C8, "Member 'UKoalaHUDWidget::ClipAudioSubmix' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, ClipActionWidget) == 0x0003D0, "Member 'UKoalaHUDWidget::ClipActionWidget' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, ClipObjectInputAction) == 0x0003D8, "Member 'UKoalaHUDWidget::ClipObjectInputAction' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, ClipTracker) == 0x0003F0, "Member 'UKoalaHUDWidget::ClipTracker' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, LastClipID) == 0x000448, "Member 'UKoalaHUDWidget::LastClipID' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, MockClipMode) == 0x000462, "Member 'UKoalaHUDWidget::MockClipMode' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, MockClipUploadShortTime) == 0x000464, "Member 'UKoalaHUDWidget::MockClipUploadShortTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, MockClipUploadLongTime) == 0x000468, "Member 'UKoalaHUDWidget::MockClipUploadLongTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, MockClipCreateShortTime) == 0x00046C, "Member 'UKoalaHUDWidget::MockClipCreateShortTime' has a wrong offset!");
static_assert(offsetof(UKoalaHUDWidget, MockClipCreateLongTime) == 0x000470, "Member 'UKoalaHUDWidget::MockClipCreateLongTime' has a wrong offset!");

// Class KoalaUI.KoalaMainMenuButton
// 0x0010 (0x1570 - 0x1560)
class UKoalaMainMenuButton final : public UFortMainMenuButtonExtension
{
public:
	uint8                                         Pad_1560[0x10];                                    // 0x1560(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KoalaMainMenuButton">();
	}
	static class UKoalaMainMenuButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoalaMainMenuButton>();
	}
};
static_assert(alignof(UKoalaMainMenuButton) == 0x000010, "Wrong alignment on UKoalaMainMenuButton");
static_assert(sizeof(UKoalaMainMenuButton) == 0x001570, "Wrong size on UKoalaMainMenuButton");

// Class KoalaUI.KoalaSettingDetailExtension
// 0x0008 (0x0278 - 0x0270)
class UKoalaSettingDetailExtension final : public UFortSettingDetailExtension
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAvailabilityChanged(bool bAvailable);
	void OnConnectionChanged(bool bConnected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KoalaSettingDetailExtension">();
	}
	static class UKoalaSettingDetailExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKoalaSettingDetailExtension>();
	}
};
static_assert(alignof(UKoalaSettingDetailExtension) == 0x000008, "Wrong alignment on UKoalaSettingDetailExtension");
static_assert(sizeof(UKoalaSettingDetailExtension) == 0x000278, "Wrong size on UKoalaSettingDetailExtension");

}

