#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler
// 0x00B8 (0x0340 - 0x0288)
class AFortAthenaLivingWorldPointProvidersEnabler : public AActor
{
public:
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> EnabledLinkedPointProviders;                       // 0x0288(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> AvailableLinkedPointProviders;                     // 0x0298(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  EnablerTags;                                       // 0x02A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> LinkedPointProviders;                              // 0x02C8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PointProvidersToEnable;                            // 0x02D8(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EvaluateAutomatically;                             // 0x0300(0x0028)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>>& EnabledPointProviders)> OnCompletedEvaluationDelegate;                     // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	void EvaluateAndEnablePointProviders();
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void RemoveClosestPointProvidersToPoint(const struct FVector& Point, const float MaximumDistance, const int32 PointsToDisable);

	bool DoesStartEnabled() const;
	const TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> GetEnabledLinkedPointProviders() const;
	const struct FGameplayTagContainer GetEnablerTags() const;
	bool HasCompletedEvaluation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPointProvidersEnabler">();
	}
	static class AFortAthenaLivingWorldPointProvidersEnabler* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPointProvidersEnabler>();
	}
};
static_assert(alignof(AFortAthenaLivingWorldPointProvidersEnabler) == 0x000008, "Wrong alignment on AFortAthenaLivingWorldPointProvidersEnabler");
static_assert(sizeof(AFortAthenaLivingWorldPointProvidersEnabler) == 0x000340, "Wrong size on AFortAthenaLivingWorldPointProvidersEnabler");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, EnabledLinkedPointProviders) == 0x000288, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::EnabledLinkedPointProviders' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, AvailableLinkedPointProviders) == 0x000298, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::AvailableLinkedPointProviders' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, EnablerTags) == 0x0002A8, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::EnablerTags' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, LinkedPointProviders) == 0x0002C8, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::LinkedPointProviders' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, PointProvidersToEnable) == 0x0002D8, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::PointProvidersToEnable' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, EvaluateAutomatically) == 0x000300, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::EvaluateAutomatically' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPointProvidersEnabler, OnCompletedEvaluationDelegate) == 0x000330, "Member 'AFortAthenaLivingWorldPointProvidersEnabler::OnCompletedEvaluationDelegate' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride
// 0x0000 (0x0340 - 0x0340)
class AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride final : public AFortAthenaLivingWorldPointProvidersEnabler
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride">();
	}
	static class AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride>();
	}
};
static_assert(alignof(AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride) == 0x000008, "Wrong alignment on AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride");
static_assert(sizeof(AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride) == 0x000340, "Wrong size on AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride");

// Class LagerRuntime.FortAthenaLinearEncounterAnalyticComponent
// 0x0058 (0x00F8 - 0x00A0)
class UFortAthenaLinearEncounterAnalyticComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x58];                                      // 0x00A0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttackerSpawned(class AActor* SpawnedAttacker);
	void OnDefenderDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDefenderDidDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDefenderDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDefenderSpawned(class AActor* SpawnedDefender);
	void OnEncounterEnd();
	void OnEncounterStart(class UFortAthenaLivingWorldEncounterInstance* InAttackerEncounter, class UFortAthenaLivingWorldEncounterInstance* InDefenderEncounter);
	void OnStageCompleted(const TArray<class AFortPickup*>& SpawnedRewards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLinearEncounterAnalyticComponent">();
	}
	static class UFortAthenaLinearEncounterAnalyticComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLinearEncounterAnalyticComponent>();
	}
};
static_assert(alignof(UFortAthenaLinearEncounterAnalyticComponent) == 0x000008, "Wrong alignment on UFortAthenaLinearEncounterAnalyticComponent");
static_assert(sizeof(UFortAthenaLinearEncounterAnalyticComponent) == 0x0000F8, "Wrong size on UFortAthenaLinearEncounterAnalyticComponent");

// Class LagerRuntime.FortAthenaLivingWorldConditionSchema
// 0x0000 (0x0038 - 0x0038)
class UFortAthenaLivingWorldConditionSchema : public UWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldConditionSchema">();
	}
	static class UFortAthenaLivingWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldConditionSchema>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldConditionSchema) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldConditionSchema");
static_assert(sizeof(UFortAthenaLivingWorldConditionSchema) == 0x000038, "Wrong size on UFortAthenaLivingWorldConditionSchema");

// Class LagerRuntime.FortAthenaLivingWorldConfigData
// 0x0200 (0x0230 - 0x0030)
class UFortAthenaLivingWorldConfigData final : public UDataAsset
{
public:
	TArray<struct FFortAthenaLivingWorldCategoryTableData> CategoryTableDatas;                                // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorCount;                                     // 0x0040(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxEventSpawnPerTick;                              // 0x0068(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorDespawnPerTick;                            // 0x0090(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinimumEventGenerationInterval;                    // 0x00B8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorDensity;                                   // 0x00E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorUpdatesPerTick;                            // 0x0108(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ActorDensityGridCellSize;                          // 0x0130(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PointClusterSize;                                  // 0x0158(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinNumberOfPlayerForAggressiveSpawning;            // 0x0180(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldTagDensityGridData> TagDensityGridData;                                // 0x01A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      SingleUseSpawnerDataQuery;                         // 0x01B8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class AActor>                     EQSActorHelperClass;                               // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DelayEventGeneration;                              // 0x0208(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldConfigData">();
	}
	static class UFortAthenaLivingWorldConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldConfigData>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldConfigData) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldConfigData");
static_assert(sizeof(UFortAthenaLivingWorldConfigData) == 0x000230, "Wrong size on UFortAthenaLivingWorldConfigData");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, CategoryTableDatas) == 0x000030, "Member 'UFortAthenaLivingWorldConfigData::CategoryTableDatas' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MaxActorCount) == 0x000040, "Member 'UFortAthenaLivingWorldConfigData::MaxActorCount' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MaxEventSpawnPerTick) == 0x000068, "Member 'UFortAthenaLivingWorldConfigData::MaxEventSpawnPerTick' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MaxActorDespawnPerTick) == 0x000090, "Member 'UFortAthenaLivingWorldConfigData::MaxActorDespawnPerTick' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MinimumEventGenerationInterval) == 0x0000B8, "Member 'UFortAthenaLivingWorldConfigData::MinimumEventGenerationInterval' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MaxActorDensity) == 0x0000E0, "Member 'UFortAthenaLivingWorldConfigData::MaxActorDensity' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MaxActorUpdatesPerTick) == 0x000108, "Member 'UFortAthenaLivingWorldConfigData::MaxActorUpdatesPerTick' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, ActorDensityGridCellSize) == 0x000130, "Member 'UFortAthenaLivingWorldConfigData::ActorDensityGridCellSize' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, PointClusterSize) == 0x000158, "Member 'UFortAthenaLivingWorldConfigData::PointClusterSize' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, MinNumberOfPlayerForAggressiveSpawning) == 0x000180, "Member 'UFortAthenaLivingWorldConfigData::MinNumberOfPlayerForAggressiveSpawning' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, TagDensityGridData) == 0x0001A8, "Member 'UFortAthenaLivingWorldConfigData::TagDensityGridData' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, SingleUseSpawnerDataQuery) == 0x0001B8, "Member 'UFortAthenaLivingWorldConfigData::SingleUseSpawnerDataQuery' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, EQSActorHelperClass) == 0x000200, "Member 'UFortAthenaLivingWorldConfigData::EQSActorHelperClass' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldConfigData, DelayEventGeneration) == 0x000208, "Member 'UFortAthenaLivingWorldConfigData::DelayEventGeneration' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldDebugDensityMiniMapIndicator
// 0x0050 (0x0190 - 0x0140)
class UFortAthenaLivingWorldDebugDensityMiniMapIndicator final : public UFortMiniMapIndicator
{
public:
	TArray<struct FFortAthenaActorDensityDebugInfo> ActorDebugInfos;                                   // 0x0140(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 DensityGridValues;                                 // 0x0150(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FVector                                GridOrigin;                                        // 0x0160(0x0018)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntVector                             MaxGridSize;                                       // 0x0178(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CellSize;                                          // 0x0184(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxDensity;                                        // 0x0188(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldDebugDensityMiniMapIndicator">();
	}
	static class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldDebugDensityMiniMapIndicator>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldDebugDensityMiniMapIndicator");
static_assert(sizeof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator) == 0x000190, "Wrong size on UFortAthenaLivingWorldDebugDensityMiniMapIndicator");
static_assert(offsetof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator, ActorDebugInfos) == 0x000140, "Member 'UFortAthenaLivingWorldDebugDensityMiniMapIndicator::ActorDebugInfos' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator, DensityGridValues) == 0x000150, "Member 'UFortAthenaLivingWorldDebugDensityMiniMapIndicator::DensityGridValues' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator, GridOrigin) == 0x000160, "Member 'UFortAthenaLivingWorldDebugDensityMiniMapIndicator::GridOrigin' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator, MaxGridSize) == 0x000178, "Member 'UFortAthenaLivingWorldDebugDensityMiniMapIndicator::MaxGridSize' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator, CellSize) == 0x000184, "Member 'UFortAthenaLivingWorldDebugDensityMiniMapIndicator::CellSize' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldDebugDensityMiniMapIndicator, MaxDensity) == 0x000188, "Member 'UFortAthenaLivingWorldDebugDensityMiniMapIndicator::MaxDensity' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldDespawnConditionSchema
// 0x0008 (0x0040 - 0x0038)
class UFortAthenaLivingWorldDespawnConditionSchema final : public UFortAthenaLivingWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldDespawnConditionSchema">();
	}
	static class UFortAthenaLivingWorldDespawnConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldDespawnConditionSchema>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldDespawnConditionSchema) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldDespawnConditionSchema");
static_assert(sizeof(UFortAthenaLivingWorldDespawnConditionSchema) == 0x000040, "Wrong size on UFortAthenaLivingWorldDespawnConditionSchema");

// Class LagerRuntime.FortAthenaLivingWorldEncounter
// 0x0038 (0x0068 - 0x0030)
class UFortAthenaLivingWorldEncounter final : public UDataAsset
{
public:
	struct FScalableFloat                         IntervalBetweenEventGeneration;                    // 0x0030(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEncounterStage> Stages;                                            // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEncounter">();
	}
	static class UFortAthenaLivingWorldEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEncounter>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldEncounter) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldEncounter");
static_assert(sizeof(UFortAthenaLivingWorldEncounter) == 0x000068, "Wrong size on UFortAthenaLivingWorldEncounter");
static_assert(offsetof(UFortAthenaLivingWorldEncounter, IntervalBetweenEventGeneration) == 0x000030, "Member 'UFortAthenaLivingWorldEncounter::IntervalBetweenEventGeneration' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounter, Stages) == 0x000058, "Member 'UFortAthenaLivingWorldEncounter::Stages' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldEncounterInstance
// 0x0130 (0x0158 - 0x0028)
class UFortAthenaLivingWorldEncounterInstance final : public UObject
{
public:
	TMulticastInlineDelegate<void(class AActor* SpawnedActor)> OnActorSpawned;                                    // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* DestroyedActor)> OnActorDestroyed;                                  // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLivingWorldConditionContainer ConditionContainer;                                // 0x0098(0x0018)(Transient, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> AllowedPointProviders;                             // 0x00B0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> RegisteredPointProviders;                          // 0x00C0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortAthenaLivingWorldEventData*> RuntimeCreatedEventDatas;                          // 0x00D0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x20];                                      // 0x00E0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterDefinition;                               // 0x0100(0x0028)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 ActorDensityReservoir;                             // 0x0128(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         SpawnedActors;                                     // 0x0130(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentStageIndex;                                 // 0x0148(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPaused;                                         // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAllowedPointProvider(const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& PointProvider);
	void AdvanceEncounterStage();
	void PauseEncounter();
	void RemoveAllowedPointProvider(const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& PointProvider);
	void RequestEventGeneration();
	void Reset();
	void ResumeEncounter();
	void StartEncounterStage(const int32 StageIndex);

	int32 GetTotalActorCount() const;
	bool OwnsActor(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEncounterInstance">();
	}
	static class UFortAthenaLivingWorldEncounterInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEncounterInstance>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldEncounterInstance) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldEncounterInstance");
static_assert(sizeof(UFortAthenaLivingWorldEncounterInstance) == 0x000158, "Wrong size on UFortAthenaLivingWorldEncounterInstance");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, OnActorSpawned) == 0x000028, "Member 'UFortAthenaLivingWorldEncounterInstance::OnActorSpawned' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, OnActorDestroyed) == 0x000038, "Member 'UFortAthenaLivingWorldEncounterInstance::OnActorDestroyed' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, ConditionContainer) == 0x000098, "Member 'UFortAthenaLivingWorldEncounterInstance::ConditionContainer' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, AllowedPointProviders) == 0x0000B0, "Member 'UFortAthenaLivingWorldEncounterInstance::AllowedPointProviders' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, RegisteredPointProviders) == 0x0000C0, "Member 'UFortAthenaLivingWorldEncounterInstance::RegisteredPointProviders' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, RuntimeCreatedEventDatas) == 0x0000D0, "Member 'UFortAthenaLivingWorldEncounterInstance::RuntimeCreatedEventDatas' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, EncounterDefinition) == 0x000100, "Member 'UFortAthenaLivingWorldEncounterInstance::EncounterDefinition' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, ActorDensityReservoir) == 0x000128, "Member 'UFortAthenaLivingWorldEncounterInstance::ActorDensityReservoir' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, SpawnedActors) == 0x000130, "Member 'UFortAthenaLivingWorldEncounterInstance::SpawnedActors' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, CurrentStageIndex) == 0x000148, "Member 'UFortAthenaLivingWorldEncounterInstance::CurrentStageIndex' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEncounterInstance, bIsPaused) == 0x000150, "Member 'UFortAthenaLivingWorldEncounterInstance::bIsPaused' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldEventData
// 0x0100 (0x0130 - 0x0030)
class UFortAthenaLivingWorldEventData final : public UDataAsset
{
public:
	int32                                         TimeOfDayFilters;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WaterLevelIndexMin;                                // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WaterLevelIndexMax;                                // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryDefinition         CanSpawnCondition;                                 // 0x0040(0x0018)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldDespawnCondition> DespawnConditions;                                 // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      ProviderFiltersTagQuery;                           // 0x0068(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FPointProviderFilterEntry>      ProviderFiltersEntries;                            // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldTaggedSpawnActionClass> SpawnActions;                                      // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinActorCountToSpawn;                              // 0x00D0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorCountToSpawn;                              // 0x00F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEventDataActorSpawnDescription> ActorDescriptions;                                 // 0x0120(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEventData">();
	}
	static class UFortAthenaLivingWorldEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEventData>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldEventData) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldEventData");
static_assert(sizeof(UFortAthenaLivingWorldEventData) == 0x000130, "Wrong size on UFortAthenaLivingWorldEventData");
static_assert(offsetof(UFortAthenaLivingWorldEventData, TimeOfDayFilters) == 0x000030, "Member 'UFortAthenaLivingWorldEventData::TimeOfDayFilters' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, WaterLevelIndexMin) == 0x000034, "Member 'UFortAthenaLivingWorldEventData::WaterLevelIndexMin' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, WaterLevelIndexMax) == 0x000038, "Member 'UFortAthenaLivingWorldEventData::WaterLevelIndexMax' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, CanSpawnCondition) == 0x000040, "Member 'UFortAthenaLivingWorldEventData::CanSpawnCondition' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, DespawnConditions) == 0x000058, "Member 'UFortAthenaLivingWorldEventData::DespawnConditions' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, ProviderFiltersTagQuery) == 0x000068, "Member 'UFortAthenaLivingWorldEventData::ProviderFiltersTagQuery' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, ProviderFiltersEntries) == 0x0000B0, "Member 'UFortAthenaLivingWorldEventData::ProviderFiltersEntries' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, SpawnActions) == 0x0000C0, "Member 'UFortAthenaLivingWorldEventData::SpawnActions' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, MinActorCountToSpawn) == 0x0000D0, "Member 'UFortAthenaLivingWorldEventData::MinActorCountToSpawn' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, MaxActorCountToSpawn) == 0x0000F8, "Member 'UFortAthenaLivingWorldEventData::MaxActorCountToSpawn' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldEventData, ActorDescriptions) == 0x000120, "Member 'UFortAthenaLivingWorldEventData::ActorDescriptions' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldManager
// 0x0A20 (0x0AC0 - 0x00A0)
class UFortAthenaLivingWorldManager : public UGameStateComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaLivingWorldConfigData> DefaultLagerConfig;                                // 0x00A8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortLivingWorldConfigOverride> LagerConfigOverrides;                              // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LagerEnabled;                                      // 0x00E0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, TSubclassOf<class UFortAthenaLivingWorldSpawnAction>> TaggedSpawnActionClassMap;                         // 0x0108(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> PointProviders;                                    // 0x0158(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SpecialActorMinimapIconBrush;                      // 0x0170(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector2D                              SpecialActorMinimapIconScale;                      // 0x0230(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            SpecialActorCompassIconBrush;                      // 0x0240(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector2D                              SpecialActorCompassIconScale;                      // 0x0300(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UFortAthenaSpawnerDataBase>> SpawnedSingleUseSpawnerData;                       // 0x0310(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UWorld*                                 CachedWorld;                                       // 0x0320(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldConfigData*       CachedConfig;                                      // 0x0328(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortAthenaLivingWorldEncounterInstance*> RunningEncounterInstances;                         // 0x0330(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortSeasonalEventManager*              CachedSeasonalEventManager;                        // 0x0340(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSoftClassPtr<class UClass>>           ActorClassToPreloadOnClient;                       // 0x0348(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldActorUpdateHandler ActorUpdateHandler;                                // 0x0358(0x00B0)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldPlayerTracker    PlayerTracker;                                     // 0x0408(0x00B0)(Transient, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldPreloader        Preloader;                                         // 0x04B8(0x00E0)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldConditionContainer GlobalConditionContainer;                          // 0x0598(0x0018)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B0[0x258];                                    // 0x05B0(0x0258)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         RuntimePointProviderList;                          // 0x0808(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSet<class AActor*>                           RuntimePointProviderOwners;                        // 0x0818(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_868[0x1D0];                                    // 0x0868(0x01D0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSubclassOf<class UFortAthenaLivingWorldSpawnAction>, class UFortAthenaLivingWorldSpawnAction*> SpawnActionCache;                                  // 0x0A38(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AActor*                                 EQSHelper;                                         // 0x0A88(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* DebugDensityMinimapIndicator;                      // 0x0A90(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A98[0x28];                                     // 0x0A98(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAthenaLivingWorldManager* GetLivingWorldManager(class UObject* WorldContextObject);
	static void LivingWorldManagerRegisterPointProvider(class AActor* PointProvider);
	static void LivingWorldManagerUnregisterPointProvider(class AActor* PointProvider);

	void CancelSpawnRequest(const int32 RequestID);
	void EndEncounter(class UFortAthenaLivingWorldEncounterInstance* EncounterInstance);
	void LivingWorldManagerDebugEvent(const class FString& EventName, int32 DebugIndex, const class FString& RuntimeSpawnDataName, const class FString& EncounterName);
	void LivingWorldManagerDisplaySpawnPoints(float MaxDisplayDistance, float MinDisplayDistance);
	void LivingWorldManagerDumpEventInstances();
	void LivingWorldManagerDumpPrefabLevelBounds();
	void LivingWorldManagerDumpSpawnCount();
	void LivingWorldManagerFlush();
	void LivingWorldManagerGenerateEvents();
	void LivingWorldManagerProviderDebugActor(int32 ProviderIndex);
	void LivingWorldManagerSetEventGenerationEnabled(const bool bInGenerateEvents);
	void LivingWorldManagerToggleActorMinimap(const class FString& Name_0);
	void LivingWorldManagerToggleDensityDisplay();
	void LivingWorldManagerToggleGenerateEvents();
	void LivingWorldManagerToggleVerboseLogging();
	void LWMF();
	void LWMTAM(const class FString& Name_0);
	void OnActorSpawned(class AActor* Actor, int32 RequestID);
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnDebugSpawnEventSpawned(const TArray<class AActor*>& SpawnedActors, bool bSuccess);
	void OnPatrolPathAdded(class AFortAthenaPatrolPath* PatrolPath);
	void OnRep_ActorClassToPreloadOnClient();
	void OnRep_DebugDensityMinimapIndicator(class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* OldMapIndicator);
	void OnSpawnedActorDestroy(class AActor* DestroyedActor);
	void OnUnmanagedDensityReservoirActorDestroy(class AActor* DestroyedActor);
	void OnWorldFinishedInitialization(const struct FGameplayTagContainer& ContextTags);
	void RegisterDensityReservoir(class AActor* ActorDensityReservoir, float Density, float Range);
	void RequestEventGeneration();
	void ResetEncounter(class UFortAthenaLivingWorldEncounterInstance* EncounterInstance);
	class UFortAthenaLivingWorldEncounterInstance* StartEncounter(const TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterType, const TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>>& EncounterPointProviders, class AActor* ActorDensityReservoir);
	bool TrySpawnEvent(const struct FDataTableRowHandle& EventEntry, const struct FTransform& SpawnLocation, const TDelegate<void(TArray<class AActor*>& SpawnedActors, bool bSuccess)>& OnRequestFinished, int32* RequestID);
	void UnregisterDensityReservoir(class AActor* ActorDensityReservoir);

	bool BuildDataRegistryResolverScope_Implementation(TArray<class FName>* InOutResolverScopes, int32* InOutPriority) const;
	class UFortAthenaLivingWorldEncounterInstance* GetOwningEncounter(class AActor* Actor) const;
	bool IsEncounterCategoryActive(const TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterType) const;
	int32 QueryEventBudget(const struct FDataTableRowHandle& EventEntry, const class AActor* SpawnLocation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldManager">();
	}
	static class UFortAthenaLivingWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldManager>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldManager) == 0x000010, "Wrong alignment on UFortAthenaLivingWorldManager");
static_assert(sizeof(UFortAthenaLivingWorldManager) == 0x000AC0, "Wrong size on UFortAthenaLivingWorldManager");
static_assert(offsetof(UFortAthenaLivingWorldManager, DefaultLagerConfig) == 0x0000A8, "Member 'UFortAthenaLivingWorldManager::DefaultLagerConfig' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, LagerConfigOverrides) == 0x0000D0, "Member 'UFortAthenaLivingWorldManager::LagerConfigOverrides' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, LagerEnabled) == 0x0000E0, "Member 'UFortAthenaLivingWorldManager::LagerEnabled' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, TaggedSpawnActionClassMap) == 0x000108, "Member 'UFortAthenaLivingWorldManager::TaggedSpawnActionClassMap' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, PointProviders) == 0x000158, "Member 'UFortAthenaLivingWorldManager::PointProviders' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, SpecialActorMinimapIconBrush) == 0x000170, "Member 'UFortAthenaLivingWorldManager::SpecialActorMinimapIconBrush' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, SpecialActorMinimapIconScale) == 0x000230, "Member 'UFortAthenaLivingWorldManager::SpecialActorMinimapIconScale' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, SpecialActorCompassIconBrush) == 0x000240, "Member 'UFortAthenaLivingWorldManager::SpecialActorCompassIconBrush' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, SpecialActorCompassIconScale) == 0x000300, "Member 'UFortAthenaLivingWorldManager::SpecialActorCompassIconScale' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, SpawnedSingleUseSpawnerData) == 0x000310, "Member 'UFortAthenaLivingWorldManager::SpawnedSingleUseSpawnerData' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, CachedWorld) == 0x000320, "Member 'UFortAthenaLivingWorldManager::CachedWorld' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, CachedConfig) == 0x000328, "Member 'UFortAthenaLivingWorldManager::CachedConfig' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, RunningEncounterInstances) == 0x000330, "Member 'UFortAthenaLivingWorldManager::RunningEncounterInstances' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, CachedSeasonalEventManager) == 0x000340, "Member 'UFortAthenaLivingWorldManager::CachedSeasonalEventManager' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, ActorClassToPreloadOnClient) == 0x000348, "Member 'UFortAthenaLivingWorldManager::ActorClassToPreloadOnClient' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, ActorUpdateHandler) == 0x000358, "Member 'UFortAthenaLivingWorldManager::ActorUpdateHandler' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, PlayerTracker) == 0x000408, "Member 'UFortAthenaLivingWorldManager::PlayerTracker' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, Preloader) == 0x0004B8, "Member 'UFortAthenaLivingWorldManager::Preloader' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, GlobalConditionContainer) == 0x000598, "Member 'UFortAthenaLivingWorldManager::GlobalConditionContainer' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, RuntimePointProviderList) == 0x000808, "Member 'UFortAthenaLivingWorldManager::RuntimePointProviderList' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, RuntimePointProviderOwners) == 0x000818, "Member 'UFortAthenaLivingWorldManager::RuntimePointProviderOwners' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, SpawnActionCache) == 0x000A38, "Member 'UFortAthenaLivingWorldManager::SpawnActionCache' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, EQSHelper) == 0x000A88, "Member 'UFortAthenaLivingWorldManager::EQSHelper' has a wrong offset!");
static_assert(offsetof(UFortAthenaLivingWorldManager, DebugDensityMinimapIndicator) == 0x000A90, "Member 'UFortAthenaLivingWorldManager::DebugDensityMinimapIndicator' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldPointProviderInterface
// 0x0000 (0x0028 - 0x0028)
class IFortAthenaLivingWorldPointProviderInterface final : public IInterface
{
public:
	void DisablePointProvider();
	void EnablePointProvider();
	struct FVector GetPointProviderLocation();

	void GetFiltersTags(struct FGameplayTagContainer* FilterTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPointProviderInterface">();
	}
	static class IFortAthenaLivingWorldPointProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAthenaLivingWorldPointProviderInterface>();
	}
};
static_assert(alignof(IFortAthenaLivingWorldPointProviderInterface) == 0x000008, "Wrong alignment on IFortAthenaLivingWorldPointProviderInterface");
static_assert(sizeof(IFortAthenaLivingWorldPointProviderInterface) == 0x000028, "Wrong size on IFortAthenaLivingWorldPointProviderInterface");

// Class LagerRuntime.FortAthenaLivingWorldPrefabLevelStreaming
// 0x0000 (0x01C0 - 0x01C0)
class UFortAthenaLivingWorldPrefabLevelStreaming final : public ULevelStreamingLevelInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPrefabLevelStreaming">();
	}
	static class UFortAthenaLivingWorldPrefabLevelStreaming* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldPrefabLevelStreaming>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldPrefabLevelStreaming) == 0x000010, "Wrong alignment on UFortAthenaLivingWorldPrefabLevelStreaming");
static_assert(sizeof(UFortAthenaLivingWorldPrefabLevelStreaming) == 0x0001C0, "Wrong size on UFortAthenaLivingWorldPrefabLevelStreaming");

// Class LagerRuntime.FortAthenaLivingWorldPrefab
// 0x0150 (0x0990 - 0x0840)
class AFortAthenaLivingWorldPrefab final : public ABuildingLevelInstance
{
public:
	TArray<struct FFortAthenaLivingWorldPrefabActorSpawnerData> ActorSpawnerDatas;                                 // 0x0840(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   LocalLevelBounds;                                  // 0x0850(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   LocalGrassRemovalBox;                              // 0x0888(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(TArray<class AActor*>& SpawnedActors)> OnAllActorSpawnedDelegate;                         // 0x08C0(0x0010)(ZeroConstructor, Transient, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D0[0x18];                                     // 0x08D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class ABuildingActor>>  BuildingsToKill;                                   // 0x08E8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          SpawnedActors;                                     // 0x08F8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TDelegate<void()>                             FinishedDestroyingBuildingCallback;                // 0x0908(0x000C)(ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasFinishedSpawn;                                 // 0x0914(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRemovedFoliage;                                // 0x0915(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_916[0x2];                                      // 0x0916(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bIsEnabled;                                        // 0x0918(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Weight;                                            // 0x0940(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldLevelBeVisible;                             // 0x0968(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldSpawnerBeAllowedToSpawn;                    // 0x0969(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldAlwaysSnapAboveLandscape;                   // 0x096A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_96B[0x5];                                      // 0x096B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryDefinition         CanSpawnCondition;                                 // 0x0970(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_988[0x8];                                      // 0x0988(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class AFortAthenaLivingWorldPrefab* GetOwningLivingWorldPrefab(const class UObject* WorldContextObject);

	void AllowSpawnerToSpawn();
	void CallWhenAllActorHaveSpawned(const TDelegate<void(TArray<class AActor*>& SpawnedActors)>& DelegateToCall);
	void DestroyBuildingsInLevelBounds(const TDelegate<void()>& FinishedDelegate);
	void MakeLevelVisible();
	void OnLevelShown();
	void OnRep_ShouldLevelBeVisible();
	void RemoveFoliageInsideLevelBound();

	struct FBox GetLevelBounds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPrefab">();
	}
	static class AFortAthenaLivingWorldPrefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPrefab>();
	}
};
static_assert(alignof(AFortAthenaLivingWorldPrefab) == 0x000008, "Wrong alignment on AFortAthenaLivingWorldPrefab");
static_assert(sizeof(AFortAthenaLivingWorldPrefab) == 0x000990, "Wrong size on AFortAthenaLivingWorldPrefab");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, ActorSpawnerDatas) == 0x000840, "Member 'AFortAthenaLivingWorldPrefab::ActorSpawnerDatas' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, LocalLevelBounds) == 0x000850, "Member 'AFortAthenaLivingWorldPrefab::LocalLevelBounds' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, LocalGrassRemovalBox) == 0x000888, "Member 'AFortAthenaLivingWorldPrefab::LocalGrassRemovalBox' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, OnAllActorSpawnedDelegate) == 0x0008C0, "Member 'AFortAthenaLivingWorldPrefab::OnAllActorSpawnedDelegate' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, BuildingsToKill) == 0x0008E8, "Member 'AFortAthenaLivingWorldPrefab::BuildingsToKill' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, SpawnedActors) == 0x0008F8, "Member 'AFortAthenaLivingWorldPrefab::SpawnedActors' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, FinishedDestroyingBuildingCallback) == 0x000908, "Member 'AFortAthenaLivingWorldPrefab::FinishedDestroyingBuildingCallback' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, bHasFinishedSpawn) == 0x000914, "Member 'AFortAthenaLivingWorldPrefab::bHasFinishedSpawn' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, bHasRemovedFoliage) == 0x000915, "Member 'AFortAthenaLivingWorldPrefab::bHasRemovedFoliage' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, bIsEnabled) == 0x000918, "Member 'AFortAthenaLivingWorldPrefab::bIsEnabled' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, Weight) == 0x000940, "Member 'AFortAthenaLivingWorldPrefab::Weight' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, bShouldLevelBeVisible) == 0x000968, "Member 'AFortAthenaLivingWorldPrefab::bShouldLevelBeVisible' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, bShouldSpawnerBeAllowedToSpawn) == 0x000969, "Member 'AFortAthenaLivingWorldPrefab::bShouldSpawnerBeAllowedToSpawn' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, bShouldAlwaysSnapAboveLandscape) == 0x00096A, "Member 'AFortAthenaLivingWorldPrefab::bShouldAlwaysSnapAboveLandscape' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefab, CanSpawnCondition) == 0x000970, "Member 'AFortAthenaLivingWorldPrefab::CanSpawnCondition' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldPrefabActorSpawner
// 0x0130 (0x03B8 - 0x0288)
class AFortAthenaLivingWorldPrefabActorSpawner final : public AActor
{
public:
	struct FFortAthenaLivingWorldActorSpawnDescription ActorDescription;                                  // 0x0288(0x0100)(Edit, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* SpawnedActor)> OnActorSpawnedDelegate;                            // 0x0388(0x0010)(ZeroConstructor, Transient, InstancedReference, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaPatrolPath*                  PatrolPath;                                        // 0x0398(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x03A0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x03B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void CallWhenActorSpawned(const TDelegate<void(class AActor* SpawnedActor)>& DelegateToCall);
	void OnSnapCompleted(class UFortSnapOnSurfaceComponent* Component, const struct FTransform& OldTransform, const struct FTransform& NewTransfom);

	class AActor* GetSpawnedActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPrefabActorSpawner">();
	}
	static class AFortAthenaLivingWorldPrefabActorSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPrefabActorSpawner>();
	}
};
static_assert(alignof(AFortAthenaLivingWorldPrefabActorSpawner) == 0x000008, "Wrong alignment on AFortAthenaLivingWorldPrefabActorSpawner");
static_assert(sizeof(AFortAthenaLivingWorldPrefabActorSpawner) == 0x0003B8, "Wrong size on AFortAthenaLivingWorldPrefabActorSpawner");
static_assert(offsetof(AFortAthenaLivingWorldPrefabActorSpawner, ActorDescription) == 0x000288, "Member 'AFortAthenaLivingWorldPrefabActorSpawner::ActorDescription' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefabActorSpawner, OnActorSpawnedDelegate) == 0x000388, "Member 'AFortAthenaLivingWorldPrefabActorSpawner::OnActorSpawnedDelegate' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefabActorSpawner, PatrolPath) == 0x000398, "Member 'AFortAthenaLivingWorldPrefabActorSpawner::PatrolPath' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefabActorSpawner, Guid) == 0x0003A0, "Member 'AFortAthenaLivingWorldPrefabActorSpawner::Guid' has a wrong offset!");
static_assert(offsetof(AFortAthenaLivingWorldPrefabActorSpawner, SpawnedActor) == 0x0003B0, "Member 'AFortAthenaLivingWorldPrefabActorSpawner::SpawnedActor' has a wrong offset!");

// Class LagerRuntime.FortAthenaLivingWorldSpawnAction
// 0x0000 (0x0028 - 0x0028)
class UFortAthenaLivingWorldSpawnAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldSpawnAction">();
	}
	static class UFortAthenaLivingWorldSpawnAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldSpawnAction>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldSpawnAction) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldSpawnAction");
static_assert(sizeof(UFortAthenaLivingWorldSpawnAction) == 0x000028, "Wrong size on UFortAthenaLivingWorldSpawnAction");

// Class LagerRuntime.FortAthenaLivingWorldSpawnActionBlueprint
// 0x0000 (0x0028 - 0x0028)
class UFortAthenaLivingWorldSpawnActionBlueprint final : public UFortAthenaLivingWorldSpawnAction
{
public:
	void K2_OnAllActorSpawned(const TArray<class AActor*>& SpawnedActor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldSpawnActionBlueprint">();
	}
	static class UFortAthenaLivingWorldSpawnActionBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldSpawnActionBlueprint>();
	}
};
static_assert(alignof(UFortAthenaLivingWorldSpawnActionBlueprint) == 0x000008, "Wrong alignment on UFortAthenaLivingWorldSpawnActionBlueprint");
static_assert(sizeof(UFortAthenaLivingWorldSpawnActionBlueprint) == 0x000028, "Wrong size on UFortAthenaLivingWorldSpawnActionBlueprint");

// Class LagerRuntime.FortAthenaLivingWorldStaticPointProvider
// 0x00D0 (0x0358 - 0x0288)
class AFortAthenaLivingWorldStaticPointProvider : public AActor
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
