#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LandscapePatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Landscape_classes.hpp"
#include "LandscapePatch_structs.hpp"


namespace SDK
{

// Class LandscapePatch.LandscapePatchComponent
// 0x0080 (0x0320 - 0x02A0)
class ULandscapePatchComponent : public USceneComponent
{
public:
	TSoftObjectPtr<class ALandscape>              Landscape;                                         // 0x02A0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class ALandscapePatchManager>  PatchManager;                                      // 0x02C8(0x0028)(Edit, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x02F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x2];                                      // 0x02F1(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPropertiesCopiedIndicator;                        // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ALandscapePatchManager>  PreviousPatchManager;                              // 0x02F8(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void MoveToTop();
	void RequestLandscapeUpdate(bool bInUserTriggeredUpdate);
	void SetIsEnabled(bool bEnabledIn);
	void SetLandscape(class ALandscape* NewLandscape);
	void SetPatchManager(class ALandscapePatchManager* NewPatchManager);

	struct FTransform GetLandscapeHeightmapCoordsToWorld() const;
	class ALandscapePatchManager* GetPatchManager() const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapePatchComponent">();
	}
	static class ULandscapePatchComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapePatchComponent>();
	}
};
static_assert(alignof(ULandscapePatchComponent) == 0x000010, "Wrong alignment on ULandscapePatchComponent");
static_assert(sizeof(ULandscapePatchComponent) == 0x000320, "Wrong size on ULandscapePatchComponent");
static_assert(offsetof(ULandscapePatchComponent, Landscape) == 0x0002A0, "Member 'ULandscapePatchComponent::Landscape' has a wrong offset!");
static_assert(offsetof(ULandscapePatchComponent, PatchManager) == 0x0002C8, "Member 'ULandscapePatchComponent::PatchManager' has a wrong offset!");
static_assert(offsetof(ULandscapePatchComponent, bIsEnabled) == 0x0002F0, "Member 'ULandscapePatchComponent::bIsEnabled' has a wrong offset!");
static_assert(offsetof(ULandscapePatchComponent, bPropertiesCopiedIndicator) == 0x0002F3, "Member 'ULandscapePatchComponent::bPropertiesCopiedIndicator' has a wrong offset!");
static_assert(offsetof(ULandscapePatchComponent, PreviousPatchManager) == 0x0002F8, "Member 'ULandscapePatchComponent::PreviousPatchManager' has a wrong offset!");

// Class LandscapePatch.LandscapeCircleHeightPatch
// 0x0010 (0x0330 - 0x0320)
class ULandscapeCircleHeightPatch final : public ULandscapePatchComponent
{
public:
	float                                         Radius;                                            // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Falloff;                                           // 0x0324(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEditVisibility;                                   // 0x0328(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExclusiveRadius;                                  // 0x0329(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeCircleHeightPatch">();
	}
	static class ULandscapeCircleHeightPatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeCircleHeightPatch>();
	}
};
static_assert(alignof(ULandscapeCircleHeightPatch) == 0x000010, "Wrong alignment on ULandscapeCircleHeightPatch");
static_assert(sizeof(ULandscapeCircleHeightPatch) == 0x000330, "Wrong size on ULandscapeCircleHeightPatch");
static_assert(offsetof(ULandscapeCircleHeightPatch, Radius) == 0x000320, "Member 'ULandscapeCircleHeightPatch::Radius' has a wrong offset!");
static_assert(offsetof(ULandscapeCircleHeightPatch, Falloff) == 0x000324, "Member 'ULandscapeCircleHeightPatch::Falloff' has a wrong offset!");
static_assert(offsetof(ULandscapeCircleHeightPatch, bEditVisibility) == 0x000328, "Member 'ULandscapeCircleHeightPatch::bEditVisibility' has a wrong offset!");
static_assert(offsetof(ULandscapeCircleHeightPatch, bExclusiveRadius) == 0x000329, "Member 'ULandscapeCircleHeightPatch::bExclusiveRadius' has a wrong offset!");

// Class LandscapePatch.LandscapePatchManager
// 0x0078 (0x0300 - 0x0288)
class ALandscapePatchManager final : public ALandscapeBlueprintBrushBase
{
public:
	TArray<TSoftObjectPtr<class ULandscapePatchComponent>> PatchComponents;                                   // 0x0288(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HeightmapCoordsToWorld;                            // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapePatchManager">();
	}
	static class ALandscapePatchManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapePatchManager>();
	}
};
static_assert(alignof(ALandscapePatchManager) == 0x000010, "Wrong alignment on ALandscapePatchManager");
static_assert(sizeof(ALandscapePatchManager) == 0x000300, "Wrong size on ALandscapePatchManager");
static_assert(offsetof(ALandscapePatchManager, PatchComponents) == 0x000288, "Member 'ALandscapePatchManager::PatchComponents' has a wrong offset!");
static_assert(offsetof(ALandscapePatchManager, HeightmapCoordsToWorld) == 0x0002A0, "Member 'ALandscapePatchManager::HeightmapCoordsToWorld' has a wrong offset!");

// Class LandscapePatch.LandscapeTextureBackedRenderTargetBase
// 0x0028 (0x0050 - 0x0028)
class ULandscapeTextureBackedRenderTargetBase : public UObject
{
public:
	class UTextureRenderTarget2D*                 PostLoadRT;                                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             InternalTexture;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SizeX;                                             // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SizeY;                                             // 0x0044(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseInternalTextureOnly;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeTextureBackedRenderTargetBase">();
	}
	static class ULandscapeTextureBackedRenderTargetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeTextureBackedRenderTargetBase>();
	}
};
static_assert(alignof(ULandscapeTextureBackedRenderTargetBase) == 0x000008, "Wrong alignment on ULandscapeTextureBackedRenderTargetBase");
static_assert(sizeof(ULandscapeTextureBackedRenderTargetBase) == 0x000050, "Wrong size on ULandscapeTextureBackedRenderTargetBase");
static_assert(offsetof(ULandscapeTextureBackedRenderTargetBase, PostLoadRT) == 0x000028, "Member 'ULandscapeTextureBackedRenderTargetBase::PostLoadRT' has a wrong offset!");
static_assert(offsetof(ULandscapeTextureBackedRenderTargetBase, InternalTexture) == 0x000030, "Member 'ULandscapeTextureBackedRenderTargetBase::InternalTexture' has a wrong offset!");
static_assert(offsetof(ULandscapeTextureBackedRenderTargetBase, RenderTarget) == 0x000038, "Member 'ULandscapeTextureBackedRenderTargetBase::RenderTarget' has a wrong offset!");
static_assert(offsetof(ULandscapeTextureBackedRenderTargetBase, SizeX) == 0x000040, "Member 'ULandscapeTextureBackedRenderTargetBase::SizeX' has a wrong offset!");
static_assert(offsetof(ULandscapeTextureBackedRenderTargetBase, SizeY) == 0x000044, "Member 'ULandscapeTextureBackedRenderTargetBase::SizeY' has a wrong offset!");
static_assert(offsetof(ULandscapeTextureBackedRenderTargetBase, bUseInternalTextureOnly) == 0x000048, "Member 'ULandscapeTextureBackedRenderTargetBase::bUseInternalTextureOnly' has a wrong offset!");

// Class LandscapePatch.LandscapeWeightTextureBackedRenderTarget
// 0x0008 (0x0058 - 0x0050)
class ULandscapeWeightTextureBackedRenderTarget final : public ULandscapeTextureBackedRenderTargetBase
{
public:
	bool                                          bUseAlphaChannel;                                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeWeightTextureBackedRenderTarget">();
	}
	static class ULandscapeWeightTextureBackedRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeWeightTextureBackedRenderTarget>();
	}
};
static_assert(alignof(ULandscapeWeightTextureBackedRenderTarget) == 0x000008, "Wrong alignment on ULandscapeWeightTextureBackedRenderTarget");
static_assert(sizeof(ULandscapeWeightTextureBackedRenderTarget) == 0x000058, "Wrong size on ULandscapeWeightTextureBackedRenderTarget");
static_assert(offsetof(ULandscapeWeightTextureBackedRenderTarget, bUseAlphaChannel) == 0x000050, "Member 'ULandscapeWeightTextureBackedRenderTarget::bUseAlphaChannel' has a wrong offset!");

// Class LandscapePatch.LandscapeHeightTextureBackedRenderTarget
// 0x0010 (0x0060 - 0x0050)
class ULandscapeHeightTextureBackedRenderTarget final : public ULandscapeTextureBackedRenderTargetBase
{
public:
	struct FLandscapeHeightPatchConvertToNativeParams ConversionParams;                                  // 0x0050(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    RenderTargetFormat;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeHeightTextureBackedRenderTarget">();
	}
	static class ULandscapeHeightTextureBackedRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeHeightTextureBackedRenderTarget>();
	}
};
static_assert(alignof(ULandscapeHeightTextureBackedRenderTarget) == 0x000008, "Wrong alignment on ULandscapeHeightTextureBackedRenderTarget");
static_assert(sizeof(ULandscapeHeightTextureBackedRenderTarget) == 0x000060, "Wrong size on ULandscapeHeightTextureBackedRenderTarget");
static_assert(offsetof(ULandscapeHeightTextureBackedRenderTarget, ConversionParams) == 0x000050, "Member 'ULandscapeHeightTextureBackedRenderTarget::ConversionParams' has a wrong offset!");
static_assert(offsetof(ULandscapeHeightTextureBackedRenderTarget, RenderTargetFormat) == 0x00005C, "Member 'ULandscapeHeightTextureBackedRenderTarget::RenderTargetFormat' has a wrong offset!");

// Class LandscapePatch.LandscapeWeightPatchTextureInfo
// 0x0030 (0x0058 - 0x0028)
class ULandscapeWeightPatchTextureInfo final : public UObject
{
public:
	class FName                                   WeightmapLayerName;                                // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEditVisibilityLayer;                              // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               TextureAsset;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULandscapeWeightTextureBackedRenderTarget* InternalData;                                      // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, AdvancedDisplay, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              SourceMode;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              DetailPanelSourceMode;                             // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseAlphaChannel;                                  // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideBlendMode;                                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchBlendMode               OverrideBlendMode;                                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ULandscapeTexturePatch>  OwningPatch;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeWeightPatchTextureInfo">();
	}
	static class ULandscapeWeightPatchTextureInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeWeightPatchTextureInfo>();
	}
};
static_assert(alignof(ULandscapeWeightPatchTextureInfo) == 0x000008, "Wrong alignment on ULandscapeWeightPatchTextureInfo");
static_assert(sizeof(ULandscapeWeightPatchTextureInfo) == 0x000058, "Wrong size on ULandscapeWeightPatchTextureInfo");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, WeightmapLayerName) == 0x000028, "Member 'ULandscapeWeightPatchTextureInfo::WeightmapLayerName' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, bEditVisibilityLayer) == 0x00002C, "Member 'ULandscapeWeightPatchTextureInfo::bEditVisibilityLayer' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, TextureAsset) == 0x000030, "Member 'ULandscapeWeightPatchTextureInfo::TextureAsset' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, InternalData) == 0x000038, "Member 'ULandscapeWeightPatchTextureInfo::InternalData' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, SourceMode) == 0x000040, "Member 'ULandscapeWeightPatchTextureInfo::SourceMode' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, DetailPanelSourceMode) == 0x000041, "Member 'ULandscapeWeightPatchTextureInfo::DetailPanelSourceMode' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, bUseAlphaChannel) == 0x000042, "Member 'ULandscapeWeightPatchTextureInfo::bUseAlphaChannel' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, bOverrideBlendMode) == 0x000043, "Member 'ULandscapeWeightPatchTextureInfo::bOverrideBlendMode' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, OverrideBlendMode) == 0x000044, "Member 'ULandscapeWeightPatchTextureInfo::OverrideBlendMode' has a wrong offset!");
static_assert(offsetof(ULandscapeWeightPatchTextureInfo, OwningPatch) == 0x000048, "Member 'ULandscapeWeightPatchTextureInfo::OwningPatch' has a wrong offset!");

// Class LandscapePatch.LandscapeTexturePatch
// 0x0080 (0x03A0 - 0x0320)
class ULandscapeTexturePatch final : public ULandscapePatchComponent
{
public:
	int32                                         ResolutionX;                                       // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ResolutionY;                                       // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              UnscaledPatchCoverage;                             // 0x0328(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchBlendMode               BlendMode;                                         // 0x0338(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchFalloffMode             FalloffMode;                                       // 0x0339(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Falloff;                                           // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              HeightSourceMode;                                  // 0x0340(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTexturePatchSourceMode              DetailPanelHeightSourceMode;                       // 0x0341(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULandscapeHeightTextureBackedRenderTarget* HeightInternalData;                                // 0x0348(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture*                               HeightTextureAsset;                                // 0x0350(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseTextureAlphaForHeight;                         // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELandscapeTextureHeightPatchEncoding          HeightEncoding;                                    // 0x0359(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLandscapeTexturePatchEncodingSettings HeightEncodingSettings;                            // 0x0360(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ELandscapeTextureHeightPatchZeroHeightMeaning ZeroHeightMeaning;                                 // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyComponentZScale;                             // 0x0371(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULandscapeWeightPatchTextureInfo*> WeightPatches;                                     // 0x0378(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         NumWeightPatches;                                  // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38C[0x1];                                      // 0x038C(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBaseResolutionOffLandscape;                       // 0x038D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38E[0x2];                                      // 0x038E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResolutionMultiplier;                              // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InitTextureSizeX;                                  // 0x0394(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InitTextureSizeY;                                  // 0x0398(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextureRenderTargetFormat                    HeightRenderTargetFormat;                          // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddWeightPatch(const class FName& InWeightmapLayerName, ELandscapeTexturePatchSourceMode SourceMode, bool bUseAlphaChannel);
	void ClearWeightPatchBlendModeOverride(const class FName& InWeightmapLayerName);
	void DisableAllWeightPatches();
	TArray<class FName> GetAllWeightPatchLayerNames();
	class UTextureRenderTarget2D* GetHeightRenderTarget(bool bMarkDirty);
	class UTextureRenderTarget2D* GetWeightPatchRenderTarget(const class FName& InWeightmapLayerName);
	ELandscapeTexturePatchSourceMode GetWeightPatchSourceMode(const class FName& InWeightmapLayerName);
	void ReinitializeHeight();
	void ReinitializeWeights();
	void RemoveAllWeightPatches();
	void RemoveWeightPatch(const class FName& InWeightmapLayerName);
	void ResetHeightEncodingMode(ELandscapeTextureHeightPatchEncoding EncodingMode);
	void SetBlendMode(ELandscapeTexturePatchBlendMode BlendModeIn);
