#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboardTab.LeaderboardTab_C
// 0x0020 (0x03E8 - 0x03C8)
class ULeaderboardTab_C final : public UFortLeaderboardViewTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_ContainerBG;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardHeader_C*              EventLeaderboardHeaderDetails;                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoLeaderboardEntries;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Colorize(const struct FFortTournamentDisplayInfo& Color_Info);
	void ExecuteUbergraph_LeaderboardTab(int32 EntryPoint);
	void Set_Event(const class FString& EventId, const class FString& EventWindowId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaderboardTab_C">();
	}
	static class ULeaderboardTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardTab_C>();
	}
};
static_assert(alignof(ULeaderboardTab_C) == 0x000008, "Wrong alignment on ULeaderboardTab_C");
static_assert(sizeof(ULeaderboardTab_C) == 0x0003E8, "Wrong size on ULeaderboardTab_C");
static_assert(offsetof(ULeaderboardTab_C, UberGraphFrame) == 0x0003C8, "Member 'ULeaderboardTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaderboardTab_C, CommonBorder_ContainerBG) == 0x0003D0, "Member 'ULeaderboardTab_C::CommonBorder_ContainerBG' has a wrong offset!");
static_assert(offsetof(ULeaderboardTab_C, EventLeaderboardHeaderDetails) == 0x0003D8, "Member 'ULeaderboardTab_C::EventLeaderboardHeaderDetails' has a wrong offset!");
static_assert(offsetof(ULeaderboardTab_C, Text_NoLeaderboardEntries) == 0x0003E0, "Member 'ULeaderboardTab_C::Text_NoLeaderboardEntries' has a wrong offset!");

}

