#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LetoBorder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LetoBorder.LetoBorder_C
// 0x0038 (0x02D0 - 0x0298)
class ULetoBorder_C final : public UFortLetoLayoutBorder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderBottom;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderLeft;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderNameplate;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderRight;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTop;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LetoBorder(int32 EntryPoint);
	void UpdateBorderWidth(float HalfBorderWidth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LetoBorder_C">();
	}
	static class ULetoBorder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULetoBorder_C>();
	}
};
static_assert(alignof(ULetoBorder_C) == 0x000008, "Wrong alignment on ULetoBorder_C");
static_assert(sizeof(ULetoBorder_C) == 0x0002D0, "Wrong size on ULetoBorder_C");
static_assert(offsetof(ULetoBorder_C, UberGraphFrame) == 0x000298, "Member 'ULetoBorder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderBottom) == 0x0002A0, "Member 'ULetoBorder_C::BorderBottom' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderLeft) == 0x0002A8, "Member 'ULetoBorder_C::BorderLeft' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderNameplate) == 0x0002B0, "Member 'ULetoBorder_C::BorderNameplate' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderRight) == 0x0002B8, "Member 'ULetoBorder_C::BorderRight' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, BorderTop) == 0x0002C0, "Member 'ULetoBorder_C::BorderTop' has a wrong offset!");
static_assert(offsetof(ULetoBorder_C, SafeZone_0) == 0x0002C8, "Member 'ULetoBorder_C::SafeZone_0' has a wrong offset!");

}

