#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveViolator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveViolator.LiveViolator_C
// 0x0028 (0x0290 - 0x0268)
class ULiveViolator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_Callout;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LiveText;                                          // 0x0278(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_LiveViolator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveViolator_C">();
	}
	static class ULiveViolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveViolator_C>();
	}
};
static_assert(alignof(ULiveViolator_C) == 0x000008, "Wrong alignment on ULiveViolator_C");
static_assert(sizeof(ULiveViolator_C) == 0x000290, "Wrong size on ULiveViolator_C");
static_assert(offsetof(ULiveViolator_C, UberGraphFrame) == 0x000268, "Member 'ULiveViolator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveViolator_C, Text_Callout) == 0x000270, "Member 'ULiveViolator_C::Text_Callout' has a wrong offset!");
static_assert(offsetof(ULiveViolator_C, LiveText) == 0x000278, "Member 'ULiveViolator_C::LiveText' has a wrong offset!");

}

