#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Lima_Bean_Pack_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Lima_Bean_Pack_AnimBP.M_MED_Lima_Bean_Pack_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_135;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_136;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_137;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_138;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_139;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_140;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_141;                                  // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_142;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_143;                                // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_144;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               __EnumProperty_145;                                // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_146;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_147;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_148;                                // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_149;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_150;                              // 0x0054(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_151;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_152;                                // 0x0084(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_153;                                // 0x0085(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_154;                                // 0x0086(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_155;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_156;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_157;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_158;                              // 0x0098(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000004, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_136) == 0x000008, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_136' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_137) == 0x00000C, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_137' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_138) == 0x000010, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_138' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_139) == 0x000014, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_139' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_140) == 0x000018, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_140' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_141) == 0x000020, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_141' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_142) == 0x000028, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_142' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_143) == 0x000029, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_143' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_144) == 0x000030, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_144' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_145) == 0x000040, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_145' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_146) == 0x000044, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_146' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_147) == 0x000048, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_147' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_148) == 0x00004C, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_148' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_149) == 0x000050, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_149' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_150) == 0x000054, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_150' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_151) == 0x000080, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_151' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_152) == 0x000084, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_152' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_153) == 0x000085, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_153' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_154) == 0x000086, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_154' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_155) == 0x000088, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_155' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_156) == 0x00008C, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_156' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_157) == 0x000090, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_157' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_158) == 0x000098, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_158' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct M_MED_Lima_Bean_Pack_AnimBP.M_MED_Lima_Bean_Pack_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'M_MED_Lima_Bean_Pack_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

