#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_HamburgerButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_HamburgerButton.MainMenu_HamburgerButton_C.ExecuteUbergraph_MainMenu_HamburgerButton
// 0x00A0 (0x00A0 - 0x0000)
struct MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue_1;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_SelectMaterialInstance_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_2;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton) == 0x000008, "Wrong alignment on MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton");
static_assert(sizeof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton) == 0x0000A0, "Wrong size on MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, EntryPoint) == 0x000000, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_bool_Variable) == 0x000004, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_real_Variable) == 0x000008, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_bool_Variable_1) == 0x000010, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_real_Variable_1) == 0x000018, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_real_Variable_2) == 0x000020, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_IsMobileGame_ReturnValue) == 0x000028, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000030, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, Temp_real_Variable_3) == 0x000038, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_IsMobileGame_ReturnValue_1) == 0x000041, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_GetRuntimeOptions_ReturnValue_1) == 0x000058, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_GetRuntimeOptions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_BooleanAND_ReturnValue_1) == 0x000060, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_SelectMaterialInstance_ReturnValue) == 0x000068, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_SelectMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_SelectColor_ReturnValue) == 0x000070, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_IsMobileGame_ReturnValue_2) == 0x000080, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_IsMobileGame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, K2Node_Select_Default) == 0x000088, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, K2Node_Select_Default_1) == 0x000090, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x000098, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00009C, "Member 'MainMenu_HamburgerButton_C_ExecuteUbergraph_MainMenu_HamburgerButton::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

}

