#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_HamburgerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_HamburgerButton.MainMenu_HamburgerButton_C
// 0x0040 (0x1470 - 0x1430)
class UMainMenu_HamburgerButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x1438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x1440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x1450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       Icon;                                              // 0x1458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                IconColor;                                         // 0x1460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x1468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_MainMenu_HamburgerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_HamburgerButton_C">();
	}
	static class UMainMenu_HamburgerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_HamburgerButton_C>();
	}
};
static_assert(alignof(UMainMenu_HamburgerButton_C) == 0x000010, "Wrong alignment on UMainMenu_HamburgerButton_C");
static_assert(sizeof(UMainMenu_HamburgerButton_C) == 0x001470, "Wrong size on UMainMenu_HamburgerButton_C");
static_assert(offsetof(UMainMenu_HamburgerButton_C, UberGraphFrame) == 0x001430, "Member 'UMainMenu_HamburgerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Grow) == 0x001438, "Member 'UMainMenu_HamburgerButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Bounce) == 0x001440, "Member 'UMainMenu_HamburgerButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover) == 0x001448, "Member 'UMainMenu_HamburgerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, ButtonBacking) == 0x001450, "Member 'UMainMenu_HamburgerButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Icon) == 0x001458, "Member 'UMainMenu_HamburgerButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, IconColor) == 0x001460, "Member 'UMainMenu_HamburgerButton_C::IconColor' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, VariableSize) == 0x001468, "Member 'UMainMenu_HamburgerButton_C::VariableSize' has a wrong offset!");

}

