#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingRegionAndPool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchmakingRegionAndPool.MatchmakingRegionAndPool_C
// 0x0030 (0x02A0 - 0x0270)
class UMatchmakingRegionAndPool_C final : public UMatchmakingRegionAndPoolBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ClassicModeText;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IBMSwitcher;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InputRegion;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RegionText;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Mobile;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MatchmakingRegionAndPool(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchmakingRegionAndPool_C">();
	}
	static class UMatchmakingRegionAndPool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingRegionAndPool_C>();
	}
};
static_assert(alignof(UMatchmakingRegionAndPool_C) == 0x000008, "Wrong alignment on UMatchmakingRegionAndPool_C");
static_assert(sizeof(UMatchmakingRegionAndPool_C) == 0x0002A0, "Wrong size on UMatchmakingRegionAndPool_C");
static_assert(offsetof(UMatchmakingRegionAndPool_C, UberGraphFrame) == 0x000270, "Member 'UMatchmakingRegionAndPool_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchmakingRegionAndPool_C, ClassicModeText) == 0x000278, "Member 'UMatchmakingRegionAndPool_C::ClassicModeText' has a wrong offset!");
static_assert(offsetof(UMatchmakingRegionAndPool_C, IBMSwitcher) == 0x000280, "Member 'UMatchmakingRegionAndPool_C::IBMSwitcher' has a wrong offset!");
static_assert(offsetof(UMatchmakingRegionAndPool_C, InputRegion) == 0x000288, "Member 'UMatchmakingRegionAndPool_C::InputRegion' has a wrong offset!");
static_assert(offsetof(UMatchmakingRegionAndPool_C, RegionText) == 0x000290, "Member 'UMatchmakingRegionAndPool_C::RegionText' has a wrong offset!");
static_assert(offsetof(UMatchmakingRegionAndPool_C, SizeBox_Mobile) == 0x000298, "Member 'UMatchmakingRegionAndPool_C::SizeBox_Mobile' has a wrong offset!");

}

