#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetasoundEngine

#include "Basic.hpp"

#include "MetasoundEngine_structs.hpp"
#include "AudioExtensions_structs.hpp"
#include "MetasoundFrontend_structs.hpp"


namespace SDK::Params
{

// Function MetasoundEngine.MetasoundGeneratorHandle.CreateMetaSoundGeneratorHandle
// 0x0010 (0x0010 - 0x0000)
struct MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle final
{
public:
	class UAudioComponent*                        OnComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetasoundGeneratorHandle*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle) == 0x000008, "Wrong alignment on MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle");
static_assert(sizeof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle) == 0x000010, "Wrong size on MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle");
static_assert(offsetof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle, OnComponent) == 0x000000, "Member 'MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle::OnComponent' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle, ReturnValue) == 0x000008, "Member 'MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetasoundGeneratorHandle.ApplyParameterPack
// 0x0010 (0x0010 - 0x0000)
struct MetasoundGeneratorHandle_ApplyParameterPack final
{
public:
	class UMetasoundParameterPack*                pack;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetasoundGeneratorHandle_ApplyParameterPack) == 0x000008, "Wrong alignment on MetasoundGeneratorHandle_ApplyParameterPack");
static_assert(sizeof(MetasoundGeneratorHandle_ApplyParameterPack) == 0x000010, "Wrong size on MetasoundGeneratorHandle_ApplyParameterPack");
static_assert(offsetof(MetasoundGeneratorHandle_ApplyParameterPack, pack) == 0x000000, "Member 'MetasoundGeneratorHandle_ApplyParameterPack::pack' has a wrong offset!");
static_assert(offsetof(MetasoundGeneratorHandle_ApplyParameterPack, ReturnValue) == 0x000008, "Member 'MetasoundGeneratorHandle_ApplyParameterPack::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundAssetSubsystem.RegisterAssetClassesInDirectories
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories final
{
public:
	TArray<struct FMetaSoundAssetDirectory>       Directories;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories) == 0x000008, "Wrong alignment on MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories");
static_assert(sizeof(MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories) == 0x000010, "Wrong size on MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories");
static_assert(offsetof(MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories, Directories) == 0x000000, "Member 'MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories::Directories' has a wrong offset!");

// Function MetasoundEngine.MetaSoundAssetSubsystem.UnregisterAssetClassesInDirectories
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories final
{
public:
	TArray<struct FMetaSoundAssetDirectory>       Directories;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories) == 0x000008, "Wrong alignment on MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories");
static_assert(sizeof(MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories) == 0x000010, "Wrong size on MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories");
static_assert(offsetof(MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories, Directories) == 0x000000, "Member 'MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories::Directories' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddGraphInputNode
// 0x0088 (0x0088 - 0x0000)
struct MetaSoundBuilderBase_AddGraphInputNode final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultValue;                                      // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstructorInput;                               // 0x0061(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeOutputHandle      ReturnValue;                                       // 0x0064(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddGraphInputNode) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_AddGraphInputNode");
static_assert(sizeof(MetaSoundBuilderBase_AddGraphInputNode) == 0x000088, "Wrong size on MetaSoundBuilderBase_AddGraphInputNode");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, Name_0) == 0x000000, "Member 'MetaSoundBuilderBase_AddGraphInputNode::Name_0' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, DataType) == 0x000004, "Member 'MetaSoundBuilderBase_AddGraphInputNode::DataType' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, DefaultValue) == 0x000008, "Member 'MetaSoundBuilderBase_AddGraphInputNode::DefaultValue' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, outResult) == 0x000060, "Member 'MetaSoundBuilderBase_AddGraphInputNode::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, bIsConstructorInput) == 0x000061, "Member 'MetaSoundBuilderBase_AddGraphInputNode::bIsConstructorInput' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphInputNode, ReturnValue) == 0x000064, "Member 'MetaSoundBuilderBase_AddGraphInputNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddGraphOutputNode
// 0x0088 (0x0088 - 0x0000)
struct MetaSoundBuilderBase_AddGraphOutputNode final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultValue;                                      // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstructorInput;                               // 0x0061(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeInputHandle       ReturnValue;                                       // 0x0064(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddGraphOutputNode) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_AddGraphOutputNode");
static_assert(sizeof(MetaSoundBuilderBase_AddGraphOutputNode) == 0x000088, "Wrong size on MetaSoundBuilderBase_AddGraphOutputNode");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, Name_0) == 0x000000, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::Name_0' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, DataType) == 0x000004, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::DataType' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, DefaultValue) == 0x000008, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::DefaultValue' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, outResult) == 0x000060, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, bIsConstructorInput) == 0x000061, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::bIsConstructorInput' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddGraphOutputNode, ReturnValue) == 0x000064, "Member 'MetaSoundBuilderBase_AddGraphOutputNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddInterface
// 0x0008 (0x0008 - 0x0000)
struct MetaSoundBuilderBase_AddInterface final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddInterface) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_AddInterface");
static_assert(sizeof(MetaSoundBuilderBase_AddInterface) == 0x000008, "Wrong size on MetaSoundBuilderBase_AddInterface");
static_assert(offsetof(MetaSoundBuilderBase_AddInterface, InterfaceName) == 0x000000, "Member 'MetaSoundBuilderBase_AddInterface::InterfaceName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddInterface, outResult) == 0x000004, "Member 'MetaSoundBuilderBase_AddInterface::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.AddNode
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_AddNode final
{
public:
	TScriptInterface<class IMetaSoundDocumentInterface> NodeClass;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0014(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_AddNode) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_AddNode");
static_assert(sizeof(MetaSoundBuilderBase_AddNode) == 0x000028, "Wrong size on MetaSoundBuilderBase_AddNode");
static_assert(offsetof(MetaSoundBuilderBase_AddNode, NodeClass) == 0x000000, "Member 'MetaSoundBuilderBase_AddNode::NodeClass' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNode, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_AddNode::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_AddNode, ReturnValue) == 0x000014, "Member 'MetaSoundBuilderBase_AddNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeInputsToMatchingGraphInterfaceInputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeOutputHandle> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs) == 0x000028, "Wrong size on MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeInputToGraphInput
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeInputToGraphInput final
{
public:
	class FName                                   GraphInputName;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0004(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeInputToGraphInput");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput) == 0x000028, "Wrong size on MetaSoundBuilderBase_ConnectNodeInputToGraphInput");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput, GraphInputName) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeInputToGraphInput::GraphInputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput, NodeInputHandle) == 0x000004, "Member 'MetaSoundBuilderBase_ConnectNodeInputToGraphInput::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeInputToGraphInput, outResult) == 0x000024, "Member 'MetaSoundBuilderBase_ConnectNodeInputToGraphInput::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeOutputsToMatchingGraphInterfaceOutputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs) == 0x000028, "Wrong size on MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeOutputToGraphOutput
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput final
{
public:
	class FName                                   GraphOutputName;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0004(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput) == 0x000028, "Wrong size on MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput, GraphOutputName) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput::GraphOutputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput, NodeOutputHandle) == 0x000004, "Member 'MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput, outResult) == 0x000024, "Member 'MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodes
// 0x0044 (0x0044 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodes final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodes) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodes");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodes) == 0x000044, "Wrong size on MetaSoundBuilderBase_ConnectNodes");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodes, NodeOutputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodes::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodes, NodeInputHandle) == 0x000020, "Member 'MetaSoundBuilderBase_ConnectNodes::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodes, outResult) == 0x000040, "Member 'MetaSoundBuilderBase_ConnectNodes::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodesByInterfaceBindings
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodesByInterfaceBindings final
{
public:
	struct FMetaSoundNodeHandle                   FromNodeHandle;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ToNodeHandle;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ConnectNodesByInterfaceBindings");
static_assert(sizeof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings) == 0x000024, "Wrong size on MetaSoundBuilderBase_ConnectNodesByInterfaceBindings");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings, FromNodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_ConnectNodesByInterfaceBindings::FromNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings, ToNodeHandle) == 0x000010, "Member 'MetaSoundBuilderBase_ConnectNodesByInterfaceBindings::ToNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ConnectNodesByInterfaceBindings, outResult) == 0x000020, "Member 'MetaSoundBuilderBase_ConnectNodesByInterfaceBindings::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodeInput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodeInput final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodeInput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodeInput");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodeInput) == 0x000024, "Wrong size on MetaSoundBuilderBase_DisconnectNodeInput");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeInput, NodeInputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodeInput::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeInput, outResult) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodeInput::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodeOutput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodeOutput final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodeOutput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodeOutput");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodeOutput) == 0x000024, "Wrong size on MetaSoundBuilderBase_DisconnectNodeOutput");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeOutput, NodeOutputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodeOutput::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodeOutput, outResult) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodeOutput::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodes
// 0x0044 (0x0044 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodes final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodes) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodes");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodes) == 0x000044, "Wrong size on MetaSoundBuilderBase_DisconnectNodes");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodes, NodeOutputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodes::NodeOutputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodes, NodeInputHandle) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodes::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodes, outResult) == 0x000040, "Member 'MetaSoundBuilderBase_DisconnectNodes::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodesByInterfaceBindings
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings final
{
public:
	struct FMetaSoundNodeHandle                   FromNodeHandle;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ToNodeHandle;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings");
static_assert(sizeof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings) == 0x000024, "Wrong size on MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings, FromNodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings::FromNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings, ToNodeHandle) == 0x000010, "Member 'MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings::ToNodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings, outResult) == 0x000020, "Member 'MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.RemoveInterface
// 0x0008 (0x0008 - 0x0000)
struct MetaSoundBuilderBase_RemoveInterface final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_RemoveInterface) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_RemoveInterface");
static_assert(sizeof(MetaSoundBuilderBase_RemoveInterface) == 0x000008, "Wrong size on MetaSoundBuilderBase_RemoveInterface");
static_assert(offsetof(MetaSoundBuilderBase_RemoveInterface, InterfaceName) == 0x000000, "Member 'MetaSoundBuilderBase_RemoveInterface::InterfaceName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_RemoveInterface, outResult) == 0x000004, "Member 'MetaSoundBuilderBase_RemoveInterface::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.RemoveNode
// 0x0014 (0x0014 - 0x0000)
struct MetaSoundBuilderBase_RemoveNode final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_RemoveNode) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_RemoveNode");
static_assert(sizeof(MetaSoundBuilderBase_RemoveNode) == 0x000014, "Wrong size on MetaSoundBuilderBase_RemoveNode");
static_assert(offsetof(MetaSoundBuilderBase_RemoveNode, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_RemoveNode::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_RemoveNode, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_RemoveNode::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.SetNodeInputDefault
// 0x0080 (0x0080 - 0x0000)
struct MetaSoundBuilderBase_SetNodeInputDefault final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              Literal;                                           // 0x0020(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_SetNodeInputDefault) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_SetNodeInputDefault");
static_assert(sizeof(MetaSoundBuilderBase_SetNodeInputDefault) == 0x000080, "Wrong size on MetaSoundBuilderBase_SetNodeInputDefault");
static_assert(offsetof(MetaSoundBuilderBase_SetNodeInputDefault, NodeInputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_SetNodeInputDefault::NodeInputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_SetNodeInputDefault, Literal) == 0x000020, "Member 'MetaSoundBuilderBase_SetNodeInputDefault::Literal' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_SetNodeInputDefault, outResult) == 0x000078, "Member 'MetaSoundBuilderBase_SetNodeInputDefault::outResult' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ContainsNode
// 0x0014 (0x0014 - 0x0000)
struct MetaSoundBuilderBase_ContainsNode final
{
public:
	struct FMetaSoundNodeHandle                   Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ContainsNode) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ContainsNode");
static_assert(sizeof(MetaSoundBuilderBase_ContainsNode) == 0x000014, "Wrong size on MetaSoundBuilderBase_ContainsNode");
static_assert(offsetof(MetaSoundBuilderBase_ContainsNode, Node) == 0x000000, "Member 'MetaSoundBuilderBase_ContainsNode::Node' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ContainsNode, ReturnValue) == 0x000010, "Member 'MetaSoundBuilderBase_ContainsNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ContainsNodeInput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_ContainsNodeInput final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       Input;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ContainsNodeInput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ContainsNodeInput");
static_assert(sizeof(MetaSoundBuilderBase_ContainsNodeInput) == 0x000024, "Wrong size on MetaSoundBuilderBase_ContainsNodeInput");
static_assert(offsetof(MetaSoundBuilderBase_ContainsNodeInput, Input) == 0x000000, "Member 'MetaSoundBuilderBase_ContainsNodeInput::Input' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ContainsNodeInput, ReturnValue) == 0x000020, "Member 'MetaSoundBuilderBase_ContainsNodeInput::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.ContainsNodeOutput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_ContainsNodeOutput final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      Output;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MetaSoundBuilderBase_ContainsNodeOutput) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_ContainsNodeOutput");
static_assert(sizeof(MetaSoundBuilderBase_ContainsNodeOutput) == 0x000024, "Wrong size on MetaSoundBuilderBase_ContainsNodeOutput");
static_assert(offsetof(MetaSoundBuilderBase_ContainsNodeOutput, Output) == 0x000000, "Member 'MetaSoundBuilderBase_ContainsNodeOutput::Output' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_ContainsNodeOutput, ReturnValue) == 0x000020, "Member 'MetaSoundBuilderBase_ContainsNodeOutput::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindGraphInputNode
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_FindGraphInputNode final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindGraphInputNode) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_FindGraphInputNode");
static_assert(sizeof(MetaSoundBuilderBase_FindGraphInputNode) == 0x000018, "Wrong size on MetaSoundBuilderBase_FindGraphInputNode");
static_assert(offsetof(MetaSoundBuilderBase_FindGraphInputNode, InputName) == 0x000000, "Member 'MetaSoundBuilderBase_FindGraphInputNode::InputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindGraphInputNode, outResult) == 0x000004, "Member 'MetaSoundBuilderBase_FindGraphInputNode::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindGraphInputNode, ReturnValue) == 0x000008, "Member 'MetaSoundBuilderBase_FindGraphInputNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindGraphOutputNode
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_FindGraphOutputNode final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindGraphOutputNode) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_FindGraphOutputNode");
static_assert(sizeof(MetaSoundBuilderBase_FindGraphOutputNode) == 0x000018, "Wrong size on MetaSoundBuilderBase_FindGraphOutputNode");
static_assert(offsetof(MetaSoundBuilderBase_FindGraphOutputNode, OutputName) == 0x000000, "Member 'MetaSoundBuilderBase_FindGraphOutputNode::OutputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindGraphOutputNode, outResult) == 0x000004, "Member 'MetaSoundBuilderBase_FindGraphOutputNode::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindGraphOutputNode, ReturnValue) == 0x000008, "Member 'MetaSoundBuilderBase_FindGraphOutputNode::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindInterfaceInputNodes
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_FindInterfaceInputNodes final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundNodeHandle>           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindInterfaceInputNodes) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_FindInterfaceInputNodes");
static_assert(sizeof(MetaSoundBuilderBase_FindInterfaceInputNodes) == 0x000018, "Wrong size on MetaSoundBuilderBase_FindInterfaceInputNodes");
static_assert(offsetof(MetaSoundBuilderBase_FindInterfaceInputNodes, InterfaceName) == 0x000000, "Member 'MetaSoundBuilderBase_FindInterfaceInputNodes::InterfaceName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindInterfaceInputNodes, outResult) == 0x000004, "Member 'MetaSoundBuilderBase_FindInterfaceInputNodes::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindInterfaceInputNodes, ReturnValue) == 0x000008, "Member 'MetaSoundBuilderBase_FindInterfaceInputNodes::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindInterfaceOutputNodes
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_FindInterfaceOutputNodes final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundNodeHandle>           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindInterfaceOutputNodes) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_FindInterfaceOutputNodes");
static_assert(sizeof(MetaSoundBuilderBase_FindInterfaceOutputNodes) == 0x000018, "Wrong size on MetaSoundBuilderBase_FindInterfaceOutputNodes");
static_assert(offsetof(MetaSoundBuilderBase_FindInterfaceOutputNodes, InterfaceName) == 0x000000, "Member 'MetaSoundBuilderBase_FindInterfaceOutputNodes::InterfaceName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindInterfaceOutputNodes, outResult) == 0x000004, "Member 'MetaSoundBuilderBase_FindInterfaceOutputNodes::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindInterfaceOutputNodes, ReturnValue) == 0x000008, "Member 'MetaSoundBuilderBase_FindInterfaceOutputNodes::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeClassVersion
// 0x0020 (0x0020 - 0x0000)
struct MetaSoundBuilderBase_FindNodeClassVersion final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendVersion              ReturnValue;                                       // 0x0014(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindNodeClassVersion) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_FindNodeClassVersion");
static_assert(sizeof(MetaSoundBuilderBase_FindNodeClassVersion) == 0x000020, "Wrong size on MetaSoundBuilderBase_FindNodeClassVersion");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeClassVersion, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_FindNodeClassVersion::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeClassVersion, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_FindNodeClassVersion::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeClassVersion, ReturnValue) == 0x000014, "Member 'MetaSoundBuilderBase_FindNodeClassVersion::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputByName
// 0x0038 (0x0038 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputByName final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   InputName;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeInputHandle       ReturnValue;                                       // 0x0018(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindNodeInputByName) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_FindNodeInputByName");
static_assert(sizeof(MetaSoundBuilderBase_FindNodeInputByName) == 0x000038, "Wrong size on MetaSoundBuilderBase_FindNodeInputByName");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputByName, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_FindNodeInputByName::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputByName, InputName) == 0x000010, "Member 'MetaSoundBuilderBase_FindNodeInputByName::InputName' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputByName, outResult) == 0x000014, "Member 'MetaSoundBuilderBase_FindNodeInputByName::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputByName, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_FindNodeInputByName::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputParent
// 0x0034 (0x0034 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputParent final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       InputHandle;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0024(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindNodeInputParent) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_FindNodeInputParent");
static_assert(sizeof(MetaSoundBuilderBase_FindNodeInputParent) == 0x000034, "Wrong size on MetaSoundBuilderBase_FindNodeInputParent");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputParent, InputHandle) == 0x000000, "Member 'MetaSoundBuilderBase_FindNodeInputParent::InputHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputParent, outResult) == 0x000020, "Member 'MetaSoundBuilderBase_FindNodeInputParent::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputParent, ReturnValue) == 0x000024, "Member 'MetaSoundBuilderBase_FindNodeInputParent::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindNodeInputs) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_FindNodeInputs");
static_assert(sizeof(MetaSoundBuilderBase_FindNodeInputs) == 0x000028, "Wrong size on MetaSoundBuilderBase_FindNodeInputs");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputs, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_FindNodeInputs::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputs, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_FindNodeInputs::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputs, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_FindNodeInputs::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputsByDataType
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputsByDataType final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DataType;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindNodeInputsByDataType) == 0x000008, "Wrong alignment on MetaSoundBuilderBase_FindNodeInputsByDataType");
static_assert(sizeof(MetaSoundBuilderBase_FindNodeInputsByDataType) == 0x000028, "Wrong size on MetaSoundBuilderBase_FindNodeInputsByDataType");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputsByDataType, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_FindNodeInputsByDataType::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputsByDataType, outResult) == 0x000010, "Member 'MetaSoundBuilderBase_FindNodeInputsByDataType::outResult' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputsByDataType, DataType) == 0x000014, "Member 'MetaSoundBuilderBase_FindNodeInputsByDataType::DataType' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeInputsByDataType, ReturnValue) == 0x000018, "Member 'MetaSoundBuilderBase_FindNodeInputsByDataType::ReturnValue' has a wrong offset!");

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeOutputByName
// 0x0038 (0x0038 - 0x0000)
struct MetaSoundBuilderBase_FindNodeOutputByName final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OutputName;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       outResult;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeOutputHandle      ReturnValue;                                       // 0x0018(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MetaSoundBuilderBase_FindNodeOutputByName) == 0x000004, "Wrong alignment on MetaSoundBuilderBase_FindNodeOutputByName");
static_assert(sizeof(MetaSoundBuilderBase_FindNodeOutputByName) == 0x000038, "Wrong size on MetaSoundBuilderBase_FindNodeOutputByName");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeOutputByName, NodeHandle) == 0x000000, "Member 'MetaSoundBuilderBase_FindNodeOutputByName::NodeHandle' has a wrong offset!");
static_assert(offsetof(MetaSoundBuilderBase_FindNodeOutputByName, OutputName) == 0x000010, "Member 'MetaSoundBuilderBase_FindNodeOutputByName::OutputName' has a wrong offset!");
