#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MidMatchBunkerGameplayUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class MidMatchBunkerGameplayUI.FortMobileActionButtonBehaviorExtension_BunkerKeyUse
// 0x0010 (0x0080 - 0x0070)
class UFortMobileActionButtonBehaviorExtension_BunkerKeyUse final : public UFortMobileActionButtonBehaviorExtension
{
public:
	struct FGameplayTag                           KeycardTag;                                        // 0x0070(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           VaultDoorTag;                                      // 0x0074(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperSprite*                           Sprite_Keycard;                                    // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehaviorExtension_BunkerKeyUse">();
	}
	static class UFortMobileActionButtonBehaviorExtension_BunkerKeyUse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehaviorExtension_BunkerKeyUse>();
	}
};
static_assert(alignof(UFortMobileActionButtonBehaviorExtension_BunkerKeyUse) == 0x000008, "Wrong alignment on UFortMobileActionButtonBehaviorExtension_BunkerKeyUse");
static_assert(sizeof(UFortMobileActionButtonBehaviorExtension_BunkerKeyUse) == 0x000080, "Wrong size on UFortMobileActionButtonBehaviorExtension_BunkerKeyUse");
static_assert(offsetof(UFortMobileActionButtonBehaviorExtension_BunkerKeyUse, KeycardTag) == 0x000070, "Member 'UFortMobileActionButtonBehaviorExtension_BunkerKeyUse::KeycardTag' has a wrong offset!");
static_assert(offsetof(UFortMobileActionButtonBehaviorExtension_BunkerKeyUse, VaultDoorTag) == 0x000074, "Member 'UFortMobileActionButtonBehaviorExtension_BunkerKeyUse::VaultDoorTag' has a wrong offset!");
static_assert(offsetof(UFortMobileActionButtonBehaviorExtension_BunkerKeyUse, Sprite_Keycard) == 0x000078, "Member 'UFortMobileActionButtonBehaviorExtension_BunkerKeyUse::Sprite_Keycard' has a wrong offset!");

}

