#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MidMatchBunkerGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class MidMatchBunkerGameplayRuntime.FortAthenaMutator_MidMatchBunkerGameplay
// 0x0330 (0x0660 - 0x0330)
class AFortAthenaMutator_MidMatchBunkerGameplay final : public AFortAthenaMutator
{
public:
	struct FGameplayTag                           BunkerKeycardPlayerCarrierSpecialActorTag;         // 0x0330(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_334[0xC];                                      // 0x0334(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BunkerKeycardFriendlyCarrierBrush;                 // 0x0340(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            BunkerKeycardEnemyCarrierBrush;                    // 0x0400(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            BunkerKeycardLocalPlayerCarrierBrush;              // 0x04C0(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHotfixRenderBunkerKeycardLocalPlayerCarrier;      // 0x0580(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHotfixRenderBunkerKeycardEnemyCarrier;            // 0x05A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HotfixBunkerKeycardEnemyCarrierRenderDistance2D;   // 0x05D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHotfixRenderBunkerKeycardFriendlyCarrier;         // 0x05F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HotfixBunkerKeycardFriendlyCarrierRenderDistance2D; // 0x0620(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         BunkerKeycardEnemyCarrierRenderDistance2D;         // 0x0648(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BunkerKeycardFriendlyCarrierRenderDistance2D;      // 0x064C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRenderBunkerKeycardLocalPlayerCarrier;            // 0x0650(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_651[0xF];                                      // 0x0651(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_MidMatchBunkerGameplay">();
	}
	static class AFortAthenaMutator_MidMatchBunkerGameplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_MidMatchBunkerGameplay>();
	}
};
static_assert(alignof(AFortAthenaMutator_MidMatchBunkerGameplay) == 0x000010, "Wrong alignment on AFortAthenaMutator_MidMatchBunkerGameplay");
static_assert(sizeof(AFortAthenaMutator_MidMatchBunkerGameplay) == 0x000660, "Wrong size on AFortAthenaMutator_MidMatchBunkerGameplay");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, BunkerKeycardPlayerCarrierSpecialActorTag) == 0x000330, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::BunkerKeycardPlayerCarrierSpecialActorTag' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, BunkerKeycardFriendlyCarrierBrush) == 0x000340, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::BunkerKeycardFriendlyCarrierBrush' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, BunkerKeycardEnemyCarrierBrush) == 0x000400, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::BunkerKeycardEnemyCarrierBrush' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, BunkerKeycardLocalPlayerCarrierBrush) == 0x0004C0, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::BunkerKeycardLocalPlayerCarrierBrush' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, bHotfixRenderBunkerKeycardLocalPlayerCarrier) == 0x000580, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::bHotfixRenderBunkerKeycardLocalPlayerCarrier' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, bHotfixRenderBunkerKeycardEnemyCarrier) == 0x0005A8, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::bHotfixRenderBunkerKeycardEnemyCarrier' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, HotfixBunkerKeycardEnemyCarrierRenderDistance2D) == 0x0005D0, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::HotfixBunkerKeycardEnemyCarrierRenderDistance2D' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, bHotfixRenderBunkerKeycardFriendlyCarrier) == 0x0005F8, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::bHotfixRenderBunkerKeycardFriendlyCarrier' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, HotfixBunkerKeycardFriendlyCarrierRenderDistance2D) == 0x000620, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::HotfixBunkerKeycardFriendlyCarrierRenderDistance2D' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, BunkerKeycardEnemyCarrierRenderDistance2D) == 0x000648, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::BunkerKeycardEnemyCarrierRenderDistance2D' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, BunkerKeycardFriendlyCarrierRenderDistance2D) == 0x00064C, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::BunkerKeycardFriendlyCarrierRenderDistance2D' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_MidMatchBunkerGameplay, bRenderBunkerKeycardLocalPlayerCarrier) == 0x000650, "Member 'AFortAthenaMutator_MidMatchBunkerGameplay::bRenderBunkerKeycardLocalPlayerCarrier' has a wrong offset!");

}

