#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissedInvitesEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissedInvitesEntry.MissedInvitesEntry_C
// 0x0050 (0x14B0 - 0x1460)
class UMissedInvitesEntry_C final : public UFortMissedInvitesListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x1478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Exclamation;                                       // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_MissedInvitesText;                            // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_MissedInvitesEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissedInvitesEntry_C">();
	}
	static class UMissedInvitesEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissedInvitesEntry_C>();
	}
};
static_assert(alignof(UMissedInvitesEntry_C) == 0x000010, "Wrong alignment on UMissedInvitesEntry_C");
static_assert(sizeof(UMissedInvitesEntry_C) == 0x0014B0, "Wrong size on UMissedInvitesEntry_C");
static_assert(offsetof(UMissedInvitesEntry_C, UberGraphFrame) == 0x001460, "Member 'UMissedInvitesEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Selected) == 0x001468, "Member 'UMissedInvitesEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Hovered) == 0x001470, "Member 'UMissedInvitesEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, AnimatedInputBorder) == 0x001478, "Member 'UMissedInvitesEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Arrow) == 0x001480, "Member 'UMissedInvitesEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001488, "Member 'UMissedInvitesEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, EntryBorder) == 0x001490, "Member 'UMissedInvitesEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Exclamation) == 0x001498, "Member 'UMissedInvitesEntry_C::Exclamation' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, Text_MissedInvitesText) == 0x0014A0, "Member 'UMissedInvitesEntry_C::Text_MissedInvitesText' has a wrong offset!");
static_assert(offsetof(UMissedInvitesEntry_C, UserActionMenuInputButton) == 0x0014A8, "Member 'UMissedInvitesEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

