#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Moonbeam_PowerRatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Moonbeam_PowerRatingWidget.Moonbeam_PowerRatingWidget_C
// 0x00B8 (0x0370 - 0x02B8)
class UMoonbeam_PowerRatingWidget_C final : public UFortPlayerPowerRating
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BaseRatingValue;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BaseRatingValue_Large;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BuffedRatingOuterGlow;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHomebaseRatingBar_C*                   HomebaseRatingBar;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Power;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            ModeTypeSwitcher;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Moonbeam_Power_Back;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OversizedMode;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PowerIconGlow;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rating_Glow_Large;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RatingBar;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RegularMode;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TeamRatingValue;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TeamRatingValue_Large;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowDualPower;                                     // 0x0330(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowProgress;                                      // 0x0331(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowGlow;                                          // 0x0332(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLargeStyle;                                     // 0x0333(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOversizedMode;                                  // 0x0334(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpDuration;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PowerIncreasedSound;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Power_Rating_Num;                                  // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PowerBackingColor;                                 // 0x034C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            FontColor;                                         // 0x035C(0x0014)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_Moonbeam_PowerRatingWidget(int32 EntryPoint);
	void OnBasePowerRatingUpdated(int32 BasePowerRating);
	void OnPowerRatingProgressUpdated(float BaseRatingProgress, float TeamRatingProgress);
	void OnTeamMembershipChanged();
	void OnTeamPowerRatingUpdated(int32 TeamPowerRating);
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundColor(const struct FLinearColor& NewColor);
	void UpdateWidgetState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Moonbeam_PowerRatingWidget_C">();
	}
	static class UMoonbeam_PowerRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoonbeam_PowerRatingWidget_C>();
	}
};
static_assert(alignof(UMoonbeam_PowerRatingWidget_C) == 0x000008, "Wrong alignment on UMoonbeam_PowerRatingWidget_C");
static_assert(sizeof(UMoonbeam_PowerRatingWidget_C) == 0x000370, "Wrong size on UMoonbeam_PowerRatingWidget_C");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UMoonbeam_PowerRatingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, BaseRatingValue) == 0x0002C0, "Member 'UMoonbeam_PowerRatingWidget_C::BaseRatingValue' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, BaseRatingValue_Large) == 0x0002C8, "Member 'UMoonbeam_PowerRatingWidget_C::BaseRatingValue_Large' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, BuffedRatingOuterGlow) == 0x0002D0, "Member 'UMoonbeam_PowerRatingWidget_C::BuffedRatingOuterGlow' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, HomebaseRatingBar) == 0x0002D8, "Member 'UMoonbeam_PowerRatingWidget_C::HomebaseRatingBar' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Image_Power) == 0x0002E0, "Member 'UMoonbeam_PowerRatingWidget_C::Image_Power' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ModeTypeSwitcher) == 0x0002E8, "Member 'UMoonbeam_PowerRatingWidget_C::ModeTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Moonbeam_Power_Back) == 0x0002F0, "Member 'UMoonbeam_PowerRatingWidget_C::Moonbeam_Power_Back' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, OversizedMode) == 0x0002F8, "Member 'UMoonbeam_PowerRatingWidget_C::OversizedMode' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, PowerIconGlow) == 0x000300, "Member 'UMoonbeam_PowerRatingWidget_C::PowerIconGlow' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Rating_Glow_Large) == 0x000308, "Member 'UMoonbeam_PowerRatingWidget_C::Rating_Glow_Large' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, RatingBar) == 0x000310, "Member 'UMoonbeam_PowerRatingWidget_C::RatingBar' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, RegularMode) == 0x000318, "Member 'UMoonbeam_PowerRatingWidget_C::RegularMode' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, TeamRatingValue) == 0x000320, "Member 'UMoonbeam_PowerRatingWidget_C::TeamRatingValue' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, TeamRatingValue_Large) == 0x000328, "Member 'UMoonbeam_PowerRatingWidget_C::TeamRatingValue_Large' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ShowDualPower) == 0x000330, "Member 'UMoonbeam_PowerRatingWidget_C::ShowDualPower' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ShowProgress) == 0x000331, "Member 'UMoonbeam_PowerRatingWidget_C::ShowProgress' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, ShowGlow) == 0x000332, "Member 'UMoonbeam_PowerRatingWidget_C::ShowGlow' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, UseLargeStyle) == 0x000333, "Member 'UMoonbeam_PowerRatingWidget_C::UseLargeStyle' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, UseOversizedMode) == 0x000334, "Member 'UMoonbeam_PowerRatingWidget_C::UseOversizedMode' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, InterpDuration) == 0x000338, "Member 'UMoonbeam_PowerRatingWidget_C::InterpDuration' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, PowerIncreasedSound) == 0x000340, "Member 'UMoonbeam_PowerRatingWidget_C::PowerIncreasedSound' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, Power_Rating_Num) == 0x000348, "Member 'UMoonbeam_PowerRatingWidget_C::Power_Rating_Num' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, PowerBackingColor) == 0x00034C, "Member 'UMoonbeam_PowerRatingWidget_C::PowerBackingColor' has a wrong offset!");
static_assert(offsetof(UMoonbeam_PowerRatingWidget_C, FontColor) == 0x00035C, "Member 'UMoonbeam_PowerRatingWidget_C::FontColor' has a wrong offset!");

}

