#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct MotionTrajectory.MotionTrajectorySettings
// 0x000C (0x000C - 0x0000)
struct FMotionTrajectorySettings final
{
public:
	int32                                         Domain;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Seconds;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMotionTrajectorySettings) == 0x000004, "Wrong alignment on FMotionTrajectorySettings");
static_assert(sizeof(FMotionTrajectorySettings) == 0x00000C, "Wrong size on FMotionTrajectorySettings");
static_assert(offsetof(FMotionTrajectorySettings, Domain) == 0x000000, "Member 'FMotionTrajectorySettings::Domain' has a wrong offset!");
static_assert(offsetof(FMotionTrajectorySettings, Seconds) == 0x000004, "Member 'FMotionTrajectorySettings::Seconds' has a wrong offset!");
static_assert(offsetof(FMotionTrajectorySettings, Distance) == 0x000008, "Member 'FMotionTrajectorySettings::Distance' has a wrong offset!");

// ScriptStruct MotionTrajectory.TrajectoryDirectionClamp
// 0x0020 (0x0020 - 0x0000)
struct FTrajectoryDirectionClamp final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleTresholdDegrees;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTrajectoryDirectionClamp) == 0x000008, "Wrong alignment on FTrajectoryDirectionClamp");
static_assert(sizeof(FTrajectoryDirectionClamp) == 0x000020, "Wrong size on FTrajectoryDirectionClamp");
static_assert(offsetof(FTrajectoryDirectionClamp, Direction) == 0x000000, "Member 'FTrajectoryDirectionClamp::Direction' has a wrong offset!");
static_assert(offsetof(FTrajectoryDirectionClamp, AngleTresholdDegrees) == 0x000018, "Member 'FTrajectoryDirectionClamp::AngleTresholdDegrees' has a wrong offset!");

}

