#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotorcycleRuntime

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MotorcycleRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class MotorcycleRuntime.FortMotorcycleVehicleAnimInstance
// 0x0070 (0x0660 - 0x05F0)
class UFortMotorcycleVehicleAnimInstance : public UFortVehicleAnimInstance
{
public:
	class AFortMotorcycleVehicle*                 MotorcycleVehicle;                                 // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               SwingArmRotation;                                  // 0x05F8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsInInventoryMode;                                // 0x0610(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance_MotorcycleDriver* DriverAnimInstance;                                // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBikeParked;                                     // 0x0620(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBikeOn;                                         // 0x0621(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBikeStopping;                                   // 0x0622(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReversing;                                      // 0x0623(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalSpeed;                                        // 0x0624(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSurfaceWater;                                   // 0x0628(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditiveAlpha;                                     // 0x062C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRevving;                                        // 0x0630(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccelAlpha;                                        // 0x0634(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsThrottling;                                     // 0x0638(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHonking;                                        // 0x0639(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSoloJumpTrickOutro;                             // 0x063A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpTrickNone;                                  // 0x063B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakeLeverAlpha;                                   // 0x063C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitFromLocomotion;                         // 0x0640(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFromRevvingToThrottle;                   // 0x0641(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayThrottleAnim;                           // 0x0642(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateTransitionRuleToMovingLoop;                  // 0x0643(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEarlyOutFromMovingStart;                          // 0x0644(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldStop;                                       // 0x0645(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReverse;                                    // 0x0646(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldReverseStop;                                // 0x0647(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldStopThrottling;                             // 0x0648(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromJumpTrick;                                  // 0x0649(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSoloJumpTrick;                                  // 0x064A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldJump;                                       // 0x064B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x064C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMotorcycleAirTrickType                   AirTrickType;                                      // 0x064D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLandingInPlace;                                 // 0x064E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFallingToMoving;                         // 0x064F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpChargeFactor;                                  // 0x0650(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardSpeed;                                      // 0x0654(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoppie;                                          // 0x0658(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBraking;                                        // 0x0659(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldBrake;                                      // 0x065A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEarlyOutBrakingOutro;                             // 0x065B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldJumpTrick;                                  // 0x065C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateTransitionRuleToReverseLoop;                 // 0x065D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReverseNoFeet;                                  // 0x065E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65F[0x1];                                      // 0x065F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CollectConditionsFromDriver();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMotorcycleVehicleAnimInstance">();
	}
	static class UFortMotorcycleVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMotorcycleVehicleAnimInstance>();
	}
};
static_assert(alignof(UFortMotorcycleVehicleAnimInstance) == 0x000010, "Wrong alignment on UFortMotorcycleVehicleAnimInstance");
static_assert(sizeof(UFortMotorcycleVehicleAnimInstance) == 0x000660, "Wrong size on UFortMotorcycleVehicleAnimInstance");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, MotorcycleVehicle) == 0x0005F0, "Member 'UFortMotorcycleVehicleAnimInstance::MotorcycleVehicle' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, SwingArmRotation) == 0x0005F8, "Member 'UFortMotorcycleVehicleAnimInstance::SwingArmRotation' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsInInventoryMode) == 0x000610, "Member 'UFortMotorcycleVehicleAnimInstance::bIsInInventoryMode' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, DriverAnimInstance) == 0x000618, "Member 'UFortMotorcycleVehicleAnimInstance::DriverAnimInstance' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBikeParked) == 0x000620, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBikeParked' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBikeOn) == 0x000621, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBikeOn' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBikeStopping) == 0x000622, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBikeStopping' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsReversing) == 0x000623, "Member 'UFortMotorcycleVehicleAnimInstance::bIsReversing' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, TotalSpeed) == 0x000624, "Member 'UFortMotorcycleVehicleAnimInstance::TotalSpeed' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsSurfaceWater) == 0x000628, "Member 'UFortMotorcycleVehicleAnimInstance::bIsSurfaceWater' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, AdditiveAlpha) == 0x00062C, "Member 'UFortMotorcycleVehicleAnimInstance::AdditiveAlpha' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsRevving) == 0x000630, "Member 'UFortMotorcycleVehicleAnimInstance::bIsRevving' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, AccelAlpha) == 0x000634, "Member 'UFortMotorcycleVehicleAnimInstance::AccelAlpha' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsThrottling) == 0x000638, "Member 'UFortMotorcycleVehicleAnimInstance::bIsThrottling' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsHonking) == 0x000639, "Member 'UFortMotorcycleVehicleAnimInstance::bIsHonking' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsSoloJumpTrickOutro) == 0x00063A, "Member 'UFortMotorcycleVehicleAnimInstance::bIsSoloJumpTrickOutro' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsJumpTrickNone) == 0x00063B, "Member 'UFortMotorcycleVehicleAnimInstance::bIsJumpTrickNone' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, BrakeLeverAlpha) == 0x00063C, "Member 'UFortMotorcycleVehicleAnimInstance::BrakeLeverAlpha' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldExitFromLocomotion) == 0x000640, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldExitFromLocomotion' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateRuleFromRevvingToThrottle) == 0x000641, "Member 'UFortMotorcycleVehicleAnimInstance::bStateRuleFromRevvingToThrottle' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldPlayThrottleAnim) == 0x000642, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldPlayThrottleAnim' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateTransitionRuleToMovingLoop) == 0x000643, "Member 'UFortMotorcycleVehicleAnimInstance::bStateTransitionRuleToMovingLoop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bEarlyOutFromMovingStart) == 0x000644, "Member 'UFortMotorcycleVehicleAnimInstance::bEarlyOutFromMovingStart' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldStop) == 0x000645, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldStop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldReverse) == 0x000646, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldReverse' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldReverseStop) == 0x000647, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldReverseStop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldStopThrottling) == 0x000648, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldStopThrottling' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsFromJumpTrick) == 0x000649, "Member 'UFortMotorcycleVehicleAnimInstance::bIsFromJumpTrick' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsSoloJumpTrick) == 0x00064A, "Member 'UFortMotorcycleVehicleAnimInstance::bIsSoloJumpTrick' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldJump) == 0x00064B, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldJump' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsMoving) == 0x00064C, "Member 'UFortMotorcycleVehicleAnimInstance::bIsMoving' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, AirTrickType) == 0x00064D, "Member 'UFortMotorcycleVehicleAnimInstance::AirTrickType' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsLandingInPlace) == 0x00064E, "Member 'UFortMotorcycleVehicleAnimInstance::bIsLandingInPlace' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateRuleFallingToMoving) == 0x00064F, "Member 'UFortMotorcycleVehicleAnimInstance::bStateRuleFallingToMoving' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, JumpChargeFactor) == 0x000650, "Member 'UFortMotorcycleVehicleAnimInstance::JumpChargeFactor' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, ForwardSpeed) == 0x000654, "Member 'UFortMotorcycleVehicleAnimInstance::ForwardSpeed' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStoppie) == 0x000658, "Member 'UFortMotorcycleVehicleAnimInstance::bStoppie' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsBraking) == 0x000659, "Member 'UFortMotorcycleVehicleAnimInstance::bIsBraking' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldBrake) == 0x00065A, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldBrake' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bEarlyOutBrakingOutro) == 0x00065B, "Member 'UFortMotorcycleVehicleAnimInstance::bEarlyOutBrakingOutro' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bShouldJumpTrick) == 0x00065C, "Member 'UFortMotorcycleVehicleAnimInstance::bShouldJumpTrick' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bStateTransitionRuleToReverseLoop) == 0x00065D, "Member 'UFortMotorcycleVehicleAnimInstance::bStateTransitionRuleToReverseLoop' has a wrong offset!");
static_assert(offsetof(UFortMotorcycleVehicleAnimInstance, bIsReverseNoFeet) == 0x00065E, "Member 'UFortMotorcycleVehicleAnimInstance::bIsReverseNoFeet' has a wrong offset!");

// Class MotorcycleRuntime.FortPlayerAnimInstance_MotorcycleRider
// 0x0420 (0x0860 - 0x0440)
#pragma pack(push, 0x1)
class alignas(0x10) UFortPlayerAnimInstance_MotorcycleRider : public UFortBaseLayerAnimInstance
{
public:
	class AFortMotorcycleVehicle*                 Motorcycle;                                        // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortMotorcycleVehicleAnimInstance*     MotorcycleAnimInstance;                            // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAnimInput_Motorcycle              MotorcycleInput;                                   // 0x0450(0x0054)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldVelocity;                                     // 0x04B0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalVelocity;                                     // 0x04C8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightHandIKAlpha;                                  // 0x04E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftHandIKAlpha;                                   // 0x04E4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed2D;                                           // 0x04E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCardinalDirection                        LocomotionCardinalDirection;                       // 0x04EC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortCardinalDirection                        PrePivotCardinalDirection;                         // 0x04ED(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShouldPlayJogPivotTransition : 1;                 // 0x04EE(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPivotTransitionDoOnceTriggered : 1;               // 0x04EE(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsJumping : 1;                                    // 0x04EE(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsReloading : 1;                                  // 0x04EE(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4EF[0x1];                                      // 0x04EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RiderCatchupRotation;                              // 0x04F0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RiderZDisplacement;                                // 0x0510(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementDampUpFactor;                     // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementDampDownFactor;                   // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementLandingFallDistanceThreshold;     // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderMinDisplacement;                              // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderMaxDisplacement;                              // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderDisplacementRampPerSecond;                    // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderRotationInterpSpeed;                          // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAnimInput_VelocityImpact          VelocityImpact;                                    // 0x0530(0x00F0)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ImpactDisplacement;                                // 0x0620(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AbsSteerAngle;                                     // 0x0638(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeanAngle;                                         // 0x063C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallDistanceValue;                                 // 0x0640(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FootTraceLocation;                                 // 0x0648(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootTraceSideOffset;                               // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFootLocationDistance;                           // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFootTrace;                                     // 0x0668(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAir;                                            // 0x0669(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInRollAngleThreshold;                           // 0x066A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDriveStarting;                                  // 0x066B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalLeftOffset;                                   // 0x0670(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPosLeft;                                      // 0x0688(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LocalRotLeftOffset;                                // 0x06A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               WorldRotLeft;                                      // 0x06B8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LocalRightOffset;                                  // 0x06D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPosRight;                                     // 0x06E8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LocalRotRightOffset;                               // 0x0700(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               WorldRotRight;                                     // 0x0718(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsSteeringRotating;                               // 0x0730(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStopped;                                        // 0x0731(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIdle;                                           // 0x0732(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_733[0x1];                                      // 0x0733(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleSpeedKmh;                                      // 0x0734(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSlowingDown;                                    // 0x0738(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrivingFast;                                    // 0x0739(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurningRightHard;                               // 0x073A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurningLeftHard;                                // 0x073B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBraking;                                        // 0x073C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73D[0x1];                                      // 0x073D(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsBoosting;                                       // 0x073E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpTrick;                                      // 0x073F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpPlayRate;                                      // 0x0740(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpFlipping;                                   // 0x0744(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldEnableAO;                                   // 0x0745(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBodyDragging;                                   // 0x0746(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_747[0x1];                                      // 0x0747(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallDistanceJumpingThreshold;                      // 0x0748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallDistanceJumpTrickThreshold;                    // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollAngleThreshold;                                // 0x0750(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartSpeedThreshold;                               // 0x0754(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlowingSpeedThreshold;                             // 0x0758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FastSpeedThreshold;                                // 0x075C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakingDeltaThreshold;                             // 0x0760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteerHardAngleThreshold;                           // 0x0764(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundTraceUpOffset;                               // 0x0768(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundTraceLength;                                 // 0x076C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              JumpPlayRateInRange;                               // 0x0770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              JumpPlayRateOutRange;                              // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpChargeFactor;                                  // 0x0790(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargingJump;                                   // 0x0794(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMotorcycleJumping;                              // 0x0795(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotorcycleLaunchedJump;                           // 0x0796(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWheelie;                                          // 0x0797(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoppie;                                          // 0x0798(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMotorcycleAirTrickType                   AirTrickType;                                      // 0x0799(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpingAndNotRolling;                           // 0x079A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGroundAndNotRolling;                          // 0x079B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGroundAndBoosting;                            // 0x079C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayPivotOnGroundAndNotBoosting;                  // 0x079D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPowerSliding;                                   // 0x079E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79F[0x1];                                      // 0x079F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PowerSlideSteeringAngleThreshold;                  // 0x07A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PowerSlideSpeedThreshold;                          // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LandStartPosInRange;                               // 0x07B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LandStartPosOutRange;                              // 0x07C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandStartPosition;                                 // 0x07D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPawnStandUp;                                // 0x07D4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSmoothingYaw;                                   // 0x07D5(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D6[0x2];                                      // 0x07D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimPitch;                                          // 0x07D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYaw;                                            // 0x07DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawLastFrame;                                   // 0x07E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawSmoothed;                                    // 0x07E4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BodyAimYaw;                                        // 0x07E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NegativeBodyAimYaw;                                // 0x07EC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardSpeed;                                      // 0x07F0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousForwardSpeed;                              // 0x07F4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalSpeed;                                        // 0x07F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReversing;                                      // 0x07FC(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x07FD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x07FE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingConsumable;                                // 0x07FF(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               IntroCachedTime;                                   // 0x0800(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StoppieLandTime;                                   // 0x0814(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayHitReact;                               // 0x0818(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingMontage;                                 // 0x0819(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81A[0x2];                                      // 0x081A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VehiclePitch;                                      // 0x081C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleRoll;                                       // 0x0820(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_824[0x4];                                      // 0x0824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               MeleeTwistRot;                                     // 0x0828(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStateTransitionRuleToMovingLoop;                  // 0x0840(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_841[0x3];                                      // 0x0841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpperBodyAdditiveAlpha;                            // 0x0844(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperBodyAdditiveStrength;                         // 0x0848(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovingNoisePlayRate;                               // 0x084C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFemale;                                         // 0x0850(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AnimNotify_JumpEntered();
	void CalculateNoiseAlpha();
	void CollapsedAimYawSmoothed(float DeltaSeconds);
	void HandleCancelChargingJump();
	void HandleChargingJump(const float InJumpChargeFactor);
	void HandleFinishAirTrick();
	void HandleJump(const float InJumpChargeFactor);
	void HandleReleaseStoppie();
	void HandleReleaseWheelie();
	void HandleStartAirTrick(const EFortMotorcycleAirTrickType TrickType);
	void HandleStartChargingJump();
	void HandleStartStoppie();
	void HandleStartWheelie();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_MotorcycleRider">();
	}
	static class UFortPlayerAnimInstance_MotorcycleRider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_MotorcycleRider>();
	}
};
#pragma pack(pop)
static_assert(alignof(UFortPlayerAnimInstance_MotorcycleRider) == 0x000010, "Wrong alignment on UFortPlayerAnimInstance_MotorcycleRider");
static_assert(sizeof(UFortPlayerAnimInstance_MotorcycleRider) == 0x000860, "Wrong size on UFortPlayerAnimInstance_MotorcycleRider");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, Motorcycle) == 0x000440, "Member 'UFortPlayerAnimInstance_MotorcycleRider::Motorcycle' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, MotorcycleAnimInstance) == 0x000448, "Member 'UFortPlayerAnimInstance_MotorcycleRider::MotorcycleAnimInstance' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, MotorcycleInput) == 0x000450, "Member 'UFortPlayerAnimInstance_MotorcycleRider::MotorcycleInput' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FortPlayerPawn) == 0x0004A8, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, WorldVelocity) == 0x0004B0, "Member 'UFortPlayerAnimInstance_MotorcycleRider::WorldVelocity' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LocalVelocity) == 0x0004C8, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LocalVelocity' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RightHandIKAlpha) == 0x0004E0, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RightHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LeftHandIKAlpha) == 0x0004E4, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LeftHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, Speed2D) == 0x0004E8, "Member 'UFortPlayerAnimInstance_MotorcycleRider::Speed2D' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LocomotionCardinalDirection) == 0x0004EC, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LocomotionCardinalDirection' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, PrePivotCardinalDirection) == 0x0004ED, "Member 'UFortPlayerAnimInstance_MotorcycleRider::PrePivotCardinalDirection' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderCatchupRotation) == 0x0004F0, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderCatchupRotation' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderZDisplacement) == 0x000510, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderZDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementDampUpFactor) == 0x000514, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementDampUpFactor' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementDampDownFactor) == 0x000518, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementDampDownFactor' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementLandingFallDistanceThreshold) == 0x00051C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementLandingFallDistanceThreshold' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderMinDisplacement) == 0x000520, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderMinDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderMaxDisplacement) == 0x000524, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderMaxDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderDisplacementRampPerSecond) == 0x000528, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderDisplacementRampPerSecond' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, RiderRotationInterpSpeed) == 0x00052C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::RiderRotationInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, VelocityImpact) == 0x000530, "Member 'UFortPlayerAnimInstance_MotorcycleRider::VelocityImpact' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, ImpactDisplacement) == 0x000620, "Member 'UFortPlayerAnimInstance_MotorcycleRider::ImpactDisplacement' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, AbsSteerAngle) == 0x000638, "Member 'UFortPlayerAnimInstance_MotorcycleRider::AbsSteerAngle' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LeanAngle) == 0x00063C, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LeanAngle' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FallDistanceValue) == 0x000640, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FallDistanceValue' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FootTraceLocation) == 0x000648, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FootTraceLocation' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, FootTraceSideOffset) == 0x000660, "Member 'UFortPlayerAnimInstance_MotorcycleRider::FootTraceSideOffset' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, MaxFootLocationDistance) == 0x000664, "Member 'UFortPlayerAnimInstance_MotorcycleRider::MaxFootLocationDistance' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bHasFootTrace) == 0x000668, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bHasFootTrace' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bInAir) == 0x000669, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bInAir' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bIsInRollAngleThreshold) == 0x00066A, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bIsInRollAngleThreshold' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, bIsDriveStarting) == 0x00066B, "Member 'UFortPlayerAnimInstance_MotorcycleRider::bIsDriveStarting' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, LocalLeftOffset) == 0x000670, "Member 'UFortPlayerAnimInstance_MotorcycleRider::LocalLeftOffset' has a wrong offset!");
static_assert(offsetof(UFortPlayerAnimInstance_MotorcycleRider, WorldPosLeft) == 0x000688, "Member 'UFortPlayerAnimInstance_MotorcycleRider::WorldPosLeft' has a wrong offset!");
