#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MTXButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MTXButton.MTXButton_C.GetHoverAnimation
// 0x0028 (0x0028 - 0x0000)
struct MTXButton_C_GetHoverAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_GetHoverAnimation) == 0x000008, "Wrong alignment on MTXButton_C_GetHoverAnimation");
static_assert(sizeof(MTXButton_C_GetHoverAnimation) == 0x000028, "Wrong size on MTXButton_C_GetHoverAnimation");
static_assert(offsetof(MTXButton_C_GetHoverAnimation, ReturnValue) == 0x000000, "Member 'MTXButton_C_GetHoverAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_GetHoverAnimation, Temp_bool_Variable) == 0x000008, "Member 'MTXButton_C_GetHoverAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MTXButton_C_GetHoverAnimation, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000010, "Member 'MTXButton_C_GetHoverAnimation::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_GetHoverAnimation, CallFunc_IsMobileGame_ReturnValue) == 0x000018, "Member 'MTXButton_C_GetHoverAnimation::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_GetHoverAnimation, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'MTXButton_C_GetHoverAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_GetHoverAnimation, K2Node_Select_Default) == 0x000020, "Member 'MTXButton_C_GetHoverAnimation::K2Node_Select_Default' has a wrong offset!");

// Function MTXButton.MTXButton_C.ExecuteUbergraph_MTXButton
// 0x0100 (0x0100 - 0x0000)
struct MTXButton_C_ExecuteUbergraph_MTXButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_SelectMaterialInstance_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetHoverAnimation_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetHoverAnimation_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_2;               // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_3;               // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_ExecuteUbergraph_MTXButton) == 0x000008, "Wrong alignment on MTXButton_C_ExecuteUbergraph_MTXButton");
static_assert(sizeof(MTXButton_C_ExecuteUbergraph_MTXButton) == 0x000100, "Wrong size on MTXButton_C_ExecuteUbergraph_MTXButton");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, EntryPoint) == 0x000000, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, Temp_real_Variable) == 0x000008, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, Temp_real_Variable_1) == 0x000010, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000020, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000028, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, Temp_bool_Variable) == 0x000029, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsMobileGame_ReturnValue) == 0x00002A, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000030, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsMobileGame_ReturnValue_1) == 0x000039, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_SelectColor_ReturnValue) == 0x00003C, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_Select_Default) == 0x000050, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_SelectMaterialInstance_ReturnValue) == 0x000058, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_SelectMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, Temp_real_Variable_2) == 0x000060, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, Temp_real_Variable_3) == 0x000068, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_CustomEvent_bNewInputType) == 0x000070, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000080, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_SelectFloat_ReturnValue) == 0x000088, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_MakeStruct_Margin) == 0x000090, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000A0, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_MakeVector2D_ReturnValue) == 0x0000B0, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, Temp_bool_Variable_1) == 0x0000C0, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_Select_Default_1) == 0x0000C8, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetHoverAnimation_ReturnValue) == 0x0000D0, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetHoverAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_GetHoverAnimation_ReturnValue_1) == 0x0000D8, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_GetHoverAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000E0, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000E8, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsUsingTouch_ReturnValue) == 0x0000F0, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsUsingTouch_ReturnValue_1) == 0x0000F1, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsUsingTouch_ReturnValue_2) == 0x0000F2, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsUsingTouch_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_IsUsingTouch_ReturnValue_3) == 0x0000F3, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_IsUsingTouch_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x0000F4, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, K2Node_MakeStruct_Top_ImplicitCast) == 0x0000F8, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(MTXButton_C_ExecuteUbergraph_MTXButton, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0000FC, "Member 'MTXButton_C_ExecuteUbergraph_MTXButton::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function MTXButton.MTXButton_C.EventOnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct MTXButton_C_EventOnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MTXButton_C_EventOnInputMethodChanged) == 0x000001, "Wrong alignment on MTXButton_C_EventOnInputMethodChanged");
static_assert(sizeof(MTXButton_C_EventOnInputMethodChanged) == 0x000001, "Wrong size on MTXButton_C_EventOnInputMethodChanged");
static_assert(offsetof(MTXButton_C_EventOnInputMethodChanged, bNewInputType) == 0x000000, "Member 'MTXButton_C_EventOnInputMethodChanged::bNewInputType' has a wrong offset!");

}

