#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MTXOffer_SpecialBanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MTXOffer_SpecialBanner.MTXOffer_SpecialBanner_C
// 0x0068 (0x02D0 - 0x0268)
class UMTXOffer_SpecialBanner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border_SaleInfo;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_BattlePassStarsSupplemental;                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BattleStarSupplemental;                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_BattleStarInfoSupplemental;                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_SaleInfo;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowBanner;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasBattlePassStars;                               // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SalesInfoText;                                     // 0x02A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumOfBattlePassStars;                              // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCatalogMessaging*                      CatalogMessaging;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetupSpecialOfferBanner(bool bHasSale, const class FText& SaleText, const class FString& BannerOverrideTag, bool bHasBattlePassStars_0, int32 iNumOfBattlePassStars);
	void ExecuteUbergraph_MTXOffer_SpecialBanner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MTXOffer_SpecialBanner_C">();
	}
	static class UMTXOffer_SpecialBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTXOffer_SpecialBanner_C>();
	}
};
static_assert(alignof(UMTXOffer_SpecialBanner_C) == 0x000008, "Wrong alignment on UMTXOffer_SpecialBanner_C");
static_assert(sizeof(UMTXOffer_SpecialBanner_C) == 0x0002D0, "Wrong size on UMTXOffer_SpecialBanner_C");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, UberGraphFrame) == 0x000268, "Member 'UMTXOffer_SpecialBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, Border_SaleInfo) == 0x000270, "Member 'UMTXOffer_SpecialBanner_C::Border_SaleInfo' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, HB_BattlePassStarsSupplemental) == 0x000278, "Member 'UMTXOffer_SpecialBanner_C::HB_BattlePassStarsSupplemental' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, Image_BattleStarSupplemental) == 0x000280, "Member 'UMTXOffer_SpecialBanner_C::Image_BattleStarSupplemental' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, T_BattleStarInfoSupplemental) == 0x000288, "Member 'UMTXOffer_SpecialBanner_C::T_BattleStarInfoSupplemental' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, T_SaleInfo) == 0x000290, "Member 'UMTXOffer_SpecialBanner_C::T_SaleInfo' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, WidgetSwitcher_Main) == 0x000298, "Member 'UMTXOffer_SpecialBanner_C::WidgetSwitcher_Main' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, bShowBanner) == 0x0002A0, "Member 'UMTXOffer_SpecialBanner_C::bShowBanner' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, bHasBattlePassStars) == 0x0002A1, "Member 'UMTXOffer_SpecialBanner_C::bHasBattlePassStars' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, SalesInfoText) == 0x0002A8, "Member 'UMTXOffer_SpecialBanner_C::SalesInfoText' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, NumOfBattlePassStars) == 0x0002C0, "Member 'UMTXOffer_SpecialBanner_C::NumOfBattlePassStars' has a wrong offset!");
static_assert(offsetof(UMTXOffer_SpecialBanner_C, CatalogMessaging) == 0x0002C8, "Member 'UMTXOffer_SpecialBanner_C::CatalogMessaging' has a wrong offset!");

}

