#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusterCoreWeaponsRuntime

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class MusterCoreWeaponsRuntime.FortMusterExplosiveARProjectile
// 0x0090 (0x0C30 - 0x0BA0)
class AFortMusterExplosiveARProjectile final : public AFortProjectileAthena
{
public:
	struct FVector                                HitLocation;                                       // 0x0BA0(0x0018)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               HitRotation;                                       // 0x0BB8(0x0018)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bHitPlayer;                                        // 0x0BD0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BD1[0x3];                                      // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawDistance;                                      // 0x0BD4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystemComponent*               ProjectileTrail;                                   // 0x0BD8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         NS_Explosion;                                      // 0x0BE0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0BE8(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BEC[0x4];                                      // 0x0BEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DecalSize;                                         // 0x0BF0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DecalLifespan;                                     // 0x0C08(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimebeforeDecalFadeOut;                            // 0x0C0C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DecalFadeOutDuration;                              // 0x0C10(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C14[0x4];                                      // 0x0C14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DecalMaterial;                                     // 0x0C18(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             Cue_CloseSound;                                    // 0x0C20(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             Cue_DistantSound;                                  // 0x0C28(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_HitLocation();
	void SetHitLocation(const struct FVector& NewHitLocation);
	void SetHitPlayer(bool bWasHit);
	void SetHitRotation(const struct FRotator& NewHitRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMusterExplosiveARProjectile">();
	}
	static class AFortMusterExplosiveARProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortMusterExplosiveARProjectile>();
	}
};
static_assert(alignof(AFortMusterExplosiveARProjectile) == 0x000008, "Wrong alignment on AFortMusterExplosiveARProjectile");
static_assert(sizeof(AFortMusterExplosiveARProjectile) == 0x000C30, "Wrong size on AFortMusterExplosiveARProjectile");
static_assert(offsetof(AFortMusterExplosiveARProjectile, HitLocation) == 0x000BA0, "Member 'AFortMusterExplosiveARProjectile::HitLocation' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, HitRotation) == 0x000BB8, "Member 'AFortMusterExplosiveARProjectile::HitRotation' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, bHitPlayer) == 0x000BD0, "Member 'AFortMusterExplosiveARProjectile::bHitPlayer' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, DrawDistance) == 0x000BD4, "Member 'AFortMusterExplosiveARProjectile::DrawDistance' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, ProjectileTrail) == 0x000BD8, "Member 'AFortMusterExplosiveARProjectile::ProjectileTrail' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, NS_Explosion) == 0x000BE0, "Member 'AFortMusterExplosiveARProjectile::NS_Explosion' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, FeedbackCue) == 0x000BE8, "Member 'AFortMusterExplosiveARProjectile::FeedbackCue' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, DecalSize) == 0x000BF0, "Member 'AFortMusterExplosiveARProjectile::DecalSize' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, DecalLifespan) == 0x000C08, "Member 'AFortMusterExplosiveARProjectile::DecalLifespan' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, TimebeforeDecalFadeOut) == 0x000C0C, "Member 'AFortMusterExplosiveARProjectile::TimebeforeDecalFadeOut' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, DecalFadeOutDuration) == 0x000C10, "Member 'AFortMusterExplosiveARProjectile::DecalFadeOutDuration' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, DecalMaterial) == 0x000C18, "Member 'AFortMusterExplosiveARProjectile::DecalMaterial' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, Cue_CloseSound) == 0x000C20, "Member 'AFortMusterExplosiveARProjectile::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AFortMusterExplosiveARProjectile, Cue_DistantSound) == 0x000C28, "Member 'AFortMusterExplosiveARProjectile::Cue_DistantSound' has a wrong offset!");

// Class MusterCoreWeaponsRuntime.MusterCoreWeaponsAnimInstance
// 0x0020 (0x0370 - 0x0350)
class UMusterCoreWeaponsAnimInstance final : public UAnimInstance
{
public:
	class AFortWeapon*                            OwningWeapon;                                      // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsShotFired;                                      // 0x0350(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalAmmoCount;                                    // 0x0354(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CylinderMaskAlpha;                                 // 0x0358(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAmmoCountTwo;                                   // 0x035C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAmmoCountOne;                                   // 0x035D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFromFullToTwoAmmo;                       // 0x035E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFromTwoToOneAmmo;                        // 0x035F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateRuleFromOneToZero;                           // 0x0360(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0xF];                                      // 0x0361(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusterCoreWeaponsAnimInstance">();
	}
	static class UMusterCoreWeaponsAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusterCoreWeaponsAnimInstance>();
	}
};
static_assert(alignof(UMusterCoreWeaponsAnimInstance) == 0x000010, "Wrong alignment on UMusterCoreWeaponsAnimInstance");
static_assert(sizeof(UMusterCoreWeaponsAnimInstance) == 0x000370, "Wrong size on UMusterCoreWeaponsAnimInstance");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, OwningWeapon) == 0x000348, "Member 'UMusterCoreWeaponsAnimInstance::OwningWeapon' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, bIsShotFired) == 0x000350, "Member 'UMusterCoreWeaponsAnimInstance::bIsShotFired' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, LocalAmmoCount) == 0x000354, "Member 'UMusterCoreWeaponsAnimInstance::LocalAmmoCount' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, CylinderMaskAlpha) == 0x000358, "Member 'UMusterCoreWeaponsAnimInstance::CylinderMaskAlpha' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, bIsAmmoCountTwo) == 0x00035C, "Member 'UMusterCoreWeaponsAnimInstance::bIsAmmoCountTwo' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, bIsAmmoCountOne) == 0x00035D, "Member 'UMusterCoreWeaponsAnimInstance::bIsAmmoCountOne' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, bStateRuleFromFullToTwoAmmo) == 0x00035E, "Member 'UMusterCoreWeaponsAnimInstance::bStateRuleFromFullToTwoAmmo' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, bStateRuleFromTwoToOneAmmo) == 0x00035F, "Member 'UMusterCoreWeaponsAnimInstance::bStateRuleFromTwoToOneAmmo' has a wrong offset!");
static_assert(offsetof(UMusterCoreWeaponsAnimInstance, bStateRuleFromOneToZero) == 0x000360, "Member 'UMusterCoreWeaponsAnimInstance::bStateRuleFromOneToZero' has a wrong offset!");

// Class MusterCoreWeaponsRuntime.FortExCaliberProjectile
// 0x0090 (0x0C30 - 0x0BA0)
class AFortExCaliberProjectile final : public AFortProjectileAthena
{
public:
	bool                                          bSimulationRunning;                                // 0x0BA0(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         TimeToExplode;                                     // 0x0BA8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasStopped;                                       // 0x0BD0(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitNormal;                                         // 0x0BD8(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPhysicalSurface                              SurfaceType;                                       // 0x0BF0(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BF1[0x3];                                      // 0x0BF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SwordRevealMaterialParam;                          // 0x0BF4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EmissiveColorMaterialParam;                        // 0x0BF8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   HDRMultiplierMaterialParam;                        // 0x0BFC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           EmissiveBlueColor;                                 // 0x0C00(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           EmissivePurpleColor;                               // 0x0C10(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinPitchForRotationAdjustment;                     // 0x0C20(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxPitchForRotationAdjustment;                     // 0x0C24(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C28[0x8];                                      // 0x0C28(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnProjectileStopped();
	void OnAttachedActorDestroyed(class AActor* DestroyedActor);
	void OnAttachedBuildingDestroyed(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnRep_bSimulationRunning();
	void PlayPreExplosionEfffects();
	void RestartSimulating();
	void SetFuseColorBasedOnTeam();
	void SetupProjectileHitAudio(const struct FVector& ProjectileImpactLocation, const class AActor* HitActor);
	void SetupSwordRevealEffects(class UStaticMeshComponent* ProjectileMesh, float SwordRevealAlpha, float ColorChangeAlpha, float HDRMultiplierAlpha);
	void TriggerExplosion();
	void UnblockPawnCollision();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortExCaliberProjectile">();
	}
	static class AFortExCaliberProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortExCaliberProjectile>();
	}
};
static_assert(alignof(AFortExCaliberProjectile) == 0x000008, "Wrong alignment on AFortExCaliberProjectile");
static_assert(sizeof(AFortExCaliberProjectile) == 0x000C30, "Wrong size on AFortExCaliberProjectile");
static_assert(offsetof(AFortExCaliberProjectile, bSimulationRunning) == 0x000BA0, "Member 'AFortExCaliberProjectile::bSimulationRunning' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, TimeToExplode) == 0x000BA8, "Member 'AFortExCaliberProjectile::TimeToExplode' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, bHasStopped) == 0x000BD0, "Member 'AFortExCaliberProjectile::bHasStopped' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, HitNormal) == 0x000BD8, "Member 'AFortExCaliberProjectile::HitNormal' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, SurfaceType) == 0x000BF0, "Member 'AFortExCaliberProjectile::SurfaceType' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, SwordRevealMaterialParam) == 0x000BF4, "Member 'AFortExCaliberProjectile::SwordRevealMaterialParam' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, EmissiveColorMaterialParam) == 0x000BF8, "Member 'AFortExCaliberProjectile::EmissiveColorMaterialParam' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, HDRMultiplierMaterialParam) == 0x000BFC, "Member 'AFortExCaliberProjectile::HDRMultiplierMaterialParam' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, EmissiveBlueColor) == 0x000C00, "Member 'AFortExCaliberProjectile::EmissiveBlueColor' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, EmissivePurpleColor) == 0x000C10, "Member 'AFortExCaliberProjectile::EmissivePurpleColor' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, MinPitchForRotationAdjustment) == 0x000C20, "Member 'AFortExCaliberProjectile::MinPitchForRotationAdjustment' has a wrong offset!");
static_assert(offsetof(AFortExCaliberProjectile, MaxPitchForRotationAdjustment) == 0x000C24, "Member 'AFortExCaliberProjectile::MaxPitchForRotationAdjustment' has a wrong offset!");

}

