#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NaniteDisplacedMesh

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NaniteDisplacedMesh.NaniteDisplacedMesh
// 0x0110 (0x0138 - 0x0028)
class UNaniteDisplacedMesh final : public UObject
{
public:
	uint8                                         Pad_28[0x110];                                     // 0x0028(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NaniteDisplacedMesh">();
	}
	static class UNaniteDisplacedMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNaniteDisplacedMesh>();
	}
};
static_assert(alignof(UNaniteDisplacedMesh) == 0x000008, "Wrong alignment on UNaniteDisplacedMesh");
static_assert(sizeof(UNaniteDisplacedMesh) == 0x000138, "Wrong size on UNaniteDisplacedMesh");

// Class NaniteDisplacedMesh.NaniteDisplacedMeshComponent
// 0x0010 (0x0630 - 0x0620)
class UNaniteDisplacedMeshComponent final : public UStaticMeshComponent
{
public:
	class UNaniteDisplacedMesh*                   DisplacedMesh;                                     // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NaniteDisplacedMeshComponent">();
	}
	static class UNaniteDisplacedMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNaniteDisplacedMeshComponent>();
	}
};
static_assert(alignof(UNaniteDisplacedMeshComponent) == 0x000010, "Wrong alignment on UNaniteDisplacedMeshComponent");
static_assert(sizeof(UNaniteDisplacedMeshComponent) == 0x000630, "Wrong size on UNaniteDisplacedMeshComponent");
static_assert(offsetof(UNaniteDisplacedMeshComponent, DisplacedMesh) == 0x000620, "Member 'UNaniteDisplacedMeshComponent::DisplacedMesh' has a wrong offset!");

}

