#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct NearestNeighborModel.SkeletonCachePair
// 0x0010 (0x0010 - 0x0000)
struct FSkeletonCachePair final
{
public:
	class UAnimSequence*                          Skeletons;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         Cache;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSkeletonCachePair) == 0x000008, "Wrong alignment on FSkeletonCachePair");
static_assert(sizeof(FSkeletonCachePair) == 0x000010, "Wrong size on FSkeletonCachePair");
static_assert(offsetof(FSkeletonCachePair, Skeletons) == 0x000000, "Member 'FSkeletonCachePair::Skeletons' has a wrong offset!");
static_assert(offsetof(FSkeletonCachePair, Cache) == 0x000008, "Member 'FSkeletonCachePair::Cache' has a wrong offset!");

// ScriptStruct NearestNeighborModel.ClothPartEditorData
// 0x0020 (0x0020 - 0x0000)
struct FClothPartEditorData final
{
public:
	int32                                         PCACoeffNum;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VertexMapPath;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MeshIndex;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FClothPartEditorData) == 0x000008, "Wrong alignment on FClothPartEditorData");
static_assert(sizeof(FClothPartEditorData) == 0x000020, "Wrong size on FClothPartEditorData");
static_assert(offsetof(FClothPartEditorData, PCACoeffNum) == 0x000000, "Member 'FClothPartEditorData::PCACoeffNum' has a wrong offset!");
static_assert(offsetof(FClothPartEditorData, VertexMapPath) == 0x000008, "Member 'FClothPartEditorData::VertexMapPath' has a wrong offset!");
static_assert(offsetof(FClothPartEditorData, MeshIndex) == 0x000018, "Member 'FClothPartEditorData::MeshIndex' has a wrong offset!");

// ScriptStruct NearestNeighborModel.ClothPartData
// 0x0060 (0x0060 - 0x0000)
struct FClothPartData final
{
public:
	int32                                         PCACoeffNum;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PCACoeffStart;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumVertices;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumNeighbors;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint32>                                VertexMap;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 PCABasis;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 VertexMean;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NeighborCoeffs;                                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NeighborOffsets;                                   // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClothPartData) == 0x000008, "Wrong alignment on FClothPartData");
static_assert(sizeof(FClothPartData) == 0x000060, "Wrong size on FClothPartData");
static_assert(offsetof(FClothPartData, PCACoeffNum) == 0x000000, "Member 'FClothPartData::PCACoeffNum' has a wrong offset!");
static_assert(offsetof(FClothPartData, PCACoeffStart) == 0x000004, "Member 'FClothPartData::PCACoeffStart' has a wrong offset!");
static_assert(offsetof(FClothPartData, NumVertices) == 0x000008, "Member 'FClothPartData::NumVertices' has a wrong offset!");
static_assert(offsetof(FClothPartData, NumNeighbors) == 0x00000C, "Member 'FClothPartData::NumNeighbors' has a wrong offset!");
static_assert(offsetof(FClothPartData, VertexMap) == 0x000010, "Member 'FClothPartData::VertexMap' has a wrong offset!");
static_assert(offsetof(FClothPartData, PCABasis) == 0x000020, "Member 'FClothPartData::PCABasis' has a wrong offset!");
static_assert(offsetof(FClothPartData, VertexMean) == 0x000030, "Member 'FClothPartData::VertexMean' has a wrong offset!");
static_assert(offsetof(FClothPartData, NeighborCoeffs) == 0x000040, "Member 'FClothPartData::NeighborCoeffs' has a wrong offset!");
static_assert(offsetof(FClothPartData, NeighborOffsets) == 0x000050, "Member 'FClothPartData::NeighborOffsets' has a wrong offset!");

}

