#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySuggestionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartySuggestionButton.PartySuggestionButton_C
// 0x0130 (0x15A0 - 0x1470)
class UPartySuggestionButton_C final : public UFortPartySuggestionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RequestAccepted;                                   // 0x1478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MouseHovered;                                      // 0x1480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x1488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderOfDarkenedText;                              // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_ActionPrompt;                                   // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_SquiglyTail;                                     // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SparklyTraingles;                                  // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal;                             // 0x14C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MainBorder_Normal_Tail;                        // 0x14D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_ShapeChange;                           // 0x14D8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_14E4[0x4];                                     // 0x14E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SS_0_Stiffness;                                    // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SS_0_Damping;                                      // 0x14F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SS_0_Mass;                                         // 0x14F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spring_ShapeChange_NewVal;                         // 0x1500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spring_ShapeChange_Target;                         // 0x1508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_ShapeParam;                                    // 0x1510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1514[0x4];                                     // 0x1514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     M_MainBorder_Normal;                               // 0x1518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Normal_Tail;                          // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight;                            // 0x1528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_MainBorder_Highlight_Tail;                       // 0x1530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder;                               // 0x1538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_HighlightBorder_Tail;                          // 0x1540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Border;                                    // 0x1548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Cur_Tail;                                      // 0x1550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_SparkleTraingles;                              // 0x1558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     M_SparkleTriangles;                                // 0x1560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_R_Param;                                 // 0x1568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_InnerColorParam;                      // 0x156C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_OuterColorParam;                      // 0x1570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Color_L_Param;                                 // 0x1574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MID_Sparkles_TriangleColor_A;                      // 0x1578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_Scale;                                 // 0x157C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        Spring_Scale_Target;                               // 0x1588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpringInterpAnims;                             // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInvited;                                         // 0x1591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewSuggestionInQueue;                             // 0x1592(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetupMIDReferences();
	void SetMainMIDs(class UMaterialInstanceDynamic* BorderMID, class UMaterialInstanceDynamic* TailMID, class UMaterialInstanceDynamic* SparklesMID);
	void PlayOutro();
	void PlayIntro();
	void OnSuggestionChanged();
	void OnSuggestionAccepted();
	void OnNewSuggestionAdded();
	void OnInitialized();
	void OnDisplayInfoUpdated(bool bIsInvited, bool bIsPlaying);
	void OnDismissSuggestion();
	void InitPhysAnim();
	void InitMIDs();
	void HandleOutroAnimationFinished();
	void ExecuteUbergraph_PartySuggestionButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartySuggestionButton_C">();
	}
	static class UPartySuggestionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartySuggestionButton_C>();
	}
};
static_assert(alignof(UPartySuggestionButton_C) == 0x000010, "Wrong alignment on UPartySuggestionButton_C");
static_assert(sizeof(UPartySuggestionButton_C) == 0x0015A0, "Wrong size on UPartySuggestionButton_C");
static_assert(offsetof(UPartySuggestionButton_C, UberGraphFrame) == 0x001470, "Member 'UPartySuggestionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, RequestAccepted) == 0x001478, "Member 'UPartySuggestionButton_C::RequestAccepted' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MouseHovered) == 0x001480, "Member 'UPartySuggestionButton_C::MouseHovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Outro) == 0x001488, "Member 'UPartySuggestionButton_C::Outro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Hovered) == 0x001490, "Member 'UPartySuggestionButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Intro) == 0x001498, "Member 'UPartySuggestionButton_C::Intro' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Border_0) == 0x0014A0, "Member 'UPartySuggestionButton_C::Border_0' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, BorderOfDarkenedText) == 0x0014A8, "Member 'UPartySuggestionButton_C::BorderOfDarkenedText' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, HB_ActionPrompt) == 0x0014B0, "Member 'UPartySuggestionButton_C::HB_ActionPrompt' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, I_SquiglyTail) == 0x0014B8, "Member 'UPartySuggestionButton_C::I_SquiglyTail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SparklyTraingles) == 0x0014C0, "Member 'UPartySuggestionButton_C::SparklyTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal) == 0x0014C8, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_MainBorder_Normal_Tail) == 0x0014D0, "Member 'UPartySuggestionButton_C::MID_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_ShapeChange) == 0x0014D8, "Member 'UPartySuggestionButton_C::SpringState_ShapeChange' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Stiffness) == 0x0014E8, "Member 'UPartySuggestionButton_C::SS_0_Stiffness' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Damping) == 0x0014F0, "Member 'UPartySuggestionButton_C::SS_0_Damping' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SS_0_Mass) == 0x0014F8, "Member 'UPartySuggestionButton_C::SS_0_Mass' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_NewVal) == 0x001500, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_NewVal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_ShapeChange_Target) == 0x001508, "Member 'UPartySuggestionButton_C::Spring_ShapeChange_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_ShapeParam) == 0x001510, "Member 'UPartySuggestionButton_C::MID_ShapeParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal) == 0x001518, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Normal_Tail) == 0x001520, "Member 'UPartySuggestionButton_C::M_MainBorder_Normal_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight) == 0x001528, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_MainBorder_Highlight_Tail) == 0x001530, "Member 'UPartySuggestionButton_C::M_MainBorder_Highlight_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder) == 0x001538, "Member 'UPartySuggestionButton_C::MID_HighlightBorder' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_HighlightBorder_Tail) == 0x001540, "Member 'UPartySuggestionButton_C::MID_HighlightBorder_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Border) == 0x001548, "Member 'UPartySuggestionButton_C::MID_Cur_Border' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Cur_Tail) == 0x001550, "Member 'UPartySuggestionButton_C::MID_Cur_Tail' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_SparkleTraingles) == 0x001558, "Member 'UPartySuggestionButton_C::MID_SparkleTraingles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, M_SparkleTriangles) == 0x001560, "Member 'UPartySuggestionButton_C::M_SparkleTriangles' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_R_Param) == 0x001568, "Member 'UPartySuggestionButton_C::MID_Color_R_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_InnerColorParam) == 0x00156C, "Member 'UPartySuggestionButton_C::MID_Sparkles_InnerColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_OuterColorParam) == 0x001570, "Member 'UPartySuggestionButton_C::MID_Sparkles_OuterColorParam' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Color_L_Param) == 0x001574, "Member 'UPartySuggestionButton_C::MID_Color_L_Param' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, MID_Sparkles_TriangleColor_A) == 0x001578, "Member 'UPartySuggestionButton_C::MID_Sparkles_TriangleColor_A' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, SpringState_Scale) == 0x00157C, "Member 'UPartySuggestionButton_C::SpringState_Scale' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, Spring_Scale_Target) == 0x001588, "Member 'UPartySuggestionButton_C::Spring_Scale_Target' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bUseSpringInterpAnims) == 0x001590, "Member 'UPartySuggestionButton_C::bUseSpringInterpAnims' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, IsInvited) == 0x001591, "Member 'UPartySuggestionButton_C::IsInvited' has a wrong offset!");
static_assert(offsetof(UPartySuggestionButton_C, bNewSuggestionInQueue) == 0x001592, "Member 'UPartySuggestionButton_C::bNewSuggestionInQueue' has a wrong offset!");

}

