#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySuggestionButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PartySuggestionButton.PartySuggestionButton_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct PartySuggestionButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_Tick) == 0x000008, "Wrong alignment on PartySuggestionButton_C_Tick");
static_assert(sizeof(PartySuggestionButton_C_Tick) == 0x000048, "Wrong size on PartySuggestionButton_C_Tick");
static_assert(offsetof(PartySuggestionButton_C_Tick, MyGeometry) == 0x000000, "Member 'PartySuggestionButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_Tick, InDeltaTime) == 0x000040, "Member 'PartySuggestionButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.SetupMIDReferences
// 0x0040 (0x0040 - 0x0000)
struct PartySuggestionButton_C_SetupMIDReferences final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_SetupMIDReferences) == 0x000008, "Wrong alignment on PartySuggestionButton_C_SetupMIDReferences");
static_assert(sizeof(PartySuggestionButton_C_SetupMIDReferences) == 0x000040, "Wrong size on PartySuggestionButton_C_SetupMIDReferences");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_IsValid_ReturnValue_2) == 0x000011, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000018, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000020, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000028, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x000030, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_IsValid_ReturnValue_3) == 0x000038, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_IsValid_ReturnValue_4) == 0x000039, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.SetMainMIDs
// 0x0078 (0x0078 - 0x0000)
struct PartySuggestionButton_C_SetMainMIDs final
{
public:
	class UMaterialInstanceDynamic*               BorderMID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TailMID;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SparklesMID;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LC_Cur_Border_L;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LC_CurBorder_R;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurMIDScalar_ShapeChange;                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue_1; // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurMIDScalar_ShapeChange_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_SetMainMIDs) == 0x000008, "Wrong alignment on PartySuggestionButton_C_SetMainMIDs");
static_assert(sizeof(PartySuggestionButton_C_SetMainMIDs) == 0x000078, "Wrong size on PartySuggestionButton_C_SetMainMIDs");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, BorderMID) == 0x000000, "Member 'PartySuggestionButton_C_SetMainMIDs::BorderMID' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, TailMID) == 0x000008, "Member 'PartySuggestionButton_C_SetMainMIDs::TailMID' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, SparklesMID) == 0x000010, "Member 'PartySuggestionButton_C_SetMainMIDs::SparklesMID' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, LC_Cur_Border_L) == 0x000018, "Member 'PartySuggestionButton_C_SetMainMIDs::LC_Cur_Border_L' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, LC_CurBorder_R) == 0x000028, "Member 'PartySuggestionButton_C_SetMainMIDs::LC_CurBorder_R' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CurMIDScalar_ShapeChange) == 0x000038, "Member 'PartySuggestionButton_C_SetMainMIDs::CurMIDScalar_ShapeChange' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000044, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_K2_GetVectorParameterValue_ReturnValue_1) == 0x000054, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_K2_GetVectorParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_IsValid_ReturnValue_2) == 0x000064, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000068, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00006C, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, K2Node_VariableSet_CurMIDScalar_ShapeChange_ImplicitCast) == 0x000070, "Member 'PartySuggestionButton_C_SetMainMIDs::K2Node_VariableSet_CurMIDScalar_ShapeChange_ImplicitCast' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.OnDisplayInfoUpdated
// 0x0002 (0x0002 - 0x0000)
struct PartySuggestionButton_C_OnDisplayInfoUpdated final
{
public:
	bool                                          bIsInvited;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlaying;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_OnDisplayInfoUpdated) == 0x000001, "Wrong alignment on PartySuggestionButton_C_OnDisplayInfoUpdated");
static_assert(sizeof(PartySuggestionButton_C_OnDisplayInfoUpdated) == 0x000002, "Wrong size on PartySuggestionButton_C_OnDisplayInfoUpdated");
static_assert(offsetof(PartySuggestionButton_C_OnDisplayInfoUpdated, bIsInvited) == 0x000000, "Member 'PartySuggestionButton_C_OnDisplayInfoUpdated::bIsInvited' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_OnDisplayInfoUpdated, bIsPlaying) == 0x000001, "Member 'PartySuggestionButton_C_OnDisplayInfoUpdated::bIsPlaying' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.InitPhysAnim
// 0x0018 (0x0018 - 0x0000)
struct PartySuggestionButton_C_InitPhysAnim final
{
public:
	struct FFloatSpringState                      K2Node_MakeStruct_FloatSpringState;                // 0x0000(0x000C)(NoDestructor)
	struct FFloatSpringState                      K2Node_MakeStruct_FloatSpringState_1;              // 0x000C(0x000C)(NoDestructor)
};
static_assert(alignof(PartySuggestionButton_C_InitPhysAnim) == 0x000004, "Wrong alignment on PartySuggestionButton_C_InitPhysAnim");
static_assert(sizeof(PartySuggestionButton_C_InitPhysAnim) == 0x000018, "Wrong size on PartySuggestionButton_C_InitPhysAnim");
static_assert(offsetof(PartySuggestionButton_C_InitPhysAnim, K2Node_MakeStruct_FloatSpringState) == 0x000000, "Member 'PartySuggestionButton_C_InitPhysAnim::K2Node_MakeStruct_FloatSpringState' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_InitPhysAnim, K2Node_MakeStruct_FloatSpringState_1) == 0x00000C, "Member 'PartySuggestionButton_C_InitPhysAnim::K2Node_MakeStruct_FloatSpringState_1' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.ExecuteUbergraph_PartySuggestionButton
// 0x0160 (0x0160 - 0x0000)
struct PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0080(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FloatSpringInterp_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInvited;                           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPlaying;                           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00FC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_2;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_Select_Default_3;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_Stiffness_ImplicitCast; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_Target_ImplicitCast;    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_CriticalDampingFactor_ImplicitCast; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_Mass_ImplicitCast;      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_Current_ImplicitCast;   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_DeltaTime_ImplicitCast; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Spring_ShapeChange_NewVal_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton) == 0x000008, "Wrong alignment on PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton");
static_assert(sizeof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton) == 0x000160, "Wrong size on PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, EntryPoint) == 0x000000, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_bool_Variable) == 0x000004, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_bool_Variable' has a wrong offset!");
