#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPPickerOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PiPPickerOverlay.PiPPickerOverlay_C
// 0x0038 (0x04D0 - 0x0498)
class UPiPPickerOverlay_C final : public UFortPickerOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectionSet;                                      // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AlignmentDesignViewOnlyu;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Backplate_Shadow;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPictureInPictureClient*                PictureInPictureClient;                            // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPictureInPictureMediaController*       PiPMediaController;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnItemChosen();
	void Construct();
	void ExecuteUbergraph_PiPPickerOverlay(int32 EntryPoint);
	void PlaySelectionAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PiPPickerOverlay_C">();
	}
	static class UPiPPickerOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPiPPickerOverlay_C>();
	}
};
static_assert(alignof(UPiPPickerOverlay_C) == 0x000008, "Wrong alignment on UPiPPickerOverlay_C");
static_assert(sizeof(UPiPPickerOverlay_C) == 0x0004D0, "Wrong size on UPiPPickerOverlay_C");
static_assert(offsetof(UPiPPickerOverlay_C, UberGraphFrame) == 0x000498, "Member 'UPiPPickerOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, Intro) == 0x0004A0, "Member 'UPiPPickerOverlay_C::Intro' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, SelectionSet) == 0x0004A8, "Member 'UPiPPickerOverlay_C::SelectionSet' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, AlignmentDesignViewOnlyu) == 0x0004B0, "Member 'UPiPPickerOverlay_C::AlignmentDesignViewOnlyu' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, Backplate_Shadow) == 0x0004B8, "Member 'UPiPPickerOverlay_C::Backplate_Shadow' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, PictureInPictureClient) == 0x0004C0, "Member 'UPiPPickerOverlay_C::PictureInPictureClient' has a wrong offset!");
static_assert(offsetof(UPiPPickerOverlay_C, PiPMediaController) == 0x0004C8, "Member 'UPiPPickerOverlay_C::PiPMediaController' has a wrong offset!");

}

