#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Goop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01BF (0x01C0 - 0x0001)
struct Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_349;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_350;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_351;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_352;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_353;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_354;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_355;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_356;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_357;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_358;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_359;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_360;                               // 0x0048(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_361;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_362;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_363;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_364;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_365;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_366;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_367;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_368;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_369;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_370;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_371;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_372;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_373;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_374;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_375;                              // 0x0090(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_376;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_377;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_378;                                  // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_379;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_380;                                // 0x00D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_381;                               // 0x00D8(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_382;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_383;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_384;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_385;                               // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_386;                               // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_387;                                // 0x00FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_388;                                // 0x00FD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_389;                                // 0x00FE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_390;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_391;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_392;                                 // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_393;                              // 0x0110(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0128(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A8(0x0018)()
};
static_assert(alignof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001C0, "Wrong size on Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_349) == 0x000004, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_349' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_350) == 0x000008, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_350' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_351) == 0x00000C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_351' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_352) == 0x000010, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_352' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_353) == 0x000014, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_353' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_354) == 0x000018, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_354' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_355) == 0x00001C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_355' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_356) == 0x000020, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_356' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_357) == 0x000024, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_357' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_358) == 0x000028, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_358' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_359) == 0x000038, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_359' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_360) == 0x000048, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_360' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_361) == 0x000058, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_361' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_362) == 0x00005C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_362' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_363) == 0x000060, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_363' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_364) == 0x000064, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_364' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_365) == 0x000068, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_365' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_366) == 0x00006C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_366' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_367) == 0x000070, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_367' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_368) == 0x000074, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_368' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_369) == 0x000078, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_369' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_370) == 0x00007C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_370' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_371) == 0x000080, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_371' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_372) == 0x000084, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_372' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_373) == 0x000088, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_373' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_374) == 0x00008C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_374' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_375) == 0x000090, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_375' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_376) == 0x0000BC, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_376' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_377) == 0x0000C0, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_377' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_378) == 0x0000C8, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_378' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_379) == 0x0000D0, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_379' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_380) == 0x0000D1, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_380' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_381) == 0x0000D8, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_381' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_382) == 0x0000E8, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_382' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_383) == 0x0000EC, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_383' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_384) == 0x0000F0, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_384' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_385) == 0x0000F4, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_385' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_386) == 0x0000F8, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_386' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_387) == 0x0000FC, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_387' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_388) == 0x0000FD, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_388' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_389) == 0x0000FE, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_389' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_390) == 0x000100, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_390' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_391) == 0x000104, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_391' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_392) == 0x000108, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_392' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_393) == 0x000110, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_393' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000128, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A8, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_Goop_AnimBP.Player_Goop_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x004F (0x0050 - 0x0001)
struct Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_4;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_5;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000050, "Wrong size on Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __ArrayProperty_0) == 0x000008, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__ArrayProperty_0' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000018, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x000019, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x00001A, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __ArrayProperty_4) == 0x000020, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__ArrayProperty_4' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000030, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_6) == 0x000031, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_6' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000032, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000034, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000038, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x00003C, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000040, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000044, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000048, "Member 'Player_Goop_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");

}

