#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_ZipLine_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01EF (0x01F0 - 0x0001)
struct Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_473;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_474;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_475;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_476;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_477;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_478;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_479;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_480;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_481;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_482;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_483;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_484;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_485;                               // 0x0050(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_486;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_487;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_488;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_489;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_490;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_491;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_492;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_493;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_494;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_495;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_496;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_497;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_498;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_499;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_500;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_501;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_502;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_503;                                // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_504;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_505;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_506;                                  // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_507;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_508;                                // 0x00D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_509;                               // 0x00D8(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_510;                                // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_511;                                 // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_512;                              // 0x00F0(0x002C)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_513;                                // 0x011C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_514;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_515;                                 // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_516;                               // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_517;                               // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_518;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_519;                                // 0x0131(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_520;                                // 0x0132(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_521;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_522;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_523;                                 // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_524;                              // 0x0140(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0158(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D8(0x0018)()
};
static_assert(alignof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001F0, "Wrong size on Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_473) == 0x000004, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_473' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_474) == 0x000008, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_474' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_475) == 0x00000C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_475' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_476) == 0x000010, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_476' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_477) == 0x000014, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_477' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_478) == 0x000018, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_478' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_479) == 0x00001C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_479' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_480) == 0x000020, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_480' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_481) == 0x000024, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_481' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_482) == 0x000028, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_482' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_483) == 0x000030, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_483' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_484) == 0x000040, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_484' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_485) == 0x000050, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_485' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_486) == 0x000060, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_486' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_487) == 0x000064, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_487' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_488) == 0x000068, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_488' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_489) == 0x00006C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_489' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_490) == 0x000070, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_490' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_491) == 0x000074, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_491' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_492) == 0x000078, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_492' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_493) == 0x00007C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_493' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_494) == 0x000080, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_494' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_495) == 0x000084, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_495' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_496) == 0x000088, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_496' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_497) == 0x00008C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_497' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_498) == 0x000090, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_498' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_499) == 0x000098, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_499' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_500) == 0x0000A8, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_500' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_501) == 0x0000AC, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_501' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_502) == 0x0000B0, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_502' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_503) == 0x0000B4, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_503' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_504) == 0x0000B8, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_504' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_505) == 0x0000C0, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_505' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_506) == 0x0000C8, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_506' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_507) == 0x0000D0, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_507' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_508) == 0x0000D1, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_508' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_509) == 0x0000D8, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_509' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_510) == 0x0000E8, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_510' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_511) == 0x0000EC, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_511' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_512) == 0x0000F0, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_512' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_513) == 0x00011C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_513' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_514) == 0x000120, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_514' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_515) == 0x000124, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_515' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_516) == 0x000128, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_516' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_517) == 0x00012C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_517' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_518) == 0x000130, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_518' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_519) == 0x000131, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_519' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_520) == 0x000132, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_520' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_521) == 0x000134, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_521' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_522) == 0x000138, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_522' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_523) == 0x00013C, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_523' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_524) == 0x000140, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_524' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000158, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D8, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x006F (0x0070 - 0x0001)
struct Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_4;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_5;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_8;                                 // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_9;                                  // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_10;                                // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_11;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000070, "Wrong size on Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData, __ArrayProperty_0) == 0x000008, "Member 'Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData::__ArrayProperty_0' has a wrong offset!");
