#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_TacticalState_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01D7 (0x01D8 - 0x0001)
struct Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_932;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_933;                               // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_934;                               // 0x0018(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_935;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_936;                                // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_937;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_938;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_939;                                // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_940;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_941;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_942;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_943;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_944;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_945;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_946;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_947;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_948;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_949;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_950;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_951;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_952;                                 // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_953;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_954;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_955;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_956;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_957;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_958;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_959;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_960;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_961;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_962;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_963;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_964;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_965;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_966;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_967;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_968;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_969;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_970;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_971;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_972;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_973;                              // 0x00C0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_974;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_975;                                // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_976;                                // 0x00F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_977;                                // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_978;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_979;                                 // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_980;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_981;                                  // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_982;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_983;                                // 0x0111(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_984;                                // 0x0112(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_985;                               // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_986;                              // 0x0128(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0140(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C0(0x0018)()
};
static_assert(alignof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001D8, "Wrong size on Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_932) == 0x000004, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_932' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_933) == 0x000008, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_933' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_934) == 0x000018, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_934' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_935) == 0x000028, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_935' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_936) == 0x00002C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_936' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_937) == 0x000030, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_937' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_938) == 0x000034, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_938' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_939) == 0x000038, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_939' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_940) == 0x00003C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_940' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_941) == 0x000040, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_941' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_942) == 0x000044, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_942' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_943) == 0x000048, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_943' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_944) == 0x00004C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_944' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_945) == 0x000050, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_945' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_946) == 0x000054, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_946' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_947) == 0x000058, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_947' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_948) == 0x00005C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_948' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_949) == 0x000060, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_949' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_950) == 0x000064, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_950' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_951) == 0x000068, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_951' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_952) == 0x00006C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_952' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_953) == 0x000070, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_953' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_954) == 0x000074, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_954' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_955) == 0x000078, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_955' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_956) == 0x00007C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_956' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_957) == 0x000080, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_957' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_958) == 0x000084, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_958' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_959) == 0x000088, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_959' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_960) == 0x00008C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_960' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_961) == 0x000090, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_961' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_962) == 0x000094, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_962' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_963) == 0x000098, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_963' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_964) == 0x00009C, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_964' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_965) == 0x0000A0, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_965' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_966) == 0x0000A4, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_966' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_967) == 0x0000A8, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_967' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_968) == 0x0000AC, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_968' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_969) == 0x0000B0, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_969' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_970) == 0x0000B4, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_970' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_971) == 0x0000B8, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_971' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_972) == 0x0000BC, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_972' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_973) == 0x0000C0, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_973' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_974) == 0x0000EC, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_974' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_975) == 0x0000F0, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_975' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_976) == 0x0000F1, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_976' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_977) == 0x0000F4, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_977' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_978) == 0x0000F8, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_978' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_979) == 0x0000FC, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_979' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_980) == 0x000100, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_980' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_981) == 0x000108, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_981' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_982) == 0x000110, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_982' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_983) == 0x000111, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_983' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_984) == 0x000112, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_984' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_985) == 0x000118, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_985' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_986) == 0x000128, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_986' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000140, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C0, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0023 (0x0024 - 0x0001)
struct Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x000E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x000F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0016(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0017(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000024, "Wrong size on Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'Player_TacticalState_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
