#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_ZipLine_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Player_ZipLine_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_ZipLine_AnimBP.Player_ZipLine_AnimBP_C
// 0x1AE0 (0x2170 - 0x0690)
class UPlayer_ZipLine_AnimBP_C final : public UFortZiplineAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_ZipLine_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0070)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0708(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0710(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0718(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0738(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x07F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0818(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x08D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x08F8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x09B8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x09D8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x09F8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0A18(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0A38(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0A58(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0A78(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0AC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x0B08(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x0B50(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x0B98(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0BE0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x0C28(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0C70(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0C90(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0CD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0D20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0D68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0DB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0DF8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x0E40(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0E88(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0EA8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0F68(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0F88(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1048(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1068(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1088(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x10A8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x10C8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x10E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1108(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x11C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x11E8(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x12A8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1388(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1448(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1468(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1528(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x15C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x15E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1610(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1658(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x16A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x16E8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x1730(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1778(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x17C0(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x18A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x18E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1930(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1978(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x19C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1A08(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1A28(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1A50(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1AC0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1B88(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1C50(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1C98(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1CB8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1D80(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1DF0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1EB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1ED8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1FA0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2068(0x0100)()
	double                                        PivotAnimBlendTime;                                // 0x2168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_ZipLine_AnimBP(int32 EntryPoint);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_ZipLine_AnimBP_C">();
	}
	static class UPlayer_ZipLine_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_ZipLine_AnimBP_C>();
	}
};
static_assert(alignof(UPlayer_ZipLine_AnimBP_C) == 0x000010, "Wrong alignment on UPlayer_ZipLine_AnimBP_C");
static_assert(sizeof(UPlayer_ZipLine_AnimBP_C) == 0x002170, "Wrong size on UPlayer_ZipLine_AnimBP_C");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UPlayer_ZipLine_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UPlayer_ZipLine_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000708, "Member 'UPlayer_ZipLine_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimBlueprintExtension_Base) == 0x000710, "Member 'UPlayer_ZipLine_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_21) == 0x000718, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x000738, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_20) == 0x0007F8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x000818, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_19) == 0x0008D8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x0008F8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_18) == 0x0009B8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_17) == 0x0009D8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_16) == 0x0009F8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_15) == 0x000A18, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_14) == 0x000A38, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_13) == 0x000A58, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000A78, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000AC0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_16) == 0x000B08, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_15) == 0x000B50, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_14) == 0x000B98, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_13) == 0x000BE0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByEnum_3) == 0x000C28, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByEnum_3' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_12) == 0x000C70, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000C90, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000CD8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_12) == 0x000D20, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x000D68, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x000DB0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x000DF8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByEnum_2) == 0x000E40, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_11) == 0x000E88, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x000EA8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_10) == 0x000F68, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x000F88, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_9) == 0x001048, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_8) == 0x001068, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_7) == 0x001088, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_6) == 0x0010A8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_5) == 0x0010C8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_4) == 0x0010E8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001108, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_3) == 0x0011C8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x0011E8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x0012A8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_2) == 0x001368, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x001388, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root_1) == 0x001448, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001468, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_Root) == 0x001528, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x001548, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x001570, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x001598, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0015C0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0015E8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001610, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x001658, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x0016A0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x0016E8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByEnum_1) == 0x001730, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x001778, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0017C0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0018A0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0018E8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x001930, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001978, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendListByEnum) == 0x0019C0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_StateResult_2) == 0x001A08, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001A28, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001A50, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_ApplyAdditive_2) == 0x001AC0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_ApplyAdditive_1) == 0x001B88, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001C50, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_StateResult_1) == 0x001C98, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedAnimLayer_1) == 0x001CB8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x001D80, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x001DF0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_StateResult) == 0x001EB8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_StateMachine) == 0x001ED8, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_LinkedAnimLayer) == 0x001FA0, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002068, "Member 'UPlayer_ZipLine_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayer_ZipLine_AnimBP_C, PivotAnimBlendTime) == 0x002168, "Member 'UPlayer_ZipLine_AnimBP_C::PivotAnimBlendTime' has a wrong offset!");

}

