#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_TacticalState_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Player_TacticalState_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Player_TacticalState_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Player_TacticalState_AnimBP_C_AnimGraph");
static_assert(sizeof(Player_TacticalState_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Player_TacticalState_AnimBP_C_AnimGraph");
static_assert(offsetof(Player_TacticalState_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Player_TacticalState_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.ExecuteUbergraph_Player_TacticalState_AnimBP
// 0x0160 (0x0160 - 0x0000)
struct Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_4;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_5;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_6;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_7;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_8;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_6;       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_9;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_10;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_7;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_11;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_8;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_12;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_13;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_9;       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_14;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_15;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_16;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_10;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_17;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_11;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_18;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_12;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_19;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_13;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_20;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_14;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_21;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_22;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_15;      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_16;      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_4;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_5;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_6;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_7;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_8;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_9;    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_3;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_10;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_11;   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_12;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_13;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_14;   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_15;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_16;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP) == 0x000008, "Wrong alignment on Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP");
static_assert(sizeof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP) == 0x000160, "Wrong size on Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, EntryPoint) == 0x000000, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_1) == 0x000008, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000D, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_2) == 0x000010, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_3) == 0x000014, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000019, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_4) == 0x00001C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000020, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_5) == 0x000024, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000028, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x000029, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_6) == 0x00002C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_7) == 0x000030, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000034, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_5) == 0x000035, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_8) == 0x000038, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x00003C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_6) == 0x00003D, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_9) == 0x000040, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_10) == 0x000044, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_7) == 0x000048, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000049, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x00004A, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_11) == 0x00004C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x000050, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_8) == 0x000051, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_12) == 0x000054, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_13) == 0x000058, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_9) == 0x00005C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00005D, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x00005E, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_14) == 0x000060, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x000064, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_15) == 0x000068, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_16) == 0x00006C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_10) == 0x000070, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000071, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_6) == 0x000072, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_7) == 0x000073, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_17) == 0x000074, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_11) == 0x000078, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_18) == 0x00007C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_12) == 0x000080, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_19) == 0x000084, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_13) == 0x000088, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_20) == 0x00008C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_8) == 0x000090, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_14) == 0x000091, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_21) == 0x000094, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GetCurveValue_ReturnValue_22) == 0x000098, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GetCurveValue_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_15) == 0x00009C, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_16) == 0x00009D, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_9) == 0x00009E, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_10) == 0x00009F, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_BooleanAND_ReturnValue_11) == 0x0000A0, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0000B8, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x0000C0, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x0000C8, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_4) == 0x0000D0, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000D8, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_5) == 0x0000E0, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_6) == 0x0000E8, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_7) == 0x0000F0, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x0000F8, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_8) == 0x000100, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_9) == 0x000108, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000110, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Less_DoubleDouble_A_ImplicitCast_3) == 0x000118, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Less_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_10) == 0x000120, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000128, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_11) == 0x000130, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_12) == 0x000138, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_13) == 0x000140, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_14) == 0x000148, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_14' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_15) == 0x000150, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_15' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast_16) == 0x000158, "Member 'Player_TacticalState_AnimBP_C_ExecuteUbergraph_Player_TacticalState_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast_16' has a wrong offset!");

// Function Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.TacticalSprintLayer
// 0x0010 (0x0010 - 0x0000)
struct Player_TacticalState_AnimBP_C_TacticalSprintLayer final
{
public:
	struct FPoseLink                              TacticalSprintLayer_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Player_TacticalState_AnimBP_C_TacticalSprintLayer) == 0x000008, "Wrong alignment on Player_TacticalState_AnimBP_C_TacticalSprintLayer");
static_assert(sizeof(Player_TacticalState_AnimBP_C_TacticalSprintLayer) == 0x000010, "Wrong size on Player_TacticalState_AnimBP_C_TacticalSprintLayer");
static_assert(offsetof(Player_TacticalState_AnimBP_C_TacticalSprintLayer, TacticalSprintLayer_0) == 0x000000, "Member 'Player_TacticalState_AnimBP_C_TacticalSprintLayer::TacticalSprintLayer_0' has a wrong offset!");

// Function Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.WeaponBoneFixLayer
// 0x0020 (0x0020 - 0x0000)
struct Player_TacticalState_AnimBP_C_WeaponBoneFixLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              WeaponBoneFixLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Player_TacticalState_AnimBP_C_WeaponBoneFixLayer) == 0x000008, "Wrong alignment on Player_TacticalState_AnimBP_C_WeaponBoneFixLayer");
static_assert(sizeof(Player_TacticalState_AnimBP_C_WeaponBoneFixLayer) == 0x000020, "Wrong size on Player_TacticalState_AnimBP_C_WeaponBoneFixLayer");
static_assert(offsetof(Player_TacticalState_AnimBP_C_WeaponBoneFixLayer, InPose) == 0x000000, "Member 'Player_TacticalState_AnimBP_C_WeaponBoneFixLayer::InPose' has a wrong offset!");
static_assert(offsetof(Player_TacticalState_AnimBP_C_WeaponBoneFixLayer, WeaponBoneFixLayer_0) == 0x000010, "Member 'Player_TacticalState_AnimBP_C_WeaponBoneFixLayer::WeaponBoneFixLayer_0' has a wrong offset!");

}

