#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_DBNO_AnimBP

#include "Basic.hpp"

#include "Player_DBNO_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_DBNO_AnimBP.Player_DBNO_AnimBP_C
// 0x08D0 (0x0D30 - 0x0460)
class UPlayer_DBNO_AnimBP_C final : public UFortDBNOAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0468(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0480(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0488(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0490(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x05A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x05C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x05F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0618(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0640(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0688(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x06A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x06F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0710(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0758(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0778(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0808(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0850(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0870(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0898(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0960(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0A28(0x0070)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0A98(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0BC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0BE0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C00(0x0128)()
	bool                                          AdjustLargeBody;                                   // 0x0D28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_DBNO_AnimBP_AnimGraphNode_ModifyBone_5F4823B441208B2FBDD3F9A03D4F08DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_DBNO_AnimBP_AnimGraphNode_ModifyBone_F28F19494706BFB6D2F74181D211D9E5();
	void ExecuteUbergraph_Player_DBNO_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_DBNO_AnimBP_C">();
	}
	static class UPlayer_DBNO_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_DBNO_AnimBP_C>();
	}
};
static_assert(alignof(UPlayer_DBNO_AnimBP_C) == 0x000010, "Wrong alignment on UPlayer_DBNO_AnimBP_C");
static_assert(sizeof(UPlayer_DBNO_AnimBP_C) == 0x000D30, "Wrong size on UPlayer_DBNO_AnimBP_C");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, UberGraphFrame) == 0x000460, "Member 'UPlayer_DBNO_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, __AnimBlueprintMutables) == 0x000468, "Member 'UPlayer_DBNO_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000480, "Member 'UPlayer_DBNO_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimBlueprintExtension_Base) == 0x000488, "Member 'UPlayer_DBNO_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_Root) == 0x000490, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x0004B0, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x0004D8, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000500, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000528, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000550, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000578, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x0005A0, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x0005C8, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0005F0, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000618, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000640, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_StateResult_4) == 0x000688, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0006A8, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_StateResult_3) == 0x0006F0, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000710, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_StateResult_2) == 0x000758, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000778, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0007E8, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000808, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_StateResult) == 0x000850, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000870, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_StateMachine) == 0x000898, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_ApplyAdditive) == 0x000960, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000A28, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000A98, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000BC0, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000BE0, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000C00, "Member 'UPlayer_DBNO_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UPlayer_DBNO_AnimBP_C, AdjustLargeBody) == 0x000D28, "Member 'UPlayer_DBNO_AnimBP_C::AdjustLargeBody' has a wrong offset!");

}

