#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerVisited

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerVisited.PlayerVisited_C
// 0x00B8 (0x04C0 - 0x0408)
class UPlayerVisited_C final : public UAthenaVisitedAreaDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BriefShow;                                         // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_landmarkorPOI;                // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainBox;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MainLocationText;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Underlay;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_LandmarkState;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_POIState;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           BriefShowFallbackTimerHandle;                      // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   LastLocationVisited;                               // 0x0458(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeLastLocationVisited;                           // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocationVisitedCooldown;                           // 0x0478(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               Discovered_Sound_Cue;                              // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Is_Discovered;                                     // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             POI_Discover_Sound;                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Landmark_Sound;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandlePlaylistExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);
	void Brief_Show_Finished();
	void Construct();
	void EndOfShow();
	void ExecuteUbergraph_PlayerVisited(int32 EntryPoint);
	void K2_OnBecomeActive();
	void OnAnimBackupTimerFinished();
	void OnLoaded_1A6A75E74CBAB07F2A7CEEBF59AD1562(class UObject* Loaded);
	void OnNewVisited(const class FText& LocalizedLocationName, const TSoftObjectPtr<class USoundCue>& DiscoveredSoundCue, bool bIsNamedLocation, bool bIsDiscovered);
	void OnStompFailed();
	void Play_Brief_Show_Sound();
	void SetMobileVisuals();
	void SetPOIMusic(class USoundBase* Asset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerVisited_C">();
	}
	static class UPlayerVisited_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerVisited_C>();
	}
};
static_assert(alignof(UPlayerVisited_C) == 0x000008, "Wrong alignment on UPlayerVisited_C");
static_assert(sizeof(UPlayerVisited_C) == 0x0004C0, "Wrong size on UPlayerVisited_C");
static_assert(offsetof(UPlayerVisited_C, UberGraphFrame) == 0x000408, "Member 'UPlayerVisited_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, BriefShow) == 0x000410, "Member 'UPlayerVisited_C::BriefShow' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, CommonWidgetSwitcher_landmarkorPOI) == 0x000418, "Member 'UPlayerVisited_C::CommonWidgetSwitcher_landmarkorPOI' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, MainBox) == 0x000420, "Member 'UPlayerVisited_C::MainBox' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, MainLocationText) == 0x000428, "Member 'UPlayerVisited_C::MainLocationText' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Overlay_Main) == 0x000430, "Member 'UPlayerVisited_C::Overlay_Main' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Overlay_Underlay) == 0x000438, "Member 'UPlayerVisited_C::Overlay_Underlay' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Text_LandmarkState) == 0x000440, "Member 'UPlayerVisited_C::Text_LandmarkState' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Text_POIState) == 0x000448, "Member 'UPlayerVisited_C::Text_POIState' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, BriefShowFallbackTimerHandle) == 0x000450, "Member 'UPlayerVisited_C::BriefShowFallbackTimerHandle' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, LastLocationVisited) == 0x000458, "Member 'UPlayerVisited_C::LastLocationVisited' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, TimeLastLocationVisited) == 0x000470, "Member 'UPlayerVisited_C::TimeLastLocationVisited' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, LocationVisitedCooldown) == 0x000478, "Member 'UPlayerVisited_C::LocationVisitedCooldown' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Discovered_Sound_Cue) == 0x000480, "Member 'UPlayerVisited_C::Discovered_Sound_Cue' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Is_Discovered) == 0x0004A8, "Member 'UPlayerVisited_C::Is_Discovered' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, POI_Discover_Sound) == 0x0004B0, "Member 'UPlayerVisited_C::POI_Discover_Sound' has a wrong offset!");
static_assert(offsetof(UPlayerVisited_C, Landmark_Sound) == 0x0004B8, "Member 'UPlayerVisited_C::Landmark_Sound' has a wrong offset!");

}

