#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_ProceduralAdjustments_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01AF (0x01B0 - 0x0001)
struct Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_653;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_654;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_655;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_656;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_657;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_658;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_659;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_660;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_661;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_662;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_663;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_664;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_665;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_666;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_667;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_668;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_669;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_670;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_671;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_672;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_673;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_674;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_675;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_676;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_677;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_678;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_679;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_680;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_681;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_682;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_683;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_684;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_685;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_686;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_687;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_688;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_689;                               // 0x00B8(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_690;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_691;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_692;                                  // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_693;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_694;                                // 0x00E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_695;                                // 0x00EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_696;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_697;                              // 0x0100(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0118(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0198(0x0018)()
};
static_assert(alignof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001B0, "Wrong size on Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_653) == 0x000004, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_653' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_654) == 0x000008, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_654' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_655) == 0x00000C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_655' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_656) == 0x000010, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_656' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_657) == 0x000014, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_657' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_658) == 0x000018, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_658' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_659) == 0x00001C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_659' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_660) == 0x000020, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_660' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_661) == 0x000024, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_661' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_662) == 0x000028, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_662' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_663) == 0x00002C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_663' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_664) == 0x000030, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_664' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_665) == 0x000034, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_665' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_666) == 0x000038, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_666' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_667) == 0x00003C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_667' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_668) == 0x000040, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_668' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_669) == 0x000044, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_669' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_670) == 0x000048, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_670' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_671) == 0x00004C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_671' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_672) == 0x000050, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_672' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_673) == 0x000054, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_673' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_674) == 0x000058, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_674' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_675) == 0x00005C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_675' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_676) == 0x000060, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_676' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_677) == 0x000064, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_677' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_678) == 0x000068, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_678' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_679) == 0x00006C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_679' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_680) == 0x000070, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_680' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_681) == 0x000078, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_681' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_682) == 0x000088, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_682' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_683) == 0x00008C, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_683' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_684) == 0x000090, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_684' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_685) == 0x000098, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_685' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_686) == 0x0000A8, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_686' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_687) == 0x0000AC, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_687' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_688) == 0x0000B0, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_688' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_689) == 0x0000B8, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_689' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_690) == 0x0000C8, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_690' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_691) == 0x0000D8, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_691' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_692) == 0x0000E0, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_692' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_693) == 0x0000E8, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_693' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_694) == 0x0000E9, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_694' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_695) == 0x0000EA, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_695' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_696) == 0x0000F0, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_696' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_697) == 0x000100, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_697' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000118, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000198, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_ProceduralAdjustments_AnimBP.Player_ProceduralAdjustments_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x000A (0x000B - 0x0001)
struct Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0007(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x000A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00000B, "Wrong size on Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000005, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x000006, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000007, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __ByteProperty_6) == 0x000008, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__ByteProperty_6' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000009, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x00000A, "Member 'Player_ProceduralAdjustments_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");

}

