#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerRiderComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerRiderComponent.PlayerRiderComponent_C.EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6
// 0x00B0 (0x00B0 - 0x0000)
struct PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6) == 0x000008, "Wrong alignment on PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6");
static_assert(sizeof(PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6) == 0x0000B0, "Wrong size on PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6");
static_assert(offsetof(PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6, Payload) == 0x000000, "Member 'PlayerRiderComponent_C_EventReceived_3DA19BC649FB853BA2CC0FADFF8D08F6::Payload' has a wrong offset!");

// Function PlayerRiderComponent.PlayerRiderComponent_C.EventReceived_E5B5FB5340DB5660002329825657B406
// 0x00B0 (0x00B0 - 0x0000)
struct PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406) == 0x000008, "Wrong alignment on PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406");
static_assert(sizeof(PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406) == 0x0000B0, "Wrong size on PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406");
static_assert(offsetof(PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406, Payload) == 0x000000, "Member 'PlayerRiderComponent_C_EventReceived_E5B5FB5340DB5660002329825657B406::Payload' has a wrong offset!");

// Function PlayerRiderComponent.PlayerRiderComponent_C.ExecuteUbergraph_PlayerRiderComponent
// 0x09B0 (0x09B0 - 0x0000)
struct PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URidableComponent*                      K2Node_Event_Ridable_1;                            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URidableComponent*                      K2Node_Event_Ridable;                              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue; // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00D0(0x00B0)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_TargetObject;                   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UseAltRidingMessage;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRidingGeneric_Interafce_C> K2Node_DynamicCast_AsRiding_Generic_Interafce;     // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleRiding_bChangedRiding;              // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x01D8(0x00B0)()
	double                                        K2Node_CustomEvent_targetHealth;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0290(0x0018)()
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_CustomEvent_Icon;                           // 0x02B0(0x00C0)()
	class AActor*                                 K2Node_CustomEvent_Ridable_1;                      // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Ridable;                        // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopRidingActor_ReturnValue;              // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0390(0x00B0)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0440(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopRidingActor_ReturnValue_1;            // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue;     // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue_1;   // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x051A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51B[0x1];                                      // 0x051B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x051C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_8;                   // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0530(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_1;  // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0560(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_9;                   // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0650(0x00D0)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_10;                  // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72B[0x5];                                      // 0x072B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_11;                  // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreatureBaseRidableComponent_C*        K2Node_DynamicCast_AsCreature_Base_Ridable_Component; // 0x0748(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_12;                  // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_1;               // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRidingActor_ReturnValue;                // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0762(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0763(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBePet_ReturnValue;                     // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_765[0x3];                                      // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_13;                  // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0778(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_14;                  // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x078C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0798(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x07A0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x07B0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0890(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0899(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89A[0x2];                                      // 0x089A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A4[0x4];                                      // 0x08A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x08A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x08C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x08D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x08F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0908(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0910(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0918(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x092C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0938(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0950(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestIfValidForRidingAttempt_Success;      // 0x0969(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96A[0x6];                                      // 0x096A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_TestIfValidForRidingAttempt_TargetObject; // 0x0970(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestIfValidForRidingAttempt_UseAltRidingMessage; // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x7];                                      // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0980(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_15;                  // 0x0988(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_2;  // 0x0998(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent) == 0x000010, "Wrong alignment on PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent");
static_assert(sizeof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent) == 0x0009B0, "Wrong size on PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, EntryPoint) == 0x000000, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_HasAuthority_ReturnValue) == 0x000029, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_HasAuthority_ReturnValue_1) == 0x000044, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000058, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_HasAuthority_ReturnValue_2) == 0x000061, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_Event_Ridable_1) == 0x000068, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_Event_Ridable_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_Event_Ridable) == 0x000070, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_Event_Ridable' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_3) == 0x000078, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_4) == 0x000080, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsFort_Pawn) == 0x000088, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsFort_Pawn_1) == 0x000098, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_5) == 0x0000A8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetLocalRole_ReturnValue) == 0x0000B0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x0000B8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue) == 0x0000C4, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BP_FortApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, Temp_struct_Variable) == 0x0000D0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_6) == 0x000180, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000188, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000190, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_TargetObject) == 0x0001A0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_TargetObject' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_UseAltRidingMessage) == 0x0001A8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_UseAltRidingMessage' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsRiding_Generic_Interafce) == 0x0001B0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsRiding_Generic_Interafce' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess_3) == 0x0001C0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsActor) == 0x0001C8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess_4) == 0x0001D0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_ToggleRiding_bChangedRiding) == 0x0001D1, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_ToggleRiding_bChangedRiding' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, Temp_struct_Variable_1) == 0x0001D8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_targetHealth) == 0x000288, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_targetHealth' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Name) == 0x000290, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Icon) == 0x0002B0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Ridable_1) == 0x000370, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Ridable_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Ridable) == 0x000378, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Ridable' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Character) == 0x000380, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_PrevMovementMode) == 0x000388, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_PreviousCustomMode) == 0x000389, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_PreviousCustomMode' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_StopRidingActor_ReturnValue) == 0x00038A, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_StopRidingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_2) == 0x00038B, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Payload) == 0x000390, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Payload_1) == 0x000440, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_3) == 0x0004F0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_7) == 0x0004F8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_StopRidingActor_ReturnValue_1) == 0x000500, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_StopRidingActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_WaitGameplayEventToActor_ReturnValue) == 0x000508, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_WaitGameplayEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_WaitGameplayEventToActor_ReturnValue_1) == 0x000510, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_WaitGameplayEventToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_4) == 0x000518, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_5) == 0x000519, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, Temp_bool_Has_Been_Initd_Variable) == 0x00051A, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x00051C, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_8) == 0x000528, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000530, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x000540, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_6) == 0x000548, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_WaitGameplayTagAddToActor_ReturnValue_1) == 0x000550, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_WaitGameplayTagAddToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_7) == 0x000558, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CustomEvent_Hit) == 0x000560, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_9) == 0x000640, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, Temp_bool_IsClosed_Variable) == 0x000648, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000650, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_10) == 0x000720, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_8) == 0x000728, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_9) == 0x000729, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_HasAuthority_ReturnValue_3) == 0x00072A, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_11) == 0x000730, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsFort_Pawn_2) == 0x000738, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsFort_Pawn_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess_5) == 0x000740, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_AsCreature_Base_Ridable_Component) == 0x000748, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_AsCreature_Base_Ridable_Component' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_DynamicCast_bSuccess_6) == 0x000750, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_12) == 0x000758, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetLocalRole_ReturnValue_1) == 0x000760, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetLocalRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsRidingActor_ReturnValue) == 0x000761, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsRidingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000762, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_10) == 0x000763, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_CanBePet_ReturnValue) == 0x000764, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_CanBePet_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_13) == 0x000768, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_11) == 0x000770, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000778, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetOwner_ReturnValue_14) == 0x000780, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetOwner_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_IsValid_ReturnValue_12) == 0x000788, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00078C, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetFortAbilitySystemComponent_ReturnValue_2) == 0x000798, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetFortAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_CreateDelegate_OutputDelegate_6) == 0x0007A0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, K2Node_Event_HitResult) == 0x0007B0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000890, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_bBlockingHit) == 0x000898, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_bInitialOverlap) == 0x000899, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_Time) == 0x00089C, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_Distance) == 0x0008A0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_Location) == 0x0008A8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_ImpactPoint) == 0x0008C0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_Normal) == 0x0008D8, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_ImpactNormal) == 0x0008F0, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_PhysMat) == 0x000908, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_HitActor) == 0x000910, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_HitComponent) == 0x000918, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_HitBoneName) == 0x000920, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_BoneName) == 0x000924, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_HitItem) == 0x000928, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_ElementIndex) == 0x00092C, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_FaceIndex) == 0x000930, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent, CallFunc_BreakHitResult_TraceStart) == 0x000938, "Member 'PlayerRiderComponent_C_ExecuteUbergraph_PlayerRiderComponent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
