#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUIDirector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DynamicUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerAugmentsUIDirector.PlayerAugmentsUIDirector_C
// 0x0038 (0x02F0 - 0x02B8)
class APlayerAugmentsUIDirector_C final : public ADynamicUIDirectorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x02C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_PlayerAugmentsUIDirector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerAugmentsUIDirector_C">();
	}
	static class APlayerAugmentsUIDirector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerAugmentsUIDirector_C>();
	}
};
static_assert(alignof(APlayerAugmentsUIDirector_C) == 0x000008, "Wrong alignment on APlayerAugmentsUIDirector_C");
static_assert(sizeof(APlayerAugmentsUIDirector_C) == 0x0002F0, "Wrong size on APlayerAugmentsUIDirector_C");
static_assert(offsetof(APlayerAugmentsUIDirector_C, UberGraphFrame) == 0x0002B8, "Member 'APlayerAugmentsUIDirector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, DefaultSceneRoot) == 0x0002C0, "Member 'APlayerAugmentsUIDirector_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, AugmentsEnabledViaHotfix) == 0x0002C8, "Member 'APlayerAugmentsUIDirector_C::AugmentsEnabledViaHotfix' has a wrong offset!");

}

