#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_LocomotionPrototype_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Player_LocomotionPrototype_AnimBP.Player_LocomotionPrototype_AnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionPrototype_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Player_LocomotionPrototype_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Player_LocomotionPrototype_AnimBP_C_AnimGraph");
static_assert(sizeof(Player_LocomotionPrototype_AnimBP_C_AnimGraph) == 0x000020, "Wrong size on Player_LocomotionPrototype_AnimBP_C_AnimGraph");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'Player_LocomotionPrototype_AnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'Player_LocomotionPrototype_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Player_LocomotionPrototype_AnimBP.Player_LocomotionPrototype_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Player_LocomotionPrototype_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Player_LocomotionPrototype_AnimBP.Player_LocomotionPrototype_AnimBP_C.ExecuteUbergraph_Player_LocomotionPrototype_AnimBP
// 0x0268 (0x0268 - 0x0000)
struct Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_4;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_5;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_16;                 // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_17;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_18;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_19;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_20;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_21;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_22;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_23;                 // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_24;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_25;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_26;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_27;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_6;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_28;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_29;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_7;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_8;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_9;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_10;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_11;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_12;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_4;  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_13;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_5;  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_6;       // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_14;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_15;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_7;       // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_8;       // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_16;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_6;  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_17;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_18;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_7;  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_19;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_9;       // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_8;  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_9;  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_10; // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_20;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_11; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_21;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_10;      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_22;             // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_23;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_11;      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_12;      // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_24;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_25;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_13;      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_14;      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_30;                 // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_4;    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_5;    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_2; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_3; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_4; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_5; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_6;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_7;    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_8;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_6; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_3;       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_7; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_9;    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_8; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_9; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_10; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_0_ImplicitCast; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast_1;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast_1;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_11; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_10;   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_11;   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_12;   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_13;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_14;   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP) == 0x000008, "Wrong alignment on Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP");
static_assert(sizeof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP) == 0x000268, "Wrong size on Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, EntryPoint) == 0x000000, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue) == 0x000008, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x00000C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000D, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_2) == 0x00000E, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_3) == 0x00000F, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_4) == 0x000010, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_1) == 0x000014, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_5) == 0x000018, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000019, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00001C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_2) == 0x000020, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_6) == 0x000024, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000025, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_7) == 0x000026, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_8) == 0x000027, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000029, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_3) == 0x00002C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000030, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000031, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_4) == 0x000034, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_5) == 0x000038, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x00003C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x00003D, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x00003E, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x00003F, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x000040, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_9) == 0x000041, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000042, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_10) == 0x000043, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_11) == 0x000044, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000045, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000046, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_6) == 0x000047, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_12) == 0x000048, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x000049, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_13) == 0x00004A, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_7) == 0x00004B, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_14) == 0x00004C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_15) == 0x00004D, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_16) == 0x00004E, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_8) == 0x00004F, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_17) == 0x000050, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_18) == 0x000051, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_19) == 0x000052, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_20) == 0x000053, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_21) == 0x000054, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_22) == 0x000055, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_23) == 0x000056, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_24) == 0x000057, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_25) == 0x000058, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_26) == 0x000059, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_27) == 0x00005A, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_6) == 0x00005C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_28) == 0x000060, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000061, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanOR_ReturnValue_29) == 0x000062, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanOR_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_7) == 0x000064, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue_5) == 0x000068, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_9) == 0x000069, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_Not_PreBool_ReturnValue_6) == 0x00006A, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_8) == 0x00006C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_10) == 0x000071, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_9) == 0x000074, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000078, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_BooleanAND_ReturnValue_11) == 0x000079, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP, CallFunc_GetCurveValue_ReturnValue_10) == 0x00007C, "Member 'Player_LocomotionPrototype_AnimBP_C_ExecuteUbergraph_Player_LocomotionPrototype_AnimBP::CallFunc_GetCurveValue_ReturnValue_10' has a wrong offset!");
