#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_LocomotionAdditives_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x02EF (0x02F0 - 0x0001)
struct Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1072;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1073;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1074;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1075;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1076;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1077;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1078;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1079;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1080;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1081;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1082;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1083;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1084;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1085;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1086;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1087;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1088;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1089;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1090;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1091;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1092;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1093;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1094;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1095;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1096;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1097;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1098;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1099;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1100;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1101;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1102;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1103;                              // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1104;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1105;                              // 0x00A0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1106;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1107;                              // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_1108;                               // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1109;                              // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1110;                              // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1111;                              // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1112;                              // 0x0100(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1113;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1114;                              // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1115;                               // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1116;                              // 0x0130(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1117;                              // 0x0140(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1118;                               // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1119;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1120;                                // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1121;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1122;                                // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1123;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1124;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1125;                                // 0x016C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1126;                              // 0x0170(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1127;                              // 0x0180(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1128;                               // 0x0190(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1129;                               // 0x0194(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1130;                                // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_1131;                              // 0x01A0(0x0010)(BlueprintVisible)
	EAnimSyncMethod                               __EnumProperty_1132;                               // 0x01B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1133;                               // 0x01B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1134;                               // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1135;                               // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1136;                                // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1137;                               // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1138;                               // 0x01C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1139;                               // 0x01C5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1140;                              // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1141;                             // 0x01CC(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1142;                              // 0x01F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1143;                               // 0x01FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1144;                               // 0x01FD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1145;                               // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1146;                                 // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1147;                               // 0x0210(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1148;                               // 0x0211(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1149;                               // 0x0212(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1150;                              // 0x0218(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1151;                               // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1152;                               // 0x022C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1153;                                // 0x0230(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1154;                               // 0x0234(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1155;                               // 0x0238(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1156;                                // 0x023C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1157;                             // 0x0240(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0258(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02D8(0x0018)()
};
static_assert(alignof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0002F0, "Wrong size on Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1072) == 0x000004, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1072' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1073) == 0x000008, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1073' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1074) == 0x00000C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1074' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1075) == 0x000010, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1075' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1076) == 0x000014, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1076' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1077) == 0x000018, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1077' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1078) == 0x00001C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1078' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1079) == 0x000020, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1079' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1080) == 0x000024, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1080' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1081) == 0x000028, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1081' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1082) == 0x00002C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1082' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1083) == 0x000030, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1083' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1084) == 0x000034, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1084' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1085) == 0x000038, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1085' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1086) == 0x00003C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1086' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1087) == 0x000040, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1087' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1088) == 0x000044, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1088' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1089) == 0x000048, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1089' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1090) == 0x00004C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1090' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1091) == 0x000050, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1091' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1092) == 0x000054, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1092' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1093) == 0x000058, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1093' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1094) == 0x00005C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1094' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1095) == 0x000060, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1095' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1096) == 0x000064, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1096' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1097) == 0x000068, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1097' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1098) == 0x00006C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1098' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1099) == 0x000070, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1099' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1100) == 0x000074, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1100' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1101) == 0x000078, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1101' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1102) == 0x00007C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1102' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1103) == 0x000080, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1103' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1104) == 0x000090, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1104' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1105) == 0x0000A0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1105' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1106) == 0x0000B0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1106' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1107) == 0x0000B8, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1107' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1108) == 0x0000C8, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1108' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1109) == 0x0000D0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1109' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1110) == 0x0000E0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1110' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1111) == 0x0000F0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1111' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1112) == 0x000100, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1112' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1113) == 0x000110, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1113' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1114) == 0x000118, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1114' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1115) == 0x000128, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1115' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1116) == 0x000130, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1116' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1117) == 0x000140, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1117' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1118) == 0x000150, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1118' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1119) == 0x000154, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1119' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1120) == 0x000158, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1120' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1121) == 0x00015C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1121' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1122) == 0x000160, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1122' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1123) == 0x000164, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1123' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1124) == 0x000168, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1124' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1125) == 0x00016C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1125' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1126) == 0x000170, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1126' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1127) == 0x000180, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1127' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1128) == 0x000190, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1128' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1129) == 0x000194, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1129' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1130) == 0x000198, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1130' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1131) == 0x0001A0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1131' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1132) == 0x0001B0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1132' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1133) == 0x0001B1, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1133' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1134) == 0x0001B4, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1134' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1135) == 0x0001B8, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1135' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1136) == 0x0001BC, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1136' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1137) == 0x0001C0, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1137' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1138) == 0x0001C4, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1138' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1139) == 0x0001C5, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1139' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1140) == 0x0001C8, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1140' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1141) == 0x0001CC, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1141' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1142) == 0x0001F8, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1142' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1143) == 0x0001FC, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1143' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1144) == 0x0001FD, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1144' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1145) == 0x000200, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1145' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1146) == 0x000208, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1146' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1147) == 0x000210, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1147' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1148) == 0x000211, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1148' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1149) == 0x000212, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1149' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1150) == 0x000218, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1150' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1151) == 0x000228, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1151' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1152) == 0x00022C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1152' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1153) == 0x000230, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1153' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1154) == 0x000234, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1154' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1155) == 0x000238, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1155' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1156) == 0x00023C, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1156' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1157) == 0x000240, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1157' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000258, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002D8, "Member 'Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x01A7 (0x01A8 - 0x0001)
struct Player_LocomotionAdditives_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x001D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_7;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0054(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_25;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_28;                                 // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_29;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_33;                                 // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_34;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_40;                                 // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_41;                                 // 0x00A5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_42;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_43;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_44;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_45;                                 // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_46;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_48;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_49;                                 // 0x00C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_50;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_51;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_52;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_53;                                 // 0x00D4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_54;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_55;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_56;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_57;                                 // 0x00E4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_58;                                // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_59;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_60;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_61;                                // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_62;                                 // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_63;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_64;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_65;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_66;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_67;                                // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_68;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_69;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_70;                                 // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_71;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_72;                                // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_73;                                 // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_74;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_75;                                // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
