#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_InAir_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0207 (0x0208 - 0x0001)
struct Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_838;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_839;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_840;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_841;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_842;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_843;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_844;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_845;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_846;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_847;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_848;                               // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_849;                               // 0x0060(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_850;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_851;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_852;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_853;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_854;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_855;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_856;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_857;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_858;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_859;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_860;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_861;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_862;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_863;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_864;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_865;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_866;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_867;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_868;                                 // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_869;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_870;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_871;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_872;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	EBlendListTransitionType                      __EnumProperty_873;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_874;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_875;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_876;                                 // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_877;                               // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_878;                              // 0x00E8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_879;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_880;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_881;                                // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_882;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_883;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_884;                                 // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_885;                                // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_886;                                // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_887;                                  // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_888;                                // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_889;                                // 0x0141(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_890;                                // 0x0142(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_891;                               // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_892;                              // 0x0158(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0170(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01F0(0x0018)()
};
static_assert(alignof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000208, "Wrong size on Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_838) == 0x000004, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_838' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_839) == 0x000008, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_839' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_840) == 0x00000C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_840' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_841) == 0x000010, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_841' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_842) == 0x000014, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_842' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_843) == 0x000018, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_843' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_844) == 0x00001C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_844' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_845) == 0x000020, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_845' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_846) == 0x000030, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_846' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_847) == 0x000040, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_847' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_848) == 0x000050, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_848' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_849) == 0x000060, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_849' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_850) == 0x000070, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_850' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_851) == 0x000074, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_851' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_852) == 0x000078, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_852' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_853) == 0x00007C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_853' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_854) == 0x000080, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_854' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_855) == 0x000084, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_855' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_856) == 0x000088, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_856' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_857) == 0x00008C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_857' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_858) == 0x000090, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_858' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_859) == 0x000094, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_859' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_860) == 0x000098, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_860' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_861) == 0x00009C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_861' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_862) == 0x0000A0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_862' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_863) == 0x0000A4, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_863' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_864) == 0x0000A8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_864' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_865) == 0x0000AC, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_865' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_866) == 0x0000B0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_866' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_867) == 0x0000B4, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_867' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_868) == 0x0000B8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_868' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_869) == 0x0000BC, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_869' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_870) == 0x0000C0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_870' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_871) == 0x0000C4, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_871' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_872) == 0x0000C8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_872' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_873) == 0x0000D8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_873' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_874) == 0x0000D9, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_874' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_875) == 0x0000DC, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_875' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_876) == 0x0000E0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_876' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_877) == 0x0000E4, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_877' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_878) == 0x0000E8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_878' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_879) == 0x000114, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_879' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_880) == 0x000118, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_880' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_881) == 0x000119, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_881' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_882) == 0x00011C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_882' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_883) == 0x000120, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_883' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_884) == 0x000124, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_884' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_885) == 0x000128, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_885' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_886) == 0x000130, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_886' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_887) == 0x000138, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_887' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_888) == 0x000140, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_888' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_889) == 0x000141, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_889' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_890) == 0x000142, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_890' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_891) == 0x000148, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_891' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_892) == 0x000158, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_892' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000170, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001F0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0087 (0x0088 - 0x0001)
struct Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_4;                                  // 0x001B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_6;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_7;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_10;                                 // 0x0033(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_17;                                // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_18;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_19;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_23;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_24;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_25;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_26;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000088, "Wrong size on Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData, __ArrayProperty_0) == 0x000008, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedMutableData::__ArrayProperty_0' has a wrong offset!");
