#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Sprint_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0157 (0x0158 - 0x0001)
struct Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_256;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_257;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_258;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_259;                                // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_260;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_261;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_262;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_263;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_264;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_265;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_266;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_267;                                // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_268;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_269;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_270;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_271;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_272;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_273;                                  // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_274;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_275;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_276;                                // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_277;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_278;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_279;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_280;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_281;                              // 0x00A8(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
};
static_assert(alignof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000158, "Wrong size on Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_256) == 0x000004, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_256' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_257) == 0x000008, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_257' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_258) == 0x00000C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_258' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_259) == 0x000010, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_259' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_260) == 0x000018, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_260' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_261) == 0x000028, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_261' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_262) == 0x00002C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_262' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_263) == 0x000030, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_263' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_264) == 0x00005C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_264' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_265) == 0x000060, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_265' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_266) == 0x000061, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_266' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_267) == 0x000062, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_267' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_268) == 0x000064, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_268' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_269) == 0x000068, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_269' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_270) == 0x000069, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_270' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_271) == 0x00006C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_271' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_272) == 0x000070, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_272' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_273) == 0x000078, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_273' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_274) == 0x000080, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_274' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_275) == 0x000081, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_275' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_276) == 0x000082, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_276' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_277) == 0x000088, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_277' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_278) == 0x000098, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_278' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_279) == 0x00009C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_279' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_280) == 0x0000A0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_280' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_281) == 0x0000A8, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_281' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x002B (0x002C - 0x0001)
struct Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00002C, "Wrong size on Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000D, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x000014, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000015, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000018, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x00001C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000020, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000024, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_10) == 0x000028, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_10' has a wrong offset!");

}

