#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_LowerBodyJog_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x02EF (0x02F0 - 0x0001)
struct Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_852;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_853;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_854;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_855;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_856;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_857;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_858;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_859;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_860;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_861;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_862;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_863;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_864;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_865;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_866;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_867;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_868;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_869;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_870;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_871;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_872;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_873;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_874;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_875;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_876;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_877;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_878;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_879;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_880;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_881;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_882;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_883;                                // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_884;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_885;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_886;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_887;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_888;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_889;                                 // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_890;                               // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_891;                               // 0x00D0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_892;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_893;                                // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_894;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_895;                              // 0x00EC(0x002C)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_896;                              // 0x0118(0x002C)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_897;                              // 0x0144(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_898;                                // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_899;                                // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_900;                                 // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_901;                              // 0x017C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_902;                               // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_903;                                // 0x01AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_904;                                // 0x01AD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_905;                                // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_906;                                 // 0x01B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_907;                                // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_908;                                 // 0x01BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_909;                                // 0x01C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_910;                               // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_911;                                // 0x01C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_912;                                // 0x01C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_913;                                // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_914;                                // 0x01D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_915;                               // 0x01D8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_916;                               // 0x01E8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_917;                               // 0x01F8(0x0010)(BlueprintVisible)
	class UBlendProfile*                          __BlendProfile_918;                                // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_919;                                  // 0x0210(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_920;                                // 0x0218(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_921;                                // 0x0219(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_922;                                // 0x021A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B[0x5];                                      // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_923;                               // 0x0220(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_924;                                // 0x0230(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_925;                                // 0x0234(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_926;                                 // 0x0238(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_927;                              // 0x0240(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0258(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02D8(0x0018)()
};
static_assert(alignof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0002F0, "Wrong size on Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_852) == 0x000004, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_852' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_853) == 0x000008, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_853' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_854) == 0x00000C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_854' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_855) == 0x000010, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_855' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_856) == 0x000014, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_856' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_857) == 0x000018, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_857' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_858) == 0x00001C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_858' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_859) == 0x000020, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_859' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_860) == 0x000024, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_860' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_861) == 0x000028, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_861' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_862) == 0x00002C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_862' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_863) == 0x000030, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_863' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_864) == 0x000034, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_864' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_865) == 0x000038, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_865' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_866) == 0x00003C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_866' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_867) == 0x000040, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_867' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_868) == 0x000044, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_868' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_869) == 0x000048, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_869' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_870) == 0x00004C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_870' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_871) == 0x000050, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_871' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_872) == 0x000054, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_872' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_873) == 0x000058, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_873' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_874) == 0x00005C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_874' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_875) == 0x000060, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_875' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_876) == 0x000064, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_876' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_877) == 0x000068, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_877' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_878) == 0x000078, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_878' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_879) == 0x000088, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_879' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_880) == 0x000098, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_880' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_881) == 0x00009C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_881' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_882) == 0x0000A0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_882' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_883) == 0x0000A4, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_883' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_884) == 0x0000A8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_884' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_885) == 0x0000AC, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_885' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_886) == 0x0000B0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_886' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_887) == 0x0000B4, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_887' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_888) == 0x0000B8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_888' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_889) == 0x0000BC, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_889' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_890) == 0x0000C0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_890' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_891) == 0x0000D0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_891' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_892) == 0x0000E0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_892' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_893) == 0x0000E4, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_893' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_894) == 0x0000E8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_894' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_895) == 0x0000EC, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_895' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_896) == 0x000118, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_896' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_897) == 0x000144, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_897' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_898) == 0x000170, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_898' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_899) == 0x000174, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_899' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_900) == 0x000178, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_900' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_901) == 0x00017C, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_901' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_902) == 0x0001A8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_902' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_903) == 0x0001AC, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_903' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_904) == 0x0001AD, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_904' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_905) == 0x0001B0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_905' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_906) == 0x0001B4, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_906' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_907) == 0x0001B8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_907' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_908) == 0x0001BC, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_908' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_909) == 0x0001C0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_909' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_910) == 0x0001C4, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_910' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_911) == 0x0001C8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_911' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_912) == 0x0001C9, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_912' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_913) == 0x0001CC, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_913' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_914) == 0x0001D0, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_914' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_915) == 0x0001D8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_915' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_916) == 0x0001E8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_916' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_917) == 0x0001F8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_917' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_918) == 0x000208, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_918' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_919) == 0x000210, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_919' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_920) == 0x000218, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_920' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_921) == 0x000219, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_921' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_922) == 0x00021A, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_922' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_923) == 0x000220, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_923' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_924) == 0x000230, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_924' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_925) == 0x000234, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_925' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_926) == 0x000238, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_926' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_927) == 0x000240, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_927' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000258, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002D8, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_LowerBodyJog_AnimBP.Player_LowerBodyJog_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x012F (0x0130 - 0x0001)
struct Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_24;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_29;                                // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_30;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_31;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_37;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_38;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_39;                                // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_40;                                 // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_41;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_42;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_43;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_44;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_45;                                // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	uint8                                         __ByteProperty_46;                                 // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_47;                                // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_48;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_49;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_50;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_51;                                 // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_52;                                 // 0x0105(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_53;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_54;                                 // 0x010C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_55;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_56;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_57;                                 // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_58;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_59;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_60;                                // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_61;                                // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_62;                                 // 0x012C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_63;                                 // 0x012D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_64;                                 // 0x012E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000130, "Wrong size on Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Player_LowerBodyJog_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
