#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveySingleChoiceResponse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveySingleChoiceResponse.PlayerSurveySingleChoiceResponse_C
// 0x0040 (0x0438 - 0x03F8)
class UPlayerSurveySingleChoiceResponse_C final : public UFortPlayerSurveySingleChoiceResponseBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_OrthogonalIndicator;                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_VerticalIndicator;                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyOrthogonalIndicator_C*     PlayerSurveyOrthogonalIndicator;                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyVerticalIndicator_C*       PlayerSurveyVerticalIndicator;                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Responses;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        BaseColumnWidth;                                   // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AdditionalColumnWidth;                             // 0x0430(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveySingleChoiceResponse(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetNumberOfResponses(int32 NumberOfResponses);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveySingleChoiceResponse_C">();
	}
	static class UPlayerSurveySingleChoiceResponse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveySingleChoiceResponse_C>();
	}
};
static_assert(alignof(UPlayerSurveySingleChoiceResponse_C) == 0x000008, "Wrong alignment on UPlayerSurveySingleChoiceResponse_C");
static_assert(sizeof(UPlayerSurveySingleChoiceResponse_C) == 0x000438, "Wrong size on UPlayerSurveySingleChoiceResponse_C");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, UberGraphFrame) == 0x0003F8, "Member 'UPlayerSurveySingleChoiceResponse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, Overlay_OrthogonalIndicator) == 0x000400, "Member 'UPlayerSurveySingleChoiceResponse_C::Overlay_OrthogonalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, Overlay_VerticalIndicator) == 0x000408, "Member 'UPlayerSurveySingleChoiceResponse_C::Overlay_VerticalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, PlayerSurveyOrthogonalIndicator) == 0x000410, "Member 'UPlayerSurveySingleChoiceResponse_C::PlayerSurveyOrthogonalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, PlayerSurveyVerticalIndicator) == 0x000418, "Member 'UPlayerSurveySingleChoiceResponse_C::PlayerSurveyVerticalIndicator' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, SizeBox_Responses) == 0x000420, "Member 'UPlayerSurveySingleChoiceResponse_C::SizeBox_Responses' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, BaseColumnWidth) == 0x000428, "Member 'UPlayerSurveySingleChoiceResponse_C::BaseColumnWidth' has a wrong offset!");
static_assert(offsetof(UPlayerSurveySingleChoiceResponse_C, AdditionalColumnWidth) == 0x000430, "Member 'UPlayerSurveySingleChoiceResponse_C::AdditionalColumnWidth' has a wrong offset!");

}

