#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FullBodyAimOffsets_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_279;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_280;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_281;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_282;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_283;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_284;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_285;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_286;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_287;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_288;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_289;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_290;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_291;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_292;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_293;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_294;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_295;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_297;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_298;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_299;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_300;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_301;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_303;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_304;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_305;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_306;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_307;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_308;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_309;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_310;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_311;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_312;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_313;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_314;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_315;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_316;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_317;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_318;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_319;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_320;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_321;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_322;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_323;                              // 0x00B0(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_279) == 0x000004, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_279' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_280) == 0x000008, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_280' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_281) == 0x00000C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_281' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_282) == 0x000010, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_282' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_283) == 0x000014, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_283' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_284) == 0x000018, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_284' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_285) == 0x00001C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_285' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_286) == 0x000020, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_286' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_287) == 0x000024, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_287' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_288) == 0x000028, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_288' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_289) == 0x00002C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_289' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_290) == 0x000030, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_290' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_291) == 0x000034, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_291' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_292) == 0x000038, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_292' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_293) == 0x00003C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_293' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_294) == 0x000040, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_294' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_295) == 0x000044, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_295' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x000048, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x00004C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_298) == 0x000050, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_298' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x000054, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_300) == 0x000058, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_300' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_301) == 0x00005C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_301' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x000060, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_303) == 0x000064, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_303' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x000068, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_305) == 0x00006C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_305' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_306) == 0x000070, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_306' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_307) == 0x000074, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_307' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_308) == 0x000078, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_308' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x00007C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_310) == 0x000080, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_310' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_311) == 0x000084, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_311' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000088, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_313) == 0x00008C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_313' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_314) == 0x000090, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_314' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_315) == 0x000094, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_315' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_316) == 0x000098, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_316' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_317) == 0x00009C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_317' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_318) == 0x0000A0, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_318' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_319) == 0x0000A1, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_319' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_320) == 0x0000A2, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_320' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_321) == 0x0000A4, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_321' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_322) == 0x0000A8, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_322' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_323) == 0x0000B0, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_323' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0013 (0x0014 - 0x0001)
struct Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000014, "Wrong size on Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");

}

