#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveSetDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CrewUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveSetDetails.ProgressiveSetDetails_C
// 0x0080 (0x0318 - 0x0298)
class UProgressiveSetDetails_C final : public UFortProgressiveSetDetailsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressiveTagsBase_C*                 Tag_ItemSetState;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_HeaderSetName;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoTimeLimit;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           Completed_BG;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_BG;                                        // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Completed_FG;                                      // 0x02F0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Default_FG;                                        // 0x0304(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Update_Tag(const class FText& Expiring_Text, const bool Completed);
	void ExecuteUbergraph_ProgressiveSetDetails(int32 EntryPoint);
	void BP_OnUpdateSetDetails(const class FText& SetName, const class FText& ExpiringText, const bool bCompleted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveSetDetails_C">();
	}
	static class UProgressiveSetDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveSetDetails_C>();
	}
};
static_assert(alignof(UProgressiveSetDetails_C) == 0x000008, "Wrong alignment on UProgressiveSetDetails_C");
static_assert(sizeof(UProgressiveSetDetails_C) == 0x000318, "Wrong size on UProgressiveSetDetails_C");
static_assert(offsetof(UProgressiveSetDetails_C, UberGraphFrame) == 0x000298, "Member 'UProgressiveSetDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Tag_ItemSetState) == 0x0002A0, "Member 'UProgressiveSetDetails_C::Tag_ItemSetState' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Text_HeaderSetName) == 0x0002A8, "Member 'UProgressiveSetDetails_C::Text_HeaderSetName' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Text_NoTimeLimit) == 0x0002B0, "Member 'UProgressiveSetDetails_C::Text_NoTimeLimit' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Text) == 0x0002B8, "Member 'UProgressiveSetDetails_C::Text' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Completed_BG) == 0x0002D0, "Member 'UProgressiveSetDetails_C::Completed_BG' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Default_BG) == 0x0002E0, "Member 'UProgressiveSetDetails_C::Default_BG' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Completed_FG) == 0x0002F0, "Member 'UProgressiveSetDetails_C::Completed_FG' has a wrong offset!");
static_assert(offsetof(UProgressiveSetDetails_C, Default_FG) == 0x000304, "Member 'UProgressiveSetDetails_C::Default_FG' has a wrong offset!");

}

