#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressiveHeaderBanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressiveHeaderBanner.ProgressiveHeaderBanner_C
// 0x0058 (0x02C0 - 0x0268)
class UProgressiveHeaderBanner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Banner_Border;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Banner_Text;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Debug_Text_Preview;                                // 0x0288(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Subscribed;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unsubscribed;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Update_Text(const class FText& InText);
	void Update_Banner_State(const class FText& Text, bool Current_Sets_Complete, bool Subscribed_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_ProgressiveHeaderBanner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressiveHeaderBanner_C">();
	}
	static class UProgressiveHeaderBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressiveHeaderBanner_C>();
	}
};
static_assert(alignof(UProgressiveHeaderBanner_C) == 0x000008, "Wrong alignment on UProgressiveHeaderBanner_C");
static_assert(sizeof(UProgressiveHeaderBanner_C) == 0x0002C0, "Wrong size on UProgressiveHeaderBanner_C");
static_assert(offsetof(UProgressiveHeaderBanner_C, UberGraphFrame) == 0x000268, "Member 'UProgressiveHeaderBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Banner_Border) == 0x000270, "Member 'UProgressiveHeaderBanner_C::Banner_Border' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Banner_Text) == 0x000278, "Member 'UProgressiveHeaderBanner_C::Banner_Text' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Image) == 0x000280, "Member 'UProgressiveHeaderBanner_C::Image' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Debug_Text_Preview) == 0x000288, "Member 'UProgressiveHeaderBanner_C::Debug_Text_Preview' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Subscribed) == 0x0002A0, "Member 'UProgressiveHeaderBanner_C::Subscribed' has a wrong offset!");
static_assert(offsetof(UProgressiveHeaderBanner_C, Unsubscribed) == 0x0002B0, "Member 'UProgressiveHeaderBanner_C::Unsubscribed' has a wrong offset!");

}

