#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgressWidget.ProgressWidget_C
// 0x0018 (0x02C0 - 0x02A8)
class UProgressWidget_C final : public UFortProgressWidget
{
public:
	class USizeBox*                               ProgressSizeBox;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProgressVBox;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgressWidget_C">();
	}
	static class UProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressWidget_C>();
	}
};
static_assert(alignof(UProgressWidget_C) == 0x000008, "Wrong alignment on UProgressWidget_C");
static_assert(sizeof(UProgressWidget_C) == 0x0002C0, "Wrong size on UProgressWidget_C");
static_assert(offsetof(UProgressWidget_C, ProgressSizeBox) == 0x0002A8, "Member 'UProgressWidget_C::ProgressSizeBox' has a wrong offset!");
static_assert(offsetof(UProgressWidget_C, ProgressSpinner) == 0x0002B0, "Member 'UProgressWidget_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UProgressWidget_C, ProgressVBox) == 0x0002B8, "Member 'UProgressWidget_C::ProgressVBox' has a wrong offset!");

}

