#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityModeSelectTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QualityModeSelectTile.QualityModeSelectTile_C
// 0x00A0 (0x14F0 - 0x1450)
class UQualityModeSelectTile_C final : public UFortQualityModeTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InAnOutro;                                         // 0x1458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ConfirmSeleccion;                                  // 0x1460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GameModeSelection;                                 // 0x1468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Recommended;                                // 0x1470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionFlash;                             // 0x1478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x1480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisabledGray;                                      // 0x1488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_140;                                         // 0x1490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedIcon;                                      // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_Recommended;                                     // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Tag_Selected;                                      // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_AdditionalDownloadSize;                  // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_QualityDescription;                      // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_QualityLevelName;                        // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_TotalBuildSize;                          // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TileArt;                                           // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnhoveredVignette;                                 // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsRecommendedLevel;                               // 0x14E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QualityModeSelectTile(int32 EntryPoint);
	void Setup();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnSizeInfoReceived();
	void OnSelectedStateChanged(bool bIsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QualityModeSelectTile_C">();
	}
	static class UQualityModeSelectTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualityModeSelectTile_C>();
	}
};
static_assert(alignof(UQualityModeSelectTile_C) == 0x000010, "Wrong alignment on UQualityModeSelectTile_C");
static_assert(sizeof(UQualityModeSelectTile_C) == 0x0014F0, "Wrong size on UQualityModeSelectTile_C");
static_assert(offsetof(UQualityModeSelectTile_C, UberGraphFrame) == 0x001450, "Member 'UQualityModeSelectTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, InAnOutro) == 0x001458, "Member 'UQualityModeSelectTile_C::InAnOutro' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, ConfirmSeleccion) == 0x001460, "Member 'UQualityModeSelectTile_C::ConfirmSeleccion' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, GameModeSelection) == 0x001468, "Member 'UQualityModeSelectTile_C::GameModeSelection' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, Border_Recommended) == 0x001470, "Member 'UQualityModeSelectTile_C::Border_Recommended' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, ConfirmSelectionFlash) == 0x001478, "Member 'UQualityModeSelectTile_C::ConfirmSelectionFlash' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, ConfirmSelectionShine) == 0x001480, "Member 'UQualityModeSelectTile_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, DisabledGray) == 0x001488, "Member 'UQualityModeSelectTile_C::DisabledGray' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, Image_140) == 0x001490, "Member 'UQualityModeSelectTile_C::Image_140' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, SelectedIcon) == 0x001498, "Member 'UQualityModeSelectTile_C::SelectedIcon' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, T_Recommended) == 0x0014A0, "Member 'UQualityModeSelectTile_C::T_Recommended' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, Tag_Selected) == 0x0014A8, "Member 'UQualityModeSelectTile_C::Tag_Selected' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_AdditionalDownloadSize) == 0x0014B0, "Member 'UQualityModeSelectTile_C::TextBlock_AdditionalDownloadSize' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_QualityDescription) == 0x0014B8, "Member 'UQualityModeSelectTile_C::TextBlock_QualityDescription' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_QualityLevelName) == 0x0014C0, "Member 'UQualityModeSelectTile_C::TextBlock_QualityLevelName' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TextBlock_TotalBuildSize) == 0x0014C8, "Member 'UQualityModeSelectTile_C::TextBlock_TotalBuildSize' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, TileArt) == 0x0014D0, "Member 'UQualityModeSelectTile_C::TileArt' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, UnhoveredVignette) == 0x0014D8, "Member 'UQualityModeSelectTile_C::UnhoveredVignette' has a wrong offset!");
static_assert(offsetof(UQualityModeSelectTile_C, bIsRecommendedLevel) == 0x0014E0, "Member 'UQualityModeSelectTile_C::bIsRecommendedLevel' has a wrong offset!");

}

