#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestNotification

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuestNotification.QuestNotification_C.BP_OnTimerSet
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_BP_OnTimerSet final
{
public:
	EAthenaChallengeTimerState                    TimerState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_BP_OnTimerSet) == 0x000001, "Wrong alignment on QuestNotification_C_BP_OnTimerSet");
static_assert(sizeof(QuestNotification_C_BP_OnTimerSet) == 0x000001, "Wrong size on QuestNotification_C_BP_OnTimerSet");
static_assert(offsetof(QuestNotification_C_BP_OnTimerSet, TimerState) == 0x000000, "Member 'QuestNotification_C_BP_OnTimerSet::TimerState' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.ExecuteUbergraph_QuestNotification
// 0x02B8 (0x02B8 - 0x0000)
struct QuestNotification_C_ExecuteUbergraph_QuestNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasAssisted;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_OtherPlayersName;                     // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E8(0x0050)(HasGetValueTypeHash)
	EAthenaChallengeTimerState                    K2Node_Event_TimerState;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_3;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_6;                              // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsEnabled;                            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Rate;                                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUseRarityContainer;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDailyPunchcardQuest;               // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0228(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_4;                           // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_6;                           // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_ExecuteUbergraph_QuestNotification) == 0x000008, "Wrong alignment on QuestNotification_C_ExecuteUbergraph_QuestNotification");
static_assert(sizeof(QuestNotification_C_ExecuteUbergraph_QuestNotification) == 0x0002B8, "Wrong size on QuestNotification_C_ExecuteUbergraph_QuestNotification");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, EntryPoint) == 0x000000, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable) == 0x000004, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_1) == 0x000020, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable) == 0x000021, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_1) == 0x000022, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_2) == 0x000023, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_2) == 0x000024, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_3) == 0x000025, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_3) == 0x000026, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_4) == 0x000027, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_4) == 0x000028, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_5) == 0x000029, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_bool_Variable_5) == 0x00002A, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_real_Variable) == 0x00002C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_real_Variable_1) == 0x000030, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_IsDesignTime) == 0x000034, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue) == 0x000050, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue_1) == 0x000054, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable) == 0x000068, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000078, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000080, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000088, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Max_ReturnValue) == 0x00008C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000090, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000098, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_1) == 0x0000A8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_bWasAssisted) == 0x0000B8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_bWasAssisted' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_OtherPlayersName) == 0x0000C0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_OtherPlayersName' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_MakeStruct_FormatArgumentData) == 0x0000E8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_TimerState) == 0x000138, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_TimerState' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_MakeArray_Array) == 0x000140, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000150, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Format_ReturnValue) == 0x000158, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000170, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_2) == 0x000174, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_3) == 0x000184, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default) == 0x000198, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_4) == 0x0001A0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_struct_Variable_5) == 0x0001B0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001C0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue_2) == 0x0001C8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x0001CC, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetEndTime_ReturnValue_3) == 0x0001D0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetEndTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, Temp_byte_Variable_6) == 0x0001D4, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_1) == 0x0001D8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_IsEnabled) == 0x0001E8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_IsEnabled' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_Rate) == 0x0001EC, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_Rate' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_FMax_ReturnValue) == 0x0001F0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_bUseRarityContainer) == 0x0001F8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_bUseRarityContainer' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Event_bIsDailyPunchcardQuest) == 0x0001F9, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Event_bIsDailyPunchcardQuest' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_4) == 0x000200, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_2) == 0x000208, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_3) == 0x000209, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_ReturnValue_5) == 0x000210, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000218, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000220, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_CreateDelegate_OutputDelegate_3) == 0x000228, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_4) == 0x000238, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000240, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000248, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x000250, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000258, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_5) == 0x000260, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetOwningPlayer_ReturnValue) == 0x000268, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_IsValid_ReturnValue) == 0x000270, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_GetObjectClass_ReturnValue) == 0x000278, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_ClassIsChildOf_ReturnValue) == 0x000280, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, K2Node_Select_Default_6) == 0x000284, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000288, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000290, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000298, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00029C, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_FMax_A_ImplicitCast) == 0x0002A0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x0002A8, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1) == 0x0002AC, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_ExecuteUbergraph_QuestNotification, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0002B0, "Member 'QuestNotification_C_ExecuteUbergraph_QuestNotification::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnEnableCompleteFlavorText
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_OnEnableCompleteFlavorText final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_OnEnableCompleteFlavorText) == 0x000001, "Wrong alignment on QuestNotification_C_OnEnableCompleteFlavorText");
static_assert(sizeof(QuestNotification_C_OnEnableCompleteFlavorText) == 0x000001, "Wrong size on QuestNotification_C_OnEnableCompleteFlavorText");
static_assert(offsetof(QuestNotification_C_OnEnableCompleteFlavorText, IsEnabled) == 0x000000, "Member 'QuestNotification_C_OnEnableCompleteFlavorText::IsEnabled' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnPlayRushedNotificationIntro
// 0x0004 (0x0004 - 0x0000)
struct QuestNotification_C_OnPlayRushedNotificationIntro final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_OnPlayRushedNotificationIntro) == 0x000004, "Wrong alignment on QuestNotification_C_OnPlayRushedNotificationIntro");
static_assert(sizeof(QuestNotification_C_OnPlayRushedNotificationIntro) == 0x000004, "Wrong size on QuestNotification_C_OnPlayRushedNotificationIntro");
static_assert(offsetof(QuestNotification_C_OnPlayRushedNotificationIntro, Rate) == 0x000000, "Member 'QuestNotification_C_OnPlayRushedNotificationIntro::Rate' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.OnUpdateNotificationBackground
// 0x0002 (0x0002 - 0x0000)
struct QuestNotification_C_OnUpdateNotificationBackground final
{
public:
	bool                                          bUseRarityContainer;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDailyPunchcardQuest;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_OnUpdateNotificationBackground) == 0x000001, "Wrong alignment on QuestNotification_C_OnUpdateNotificationBackground");
static_assert(sizeof(QuestNotification_C_OnUpdateNotificationBackground) == 0x000002, "Wrong size on QuestNotification_C_OnUpdateNotificationBackground");
static_assert(offsetof(QuestNotification_C_OnUpdateNotificationBackground, bUseRarityContainer) == 0x000000, "Member 'QuestNotification_C_OnUpdateNotificationBackground::bUseRarityContainer' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_OnUpdateNotificationBackground, bIsDailyPunchcardQuest) == 0x000001, "Member 'QuestNotification_C_OnUpdateNotificationBackground::bIsDailyPunchcardQuest' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct QuestNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_PreConstruct) == 0x000001, "Wrong alignment on QuestNotification_C_PreConstruct");
static_assert(sizeof(QuestNotification_C_PreConstruct) == 0x000001, "Wrong size on QuestNotification_C_PreConstruct");
static_assert(offsetof(QuestNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'QuestNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.SetAssistData
// 0x0018 (0x0018 - 0x0000)
struct QuestNotification_C_SetAssistData final
{
public:
	bool                                          bWasAssisted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OtherPlayersName;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_SetAssistData) == 0x000008, "Wrong alignment on QuestNotification_C_SetAssistData");
static_assert(sizeof(QuestNotification_C_SetAssistData) == 0x000018, "Wrong size on QuestNotification_C_SetAssistData");
static_assert(offsetof(QuestNotification_C_SetAssistData, bWasAssisted) == 0x000000, "Member 'QuestNotification_C_SetAssistData::bWasAssisted' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_SetAssistData, OtherPlayersName) == 0x000008, "Member 'QuestNotification_C_SetAssistData::OtherPlayersName' has a wrong offset!");

// Function QuestNotification.QuestNotification_C.UpdateProgress
// 0x0060 (0x0060 - 0x0000)
struct QuestNotification_C_UpdateProgress final
{
public:
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestNotification_C_UpdateProgress) == 0x000008, "Wrong alignment on QuestNotification_C_UpdateProgress");
static_assert(sizeof(QuestNotification_C_UpdateProgress) == 0x000060, "Wrong size on QuestNotification_C_UpdateProgress");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Max_ReturnValue) == 0x000000, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Max_ReturnValue_1) == 0x000004, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestNotification_C_UpdateProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'QuestNotification_C_UpdateProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
