#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestScreen_ArrowButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestScreen_ArrowButton.QuestScreen_ArrowButton_C
// 0x0060 (0x1490 - 0x1430)
class UQuestScreen_ArrowButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RowActive_Flip;                                    // 0x1438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RowInactive;                                       // 0x1440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RowActive;                                         // 0x1448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LargePulse;                                        // 0x1450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_LargePulse;                                  // 0x1468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Icon;                                              // 0x1470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x1478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x1480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Flip;                                              // 0x1488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputActionOnSide;                                 // 0x1489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_QuestScreen_ArrowButton(int32 EntryPoint);
	void GetActiveAnimation(class UWidgetAnimation** ActiveAnimation);
	void OnRowActiveChanged(bool IsActive);
	void OnRowReset(bool IsActive);
	void PreConstruct(bool IsDesignTime);
	void SnapAnimationToEnd(class UWidgetAnimation* InAnimation);
	void UpdateArrowColor(const struct FLinearColor& Color, const struct FLinearColor& HoverColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestScreen_ArrowButton_C">();
	}
	static class UQuestScreen_ArrowButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestScreen_ArrowButton_C>();
	}
};
static_assert(alignof(UQuestScreen_ArrowButton_C) == 0x000010, "Wrong alignment on UQuestScreen_ArrowButton_C");
static_assert(sizeof(UQuestScreen_ArrowButton_C) == 0x001490, "Wrong size on UQuestScreen_ArrowButton_C");
static_assert(offsetof(UQuestScreen_ArrowButton_C, UberGraphFrame) == 0x001430, "Member 'UQuestScreen_ArrowButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, RowActive_Flip) == 0x001438, "Member 'UQuestScreen_ArrowButton_C::RowActive_Flip' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, RowInactive) == 0x001440, "Member 'UQuestScreen_ArrowButton_C::RowInactive' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, RowActive) == 0x001448, "Member 'UQuestScreen_ArrowButton_C::RowActive' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, LargePulse) == 0x001450, "Member 'UQuestScreen_ArrowButton_C::LargePulse' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, Hover) == 0x001458, "Member 'UQuestScreen_ArrowButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, Arrow) == 0x001460, "Member 'UQuestScreen_ArrowButton_C::Arrow' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, Arrow_LargePulse) == 0x001468, "Member 'UQuestScreen_ArrowButton_C::Arrow_LargePulse' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, Icon) == 0x001470, "Member 'UQuestScreen_ArrowButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, SafeZone_0) == 0x001478, "Member 'UQuestScreen_ArrowButton_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, Shadow) == 0x001480, "Member 'UQuestScreen_ArrowButton_C::Shadow' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, Flip) == 0x001488, "Member 'UQuestScreen_ArrowButton_C::Flip' has a wrong offset!");
static_assert(offsetof(UQuestScreen_ArrowButton_C, InputActionOnSide) == 0x001489, "Member 'UQuestScreen_ArrowButton_C::InputActionOnSide' has a wrong offset!");

}

