#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RailConnectionOption

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct RailConnectionOption.RailConnectionOption
// 0x0050 (0x0050 - 0x0000)
struct FRailConnectionOption final
{
public:
	TSoftObjectPtr<class ABGA_GrindRail_C>        Rail_18_FD5E848849D687A9C5D6508630A46F78;          // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         SplinePoint_5_717E301B41E0E162851C01812C364C62;    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Exit_MovementDirection_16_599A0A9E4CFB9BBA081E4EA689E59C3A; // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Exit_RailDirection_17_693E0134407BEB21638C31882F5D2C33; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRailConnectionOption) == 0x000008, "Wrong alignment on FRailConnectionOption");
static_assert(sizeof(FRailConnectionOption) == 0x000050, "Wrong size on FRailConnectionOption");
static_assert(offsetof(FRailConnectionOption, Rail_18_FD5E848849D687A9C5D6508630A46F78) == 0x000000, "Member 'FRailConnectionOption::Rail_18_FD5E848849D687A9C5D6508630A46F78' has a wrong offset!");
static_assert(offsetof(FRailConnectionOption, SplinePoint_5_717E301B41E0E162851C01812C364C62) == 0x000028, "Member 'FRailConnectionOption::SplinePoint_5_717E301B41E0E162851C01812C364C62' has a wrong offset!");
static_assert(offsetof(FRailConnectionOption, Exit_MovementDirection_16_599A0A9E4CFB9BBA081E4EA689E59C3A) == 0x000030, "Member 'FRailConnectionOption::Exit_MovementDirection_16_599A0A9E4CFB9BBA081E4EA689E59C3A' has a wrong offset!");
static_assert(offsetof(FRailConnectionOption, Exit_RailDirection_17_693E0134407BEB21638C31882F5D2C33) == 0x000048, "Member 'FRailConnectionOption::Exit_RailDirection_17_693E0134407BEB21638C31882F5D2C33' has a wrong offset!");

}

