#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootRallyAvailableTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RebootRallyAvailableTooltip.RebootRallyAvailableTooltip_C
// 0x0020 (0x0428 - 0x0408)
class URebootRallyAvailableTooltip_C final : public UFortSidebarOnboardTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   CommonRichTextBlock_140;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBurst;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateText();
	void OnShowTooltip();
	void OnEndTooltip();
	void HandleInputMethodChanged(ECommonInputType bNewInputType);
	void ExecuteUbergraph_RebootRallyAvailableTooltip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RebootRallyAvailableTooltip_C">();
	}
	static class URebootRallyAvailableTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebootRallyAvailableTooltip_C>();
	}
};
static_assert(alignof(URebootRallyAvailableTooltip_C) == 0x000008, "Wrong alignment on URebootRallyAvailableTooltip_C");
static_assert(sizeof(URebootRallyAvailableTooltip_C) == 0x000428, "Wrong size on URebootRallyAvailableTooltip_C");
static_assert(offsetof(URebootRallyAvailableTooltip_C, UberGraphFrame) == 0x000408, "Member 'URebootRallyAvailableTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, CommonRichTextBlock_140) == 0x000410, "Member 'URebootRallyAvailableTooltip_C::CommonRichTextBlock_140' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, Image_Arrow) == 0x000418, "Member 'URebootRallyAvailableTooltip_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(URebootRallyAvailableTooltip_C, ImageBurst) == 0x000420, "Member 'URebootRallyAvailableTooltip_C::ImageBurst' has a wrong offset!");

}

