#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebootRallyEligiblePlayersOnboardingTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function RebootRallyEligiblePlayersOnboardingTooltip.RebootRallyEligiblePlayersOnboardingTooltip_C.ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip
// 0x0030 (0x0030 - 0x0000)
struct RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip) == 0x000008, "Wrong alignment on RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip");
static_assert(sizeof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip) == 0x000030, "Wrong size on RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip");
static_assert(offsetof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip, EntryPoint) == 0x000000, "Member 'RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000010, "Member 'RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000018, "Member 'RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'RebootRallyEligiblePlayersOnboardingTooltip_C_ExecuteUbergraph_RebootRallyEligiblePlayersOnboardingTooltip::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

