#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReplaceQuestButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReplaceQuestButton.ReplaceQuestButton_C
// 0x00B0 (0x1530 - 0x1480)
class UReplaceQuestButton_C final : public UFortHoldableButton
{
public:
	uint8                                         Pad_1478[0x8];                                     // 0x1478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldCompleted;                                     // 0x1488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x1490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_material;                                    // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Progress;                                    // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x14B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        In_Width_Override;                                 // 0x14D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x14D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x14E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_14E1[0x7];                                     // 0x14E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HoldProgressDMI;                                   // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_SubText;                                        // 0x14F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Show_BP_icon;                                      // 0x1508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1509[0x3];                                     // 0x1509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Size;                                              // 0x150C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        In_Height_Override;                                // 0x1510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAudioComponent*                        FillingSoundAudioComponent;                        // 0x1518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillingSoundOverride;                              // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FillCompleteSoundOverride;                         // 0x1528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHoldCompleted();
	void BP_OnHoldDecreased(const float HoldPercentage);
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldIncreased(const float HoldPercentage);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_ReplaceQuestButton(int32 EntryPoint);
	void FillComplete();
	void PlayFillSound();
	void PreConstruct(bool IsDesignTime);
	void StopFillSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReplaceQuestButton_C">();
	}
	static class UReplaceQuestButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplaceQuestButton_C>();
	}
};
static_assert(alignof(UReplaceQuestButton_C) == 0x000010, "Wrong alignment on UReplaceQuestButton_C");
static_assert(sizeof(UReplaceQuestButton_C) == 0x001530, "Wrong size on UReplaceQuestButton_C");
static_assert(offsetof(UReplaceQuestButton_C, UberGraphFrame) == 0x001480, "Member 'UReplaceQuestButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, HoldCompleted) == 0x001488, "Member 'UReplaceQuestButton_C::HoldCompleted' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, HoldProgress) == 0x001490, "Member 'UReplaceQuestButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Hover) == 0x001498, "Member 'UReplaceQuestButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Image_material) == 0x0014A0, "Member 'UReplaceQuestButton_C::Image_material' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Image_Progress) == 0x0014A8, "Member 'UReplaceQuestButton_C::Image_Progress' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, SizeBox_0) == 0x0014B0, "Member 'UReplaceQuestButton_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, In_Text) == 0x0014B8, "Member 'UReplaceQuestButton_C::In_Text' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, In_Width_Override) == 0x0014D0, "Member 'UReplaceQuestButton_C::In_Width_Override' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Material) == 0x0014D8, "Member 'UReplaceQuestButton_C::Material' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Justification) == 0x0014E0, "Member 'UReplaceQuestButton_C::Justification' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, HoldProgressDMI) == 0x0014E8, "Member 'UReplaceQuestButton_C::HoldProgressDMI' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, In_SubText) == 0x0014F0, "Member 'UReplaceQuestButton_C::In_SubText' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Show_BP_icon) == 0x001508, "Member 'UReplaceQuestButton_C::Show_BP_icon' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, Size) == 0x00150C, "Member 'UReplaceQuestButton_C::Size' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, In_Height_Override) == 0x001510, "Member 'UReplaceQuestButton_C::In_Height_Override' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, FillingSoundAudioComponent) == 0x001518, "Member 'UReplaceQuestButton_C::FillingSoundAudioComponent' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, FillingSoundOverride) == 0x001520, "Member 'UReplaceQuestButton_C::FillingSoundOverride' has a wrong offset!");
static_assert(offsetof(UReplaceQuestButton_C, FillCompleteSoundOverride) == 0x001528, "Member 'UReplaceQuestButton_C::FillCompleteSoundOverride' has a wrong offset!");

}

