#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichTextButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RichTextButton.RichTextButton_C
// 0x0080 (0x14B0 - 0x1430)
class URichTextButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover2;                                            // 0x1438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x1440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x1448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_Text;                                         // 0x1450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x1458(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x1470(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_1484[0x4];                                     // 0x1484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material_Brush;                                    // 0x1488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x1490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x1498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x1499(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SimpleHover;                                       // 0x149A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOverride;                                  // 0x149B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x149C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShearText;                                         // 0x14A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RichTextButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RichTextButton_C">();
	}
	static class URichTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextButton_C>();
	}
};
static_assert(alignof(URichTextButton_C) == 0x000010, "Wrong alignment on URichTextButton_C");
static_assert(sizeof(URichTextButton_C) == 0x0014B0, "Wrong size on URichTextButton_C");
static_assert(offsetof(URichTextButton_C, UberGraphFrame) == 0x001430, "Member 'URichTextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Hover2) == 0x001438, "Member 'URichTextButton_C::Hover2' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Hover) == 0x001440, "Member 'URichTextButton_C::Hover' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Border_Material) == 0x001448, "Member 'URichTextButton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Rich_Text) == 0x001450, "Member 'URichTextButton_C::Rich_Text' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Button_text) == 0x001458, "Member 'URichTextButton_C::Button_text' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Text_Color) == 0x001470, "Member 'URichTextButton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Material_Brush) == 0x001488, "Member 'URichTextButton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Right_Image) == 0x001490, "Member 'URichTextButton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Justifiction) == 0x001498, "Member 'URichTextButton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, Auto_wrap_text) == 0x001499, "Member 'URichTextButton_C::Auto_wrap_text' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, SimpleHover) == 0x00149A, "Member 'URichTextButton_C::SimpleHover' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, FontSizeOverride) == 0x00149B, "Member 'URichTextButton_C::FontSizeOverride' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, FontSize) == 0x00149C, "Member 'URichTextButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(URichTextButton_C, ShearText) == 0x0014A0, "Member 'URichTextButton_C::ShearText' has a wrong offset!");

}

