#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RidingCodeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "RidingCodeRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class RidingCodeRuntime.FortVehicleLayerAnimInstance_Riding
// 0x02B0 (0x0AC0 - 0x0810)
class UFortVehicleLayerAnimInstance_Riding : public UFortVehicleOccupantAnimInstance
{
public:
	struct FCachedAnimRelevancyData               IntoVehicleCachedData;                             // 0x0808(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               OutOfVehicleCachedData;                            // 0x081C(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x0830(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutTime;                                           // 0x0834(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BodyYawOffset;                                     // 0x0838(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               BodyCounterRotation;                               // 0x0840(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BodyCounterRotationAlpha;                          // 0x0858(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReloading;                                      // 0x085C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargeting;                                      // 0x085D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFiring;                                         // 0x085E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingConsumable;                                // 0x085F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAction;                                       // 0x0860(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsThrowConsumable;                                // 0x0861(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargetingOrThrowingConsumable;                  // 0x0862(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurningInPlace;                                 // 0x0863(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRidingSprinting;                                // 0x0864(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRidingPetting;                                  // 0x0865(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_866[0x2];                                      // 0x0866(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TurnInPlaceRotationSpeed;                          // 0x0868(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnInPlaceAngleDelta;                             // 0x086C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRidingMovingBackward;                           // 0x0870(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSlopeSliding;                                   // 0x0871(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_872[0x2];                                      // 0x0872(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SlopeSlidingPitch;                                 // 0x0874(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlopeSlidingRoll;                                  // 0x0878(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderReferentialRidableYaw;                        // 0x087C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawDegreesCoverage;                             // 0x0880(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothedAimYaw;                                    // 0x0884(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJustEntered;                                      // 0x0888(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRidableMoving;                                  // 0x0889(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRideMode;                                       // 0x088A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88B[0x1];                                      // 0x088B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RidableVelocity;                                   // 0x088C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BodyYaw;                                           // 0x0890(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostPlayRate;                                     // 0x0894(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RidingMovePlayRate;                                // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FalseBlendTime;                                    // 0x089C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CombatToRideYaw;                                   // 0x08A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlaceYaw;                                        // 0x08A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadAOAlpha;                                       // 0x08A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               MeleeTwistRot;                                     // 0x08B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsDualWield;                                      // 0x08C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneHandedDualWield;                             // 0x08C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTwoHandedSword;                                 // 0x08CA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAdjustBodyTwistForMelee;                    // 0x08CB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayerOffset;                                      // 0x08D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseAlpha;                                        // 0x08E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLobsterBlockActive;                             // 0x08EC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8ED[0x3];                                      // 0x08ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SlopePitch;                                        // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderHeightAdjustmentSpringConstant;               // 0x08F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSlopePitchForRiderHeightAdjustment;             // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSlopePitchForRiderHeightAdjustment;             // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderHeightAdjustmentForMinSlopePitch;             // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RiderHeightAdjustmentForMaxSlopePitch;             // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PettingRotAlpha;                                   // 0x0908(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90C[0x4];                                      // 0x090C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               PettingRot;                                        // 0x0910(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PettingPitchFactor;                                // 0x0928(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PettingRollFactor;                                 // 0x092C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachLeft;                                    // 0x0930(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachRight;                                   // 0x0948(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandAttachAlpha;                                   // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERidingFootPhase                              FootPhase;                                         // 0x0964(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_FeetInAir;                            // 0x0965(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_FrontFeetPlanted;                     // 0x0966(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_BackFeetPlanted;                      // 0x0967(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_LeftBackFeetForward;                  // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_RightBackFeetForward;                 // 0x0969(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_LeftPlantedRightPass;                 // 0x096A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFootPhase_RightPlantedLeftPass;                 // 0x096B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnInPlaceModulatedSpeed;                         // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurnInPlaceAngleDeltaPositive;                  // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_971[0x3];                                      // 0x0971(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SlopeRoll;                                         // 0x0974(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovingVelocityLowerBound;                          // 0x0978(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JustEnteredDelayTimeSec;                           // 0x097C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FalseBlendTime_Moving;                             // 0x0980(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FalseBlendTime_NotMoving;                          // 0x0984(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PlayerOffsetMale;                                  // 0x0988(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PlayerOffsetFemale;                                // 0x09A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ScytheMontage;                                     // 0x09B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BRSwordMontage;                                    // 0x09D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortWeaponCoreAnimation                      MeleeDualWieldCoreAnimation;                       // 0x09E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9E9[0x7];                                      // 0x09E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SlopePitchTraceStart;                              // 0x09F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SlopePitchTraceEnd;                                // 0x0A08(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachLocationLeftMale;                        // 0x0A20(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachLocationRightMale;                       // 0x0A38(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachLocationLeftFemale;                      // 0x0A50(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachLocationRightFemale;                     // 0x0A68(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerHandAttachLeft;                              // 0x0A80(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerHandAttachRight;                             // 0x0A84(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DisableHandAttachCurveName;                        // 0x0A88(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AllowRidingNoiseAdditiveCurveName;                 // 0x0A8C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A90[0x30];                                     // 0x0A90(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlueprintCollectRidableAnimBPData(const class UAnimInstance* RidableAnimInstance);
	void PlaceHandIKTargets();
	void SetFootPhase(const ERidingFootPhase InFootPhase);
	void UpdateBoostPlayRate();
	void UpdateSlopePitchForRiding();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleLayerAnimInstance_Riding">();
	}
	static class UFortVehicleLayerAnimInstance_Riding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleLayerAnimInstance_Riding>();
	}
};
static_assert(alignof(UFortVehicleLayerAnimInstance_Riding) == 0x000010, "Wrong alignment on UFortVehicleLayerAnimInstance_Riding");
static_assert(sizeof(UFortVehicleLayerAnimInstance_Riding) == 0x000AC0, "Wrong size on UFortVehicleLayerAnimInstance_Riding");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, IntoVehicleCachedData) == 0x000808, "Member 'UFortVehicleLayerAnimInstance_Riding::IntoVehicleCachedData' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, OutOfVehicleCachedData) == 0x00081C, "Member 'UFortVehicleLayerAnimInstance_Riding::OutOfVehicleCachedData' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, InTime) == 0x000830, "Member 'UFortVehicleLayerAnimInstance_Riding::InTime' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, OutTime) == 0x000834, "Member 'UFortVehicleLayerAnimInstance_Riding::OutTime' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, BodyYawOffset) == 0x000838, "Member 'UFortVehicleLayerAnimInstance_Riding::BodyYawOffset' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, BodyCounterRotation) == 0x000840, "Member 'UFortVehicleLayerAnimInstance_Riding::BodyCounterRotation' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, BodyCounterRotationAlpha) == 0x000858, "Member 'UFortVehicleLayerAnimInstance_Riding::BodyCounterRotationAlpha' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsReloading) == 0x00085C, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsReloading' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsTargeting) == 0x00085D, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsTargeting' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFiring) == 0x00085E, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFiring' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsUsingConsumable) == 0x00085F, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsUsingConsumable' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsInAction) == 0x000860, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsInAction' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsThrowConsumable) == 0x000861, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsThrowConsumable' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsTargetingOrThrowingConsumable) == 0x000862, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsTargetingOrThrowingConsumable' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsTurningInPlace) == 0x000863, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsTurningInPlace' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsRidingSprinting) == 0x000864, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsRidingSprinting' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsRidingPetting) == 0x000865, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsRidingPetting' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, TurnInPlaceRotationSpeed) == 0x000868, "Member 'UFortVehicleLayerAnimInstance_Riding::TurnInPlaceRotationSpeed' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, TurnInPlaceAngleDelta) == 0x00086C, "Member 'UFortVehicleLayerAnimInstance_Riding::TurnInPlaceAngleDelta' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsRidingMovingBackward) == 0x000870, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsRidingMovingBackward' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsSlopeSliding) == 0x000871, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsSlopeSliding' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SlopeSlidingPitch) == 0x000874, "Member 'UFortVehicleLayerAnimInstance_Riding::SlopeSlidingPitch' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SlopeSlidingRoll) == 0x000878, "Member 'UFortVehicleLayerAnimInstance_Riding::SlopeSlidingRoll' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, RiderReferentialRidableYaw) == 0x00087C, "Member 'UFortVehicleLayerAnimInstance_Riding::RiderReferentialRidableYaw' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, AimYawDegreesCoverage) == 0x000880, "Member 'UFortVehicleLayerAnimInstance_Riding::AimYawDegreesCoverage' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SmoothedAimYaw) == 0x000884, "Member 'UFortVehicleLayerAnimInstance_Riding::SmoothedAimYaw' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bJustEntered) == 0x000888, "Member 'UFortVehicleLayerAnimInstance_Riding::bJustEntered' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsRidableMoving) == 0x000889, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsRidableMoving' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsRideMode) == 0x00088A, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsRideMode' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, RidableVelocity) == 0x00088C, "Member 'UFortVehicleLayerAnimInstance_Riding::RidableVelocity' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, BodyYaw) == 0x000890, "Member 'UFortVehicleLayerAnimInstance_Riding::BodyYaw' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, BoostPlayRate) == 0x000894, "Member 'UFortVehicleLayerAnimInstance_Riding::BoostPlayRate' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, RidingMovePlayRate) == 0x000898, "Member 'UFortVehicleLayerAnimInstance_Riding::RidingMovePlayRate' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, FalseBlendTime) == 0x00089C, "Member 'UFortVehicleLayerAnimInstance_Riding::FalseBlendTime' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, CombatToRideYaw) == 0x0008A0, "Member 'UFortVehicleLayerAnimInstance_Riding::CombatToRideYaw' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, InPlaceYaw) == 0x0008A4, "Member 'UFortVehicleLayerAnimInstance_Riding::InPlaceYaw' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HeadAOAlpha) == 0x0008A8, "Member 'UFortVehicleLayerAnimInstance_Riding::HeadAOAlpha' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, MeleeTwistRot) == 0x0008B0, "Member 'UFortVehicleLayerAnimInstance_Riding::MeleeTwistRot' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsDualWield) == 0x0008C8, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsDualWield' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsOneHandedDualWield) == 0x0008C9, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsOneHandedDualWield' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsTwoHandedSword) == 0x0008CA, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsTwoHandedSword' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bShouldAdjustBodyTwistForMelee) == 0x0008CB, "Member 'UFortVehicleLayerAnimInstance_Riding::bShouldAdjustBodyTwistForMelee' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PlayerOffset) == 0x0008D0, "Member 'UFortVehicleLayerAnimInstance_Riding::PlayerOffset' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, NoiseAlpha) == 0x0008E8, "Member 'UFortVehicleLayerAnimInstance_Riding::NoiseAlpha' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsLobsterBlockActive) == 0x0008EC, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsLobsterBlockActive' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SlopePitch) == 0x0008F0, "Member 'UFortVehicleLayerAnimInstance_Riding::SlopePitch' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, RiderHeightAdjustmentSpringConstant) == 0x0008F4, "Member 'UFortVehicleLayerAnimInstance_Riding::RiderHeightAdjustmentSpringConstant' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, MinSlopePitchForRiderHeightAdjustment) == 0x0008F8, "Member 'UFortVehicleLayerAnimInstance_Riding::MinSlopePitchForRiderHeightAdjustment' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, MaxSlopePitchForRiderHeightAdjustment) == 0x0008FC, "Member 'UFortVehicleLayerAnimInstance_Riding::MaxSlopePitchForRiderHeightAdjustment' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, RiderHeightAdjustmentForMinSlopePitch) == 0x000900, "Member 'UFortVehicleLayerAnimInstance_Riding::RiderHeightAdjustmentForMinSlopePitch' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, RiderHeightAdjustmentForMaxSlopePitch) == 0x000904, "Member 'UFortVehicleLayerAnimInstance_Riding::RiderHeightAdjustmentForMaxSlopePitch' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PettingRotAlpha) == 0x000908, "Member 'UFortVehicleLayerAnimInstance_Riding::PettingRotAlpha' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PettingRot) == 0x000910, "Member 'UFortVehicleLayerAnimInstance_Riding::PettingRot' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PettingPitchFactor) == 0x000928, "Member 'UFortVehicleLayerAnimInstance_Riding::PettingPitchFactor' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PettingRollFactor) == 0x00092C, "Member 'UFortVehicleLayerAnimInstance_Riding::PettingRollFactor' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachLeft) == 0x000930, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachLeft' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachRight) == 0x000948, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachRight' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachAlpha) == 0x000960, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachAlpha' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, FootPhase) == 0x000964, "Member 'UFortVehicleLayerAnimInstance_Riding::FootPhase' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_FeetInAir) == 0x000965, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_FeetInAir' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_FrontFeetPlanted) == 0x000966, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_FrontFeetPlanted' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_BackFeetPlanted) == 0x000967, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_BackFeetPlanted' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_LeftBackFeetForward) == 0x000968, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_LeftBackFeetForward' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_RightBackFeetForward) == 0x000969, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_RightBackFeetForward' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_LeftPlantedRightPass) == 0x00096A, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_LeftPlantedRightPass' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsFootPhase_RightPlantedLeftPass) == 0x00096B, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsFootPhase_RightPlantedLeftPass' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, TurnInPlaceModulatedSpeed) == 0x00096C, "Member 'UFortVehicleLayerAnimInstance_Riding::TurnInPlaceModulatedSpeed' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, bIsTurnInPlaceAngleDeltaPositive) == 0x000970, "Member 'UFortVehicleLayerAnimInstance_Riding::bIsTurnInPlaceAngleDeltaPositive' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SlopeRoll) == 0x000974, "Member 'UFortVehicleLayerAnimInstance_Riding::SlopeRoll' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, MovingVelocityLowerBound) == 0x000978, "Member 'UFortVehicleLayerAnimInstance_Riding::MovingVelocityLowerBound' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, JustEnteredDelayTimeSec) == 0x00097C, "Member 'UFortVehicleLayerAnimInstance_Riding::JustEnteredDelayTimeSec' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, FalseBlendTime_Moving) == 0x000980, "Member 'UFortVehicleLayerAnimInstance_Riding::FalseBlendTime_Moving' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, FalseBlendTime_NotMoving) == 0x000984, "Member 'UFortVehicleLayerAnimInstance_Riding::FalseBlendTime_NotMoving' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PlayerOffsetMale) == 0x000988, "Member 'UFortVehicleLayerAnimInstance_Riding::PlayerOffsetMale' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PlayerOffsetFemale) == 0x0009A0, "Member 'UFortVehicleLayerAnimInstance_Riding::PlayerOffsetFemale' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, ScytheMontage) == 0x0009B8, "Member 'UFortVehicleLayerAnimInstance_Riding::ScytheMontage' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, BRSwordMontage) == 0x0009D0, "Member 'UFortVehicleLayerAnimInstance_Riding::BRSwordMontage' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, MeleeDualWieldCoreAnimation) == 0x0009E8, "Member 'UFortVehicleLayerAnimInstance_Riding::MeleeDualWieldCoreAnimation' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SlopePitchTraceStart) == 0x0009F0, "Member 'UFortVehicleLayerAnimInstance_Riding::SlopePitchTraceStart' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, SlopePitchTraceEnd) == 0x000A08, "Member 'UFortVehicleLayerAnimInstance_Riding::SlopePitchTraceEnd' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachLocationLeftMale) == 0x000A20, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachLocationLeftMale' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachLocationRightMale) == 0x000A38, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachLocationRightMale' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachLocationLeftFemale) == 0x000A50, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachLocationLeftFemale' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, HandAttachLocationRightFemale) == 0x000A68, "Member 'UFortVehicleLayerAnimInstance_Riding::HandAttachLocationRightFemale' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PlayerHandAttachLeft) == 0x000A80, "Member 'UFortVehicleLayerAnimInstance_Riding::PlayerHandAttachLeft' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, PlayerHandAttachRight) == 0x000A84, "Member 'UFortVehicleLayerAnimInstance_Riding::PlayerHandAttachRight' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, DisableHandAttachCurveName) == 0x000A88, "Member 'UFortVehicleLayerAnimInstance_Riding::DisableHandAttachCurveName' has a wrong offset!");
static_assert(offsetof(UFortVehicleLayerAnimInstance_Riding, AllowRidingNoiseAdditiveCurveName) == 0x000A8C, "Member 'UFortVehicleLayerAnimInstance_Riding::AllowRidingNoiseAdditiveCurveName' has a wrong offset!");

// Class RidingCodeRuntime.RidingCheatManager
// 0x0000 (0x0028 - 0x0028)
class URidingCheatManager final : public UChildCheatManager
{
public:
	void RidingSetStaminaPercent(const float StaminaPercent);
	void StartRidingActor();
	void StopRidingActor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RidingCheatManager">();
	}
	static class URidingCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<URidingCheatManager>();
	}
};
static_assert(alignof(URidingCheatManager) == 0x000008, "Wrong alignment on URidingCheatManager");
static_assert(sizeof(URidingCheatManager) == 0x000028, "Wrong size on URidingCheatManager");

// Class RidingCodeRuntime.RidableComponent
// 0x02D8 (0x0378 - 0x00A0)
class URidableComponent : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class URidableComponent* Ridable, class URiderComponent* Rider)> OnRiderStartedRiding;                              // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class URidableComponent* Ridable, class URiderComponent* Rider)> OnRiderStoppedRiding;                              // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>              RiderAnimLayerOverlayClass;                        // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AttachSocket;                                      // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachLocationOffset;                              // 0x00D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               AttachRotationOffset;                              // 0x00F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   ClientAttachGuideSocket;                           // 0x0108(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ClientAttachGuideLocationOffset;                   // 0x0110(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RidablePropAttachSocket;                           // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RidablePropAttachLocationOffset;                   // 0x0130(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               RidablePropAttachRotationOffset;                   // 0x0148(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         RidablePropAttachScale;                            // 0x0160(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RidablePropAttachRiderVerticalBuffer;              // 0x0164(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRidingAttachmentBoundsOverride        RiderPropAttachBoundsOverride;                     // 0x0168(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverrideNoiseGeneration;                          // 0x01A0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerPawnAthenaMovementNoiseOverride RiderMovementNoiseOverride;                        // 0x01A4(0x000C)(Edit, Config, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RidableTag;                                        // 0x01B0(0x0004)(Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EnergyDepletedTag;                                 // 0x01B4(0x0004)(Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    PlaylistTagBlacklistRowHandle;                     // 0x01B8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class URiderComponent*                        ActiveRider;                                       // 0x01C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URiderComponent*                        LastRider;                                         // 0x01D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        RidableProp;                                       // 0x01D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OriginalCapsuleRadius;                             // 0x01E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OriginalCapsuleHalfHeight;                         // 0x01E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RidingCapsuleRadius;                               // 0x01E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RidingCapsuleHalfHeight;                           // 0x01EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOriginalClientPositionSmoothingThrottlingSetting; // 0x01F0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHalfAimingAngle;                                // 0x01F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryFireAnimMontageAnimCoreTypeOverride> PrimaryFireMontageAnimCoreTypeOverrides;           // 0x0220(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryFireAnimMontageTagOverride> PrimaryFireMontageTagOverrides;                    // 0x0230(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FRidingPettingData                     PettingData;                                       // 0x0240(0x0108)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                           RestoreCollisionHandle;                            // 0x0348(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_350[0x10];                                     // 0x0350(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsSprinting;                                      // 0x0360(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_361[0x17];                                     // 0x0361(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheatSetStaminaPercent(const float StaminaPercent);
	void HandleRiderEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void HandleRiderStartedRiding(class URiderComponent* Rider);
	void HandleRiderStoppedRiding(class URiderComponent* Rider);
	void OnRep_ActiveRider();

	bool CanBePet(class URiderComponent* Rider) const;
	bool CanBeRiddenBP(class URiderComponent* Rider) const;
	bool CanRiderPlayEmote(const class URiderComponent* Rider) const;
	const struct FRidingPettingData GetPettingData() const;
	class USceneComponent* GetRidingAttachComponent() const;
	void GetRidingCapsuleSize(const class URiderComponent* Rider, float OriginalRadius, float OriginalHalfHeight, float* OutRadius, float* OutHalfHeight) const;
	void GetRidingEmoteCapsuleSize(const class URiderComponent* Rider, float OriginalRadius, float OriginalHalfHeight, float* OutRadius, float* OutHalfHeight) const;
	bool IsBeingRidden() const;
	bool IsFlying() const;
	bool IsSprinting() const;
	bool ShouldCameraFocusOnRidable(const class URiderComponent* Rider) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RidableComponent">();
	}
	static class URidableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URidableComponent>();
	}
};
static_assert(alignof(URidableComponent) == 0x000008, "Wrong alignment on URidableComponent");
static_assert(sizeof(URidableComponent) == 0x000378, "Wrong size on URidableComponent");
static_assert(offsetof(URidableComponent, OnRiderStartedRiding) == 0x0000A8, "Member 'URidableComponent::OnRiderStartedRiding' has a wrong offset!");
static_assert(offsetof(URidableComponent, OnRiderStoppedRiding) == 0x0000B8, "Member 'URidableComponent::OnRiderStoppedRiding' has a wrong offset!");
static_assert(offsetof(URidableComponent, RiderAnimLayerOverlayClass) == 0x0000C8, "Member 'URidableComponent::RiderAnimLayerOverlayClass' has a wrong offset!");
static_assert(offsetof(URidableComponent, AttachSocket) == 0x0000D0, "Member 'URidableComponent::AttachSocket' has a wrong offset!");
static_assert(offsetof(URidableComponent, AttachLocationOffset) == 0x0000D8, "Member 'URidableComponent::AttachLocationOffset' has a wrong offset!");
static_assert(offsetof(URidableComponent, AttachRotationOffset) == 0x0000F0, "Member 'URidableComponent::AttachRotationOffset' has a wrong offset!");
static_assert(offsetof(URidableComponent, ClientAttachGuideSocket) == 0x000108, "Member 'URidableComponent::ClientAttachGuideSocket' has a wrong offset!");
static_assert(offsetof(URidableComponent, ClientAttachGuideLocationOffset) == 0x000110, "Member 'URidableComponent::ClientAttachGuideLocationOffset' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidablePropAttachSocket) == 0x000128, "Member 'URidableComponent::RidablePropAttachSocket' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidablePropAttachLocationOffset) == 0x000130, "Member 'URidableComponent::RidablePropAttachLocationOffset' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidablePropAttachRotationOffset) == 0x000148, "Member 'URidableComponent::RidablePropAttachRotationOffset' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidablePropAttachScale) == 0x000160, "Member 'URidableComponent::RidablePropAttachScale' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidablePropAttachRiderVerticalBuffer) == 0x000164, "Member 'URidableComponent::RidablePropAttachRiderVerticalBuffer' has a wrong offset!");
static_assert(offsetof(URidableComponent, RiderPropAttachBoundsOverride) == 0x000168, "Member 'URidableComponent::RiderPropAttachBoundsOverride' has a wrong offset!");
static_assert(offsetof(URidableComponent, bOverrideNoiseGeneration) == 0x0001A0, "Member 'URidableComponent::bOverrideNoiseGeneration' has a wrong offset!");
static_assert(offsetof(URidableComponent, RiderMovementNoiseOverride) == 0x0001A4, "Member 'URidableComponent::RiderMovementNoiseOverride' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidableTag) == 0x0001B0, "Member 'URidableComponent::RidableTag' has a wrong offset!");
static_assert(offsetof(URidableComponent, EnergyDepletedTag) == 0x0001B4, "Member 'URidableComponent::EnergyDepletedTag' has a wrong offset!");
static_assert(offsetof(URidableComponent, PlaylistTagBlacklistRowHandle) == 0x0001B8, "Member 'URidableComponent::PlaylistTagBlacklistRowHandle' has a wrong offset!");
static_assert(offsetof(URidableComponent, ActiveRider) == 0x0001C8, "Member 'URidableComponent::ActiveRider' has a wrong offset!");
static_assert(offsetof(URidableComponent, LastRider) == 0x0001D0, "Member 'URidableComponent::LastRider' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidableProp) == 0x0001D8, "Member 'URidableComponent::RidableProp' has a wrong offset!");
static_assert(offsetof(URidableComponent, OriginalCapsuleRadius) == 0x0001E0, "Member 'URidableComponent::OriginalCapsuleRadius' has a wrong offset!");
static_assert(offsetof(URidableComponent, OriginalCapsuleHalfHeight) == 0x0001E4, "Member 'URidableComponent::OriginalCapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidingCapsuleRadius) == 0x0001E8, "Member 'URidableComponent::RidingCapsuleRadius' has a wrong offset!");
static_assert(offsetof(URidableComponent, RidingCapsuleHalfHeight) == 0x0001EC, "Member 'URidableComponent::RidingCapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(URidableComponent, bOriginalClientPositionSmoothingThrottlingSetting) == 0x0001F0, "Member 'URidableComponent::bOriginalClientPositionSmoothingThrottlingSetting' has a wrong offset!");
static_assert(offsetof(URidableComponent, MaxHalfAimingAngle) == 0x0001F8, "Member 'URidableComponent::MaxHalfAimingAngle' has a wrong offset!");
static_assert(offsetof(URidableComponent, PrimaryFireMontageAnimCoreTypeOverrides) == 0x000220, "Member 'URidableComponent::PrimaryFireMontageAnimCoreTypeOverrides' has a wrong offset!");
static_assert(offsetof(URidableComponent, PrimaryFireMontageTagOverrides) == 0x000230, "Member 'URidableComponent::PrimaryFireMontageTagOverrides' has a wrong offset!");
static_assert(offsetof(URidableComponent, PettingData) == 0x000240, "Member 'URidableComponent::PettingData' has a wrong offset!");
static_assert(offsetof(URidableComponent, RestoreCollisionHandle) == 0x000348, "Member 'URidableComponent::RestoreCollisionHandle' has a wrong offset!");
static_assert(offsetof(URidableComponent, bIsSprinting) == 0x000360, "Member 'URidableComponent::bIsSprinting' has a wrong offset!");

// Class RidingCodeRuntime.ControllableRidableComponent
// 0x0250 (0x05C8 - 0x0378)
class UControllableRidableComponent : public URidableComponent
{
public:
