#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBMusicalTargets

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SBMusicalTargets.SBMusicalTargetsCueId
// 0x0010 (0x0010 - 0x0000)
struct FSBMusicalTargetsCueId final
{
public:
	int32                                         IdNumber;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Beat;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBMusicalTargetsCueId) == 0x000004, "Wrong alignment on FSBMusicalTargetsCueId");
static_assert(sizeof(FSBMusicalTargetsCueId) == 0x000010, "Wrong size on FSBMusicalTargetsCueId");
static_assert(offsetof(FSBMusicalTargetsCueId, IdNumber) == 0x000000, "Member 'FSBMusicalTargetsCueId::IdNumber' has a wrong offset!");
static_assert(offsetof(FSBMusicalTargetsCueId, Beat) == 0x000004, "Member 'FSBMusicalTargetsCueId::Beat' has a wrong offset!");
static_assert(offsetof(FSBMusicalTargetsCueId, TargetIndex) == 0x000008, "Member 'FSBMusicalTargetsCueId::TargetIndex' has a wrong offset!");

}

