#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SentryRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SentryRuntime.CreativeSentryAnimInstance
// 0x0020 (0x05B0 - 0x0590)
class UCreativeSentryAnimInstance final : public UFortDefenderAnimInstance
{
public:
	float                                         RotateAimAnimationPitch;                           // 0x0588(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CounterRotateAimAnimationPitch;                    // 0x058C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRelaxedLevel1OrNotTargeting;                    // 0x0590(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RightHandIKAlpha;                                  // 0x0594(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OneMinusLeftHandFK;                                // 0x0598(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftHandIKAlpha;                                   // 0x059C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RetargetHandIKBonesToFKPositionWeight;             // 0x05A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A4[0xC];                                      // 0x05A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeSentryAnimInstance">();
	}
	static class UCreativeSentryAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeSentryAnimInstance>();
	}
};
static_assert(alignof(UCreativeSentryAnimInstance) == 0x000010, "Wrong alignment on UCreativeSentryAnimInstance");
static_assert(sizeof(UCreativeSentryAnimInstance) == 0x0005B0, "Wrong size on UCreativeSentryAnimInstance");
static_assert(offsetof(UCreativeSentryAnimInstance, RotateAimAnimationPitch) == 0x000588, "Member 'UCreativeSentryAnimInstance::RotateAimAnimationPitch' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, CounterRotateAimAnimationPitch) == 0x00058C, "Member 'UCreativeSentryAnimInstance::CounterRotateAimAnimationPitch' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, bIsRelaxedLevel1OrNotTargeting) == 0x000590, "Member 'UCreativeSentryAnimInstance::bIsRelaxedLevel1OrNotTargeting' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, RightHandIKAlpha) == 0x000594, "Member 'UCreativeSentryAnimInstance::RightHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, OneMinusLeftHandFK) == 0x000598, "Member 'UCreativeSentryAnimInstance::OneMinusLeftHandFK' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, LeftHandIKAlpha) == 0x00059C, "Member 'UCreativeSentryAnimInstance::LeftHandIKAlpha' has a wrong offset!");
static_assert(offsetof(UCreativeSentryAnimInstance, RetargetHandIKBonesToFKPositionWeight) == 0x0005A0, "Member 'UCreativeSentryAnimInstance::RetargetHandIKBonesToFKPositionWeight' has a wrong offset!");

}

