#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyPanel

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BrandingToggle
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_BrandingToggle final
{
public:
	bool                                          hasBranding;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BrandingToggle) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_BrandingToggle");
static_assert(sizeof(ShowdownLobbyPanel_C_BrandingToggle) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_BrandingToggle");
static_assert(offsetof(ShowdownLobbyPanel_C_BrandingToggle, hasBranding) == 0x000000, "Member 'ShowdownLobbyPanel_C_BrandingToggle::hasBranding' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.EventSwitchUI
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_EventSwitchUI final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_EventSwitchUI");
static_assert(sizeof(ShowdownLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_EventSwitchUI");
static_assert(offsetof(ShowdownLobbyPanel_C_EventSwitchUI, bNewInputType) == 0x000000, "Member 'ShowdownLobbyPanel_C_EventSwitchUI::bNewInputType' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.ExecuteUbergraph_ShowdownLobbyPanel
// 0x0210 (0x0210 - 0x0000)
struct ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x006C(0x0014)()
	double                                        K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCommonButtonLegacy*                    K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_3;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0108(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_hasBranding;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_4;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast_1;  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast_2; // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast_3; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel");
static_assert(sizeof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel) == 0x000210, "Wrong size on ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, EntryPoint) == 0x000000, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CustomEvent_bNewInputType) == 0x000004, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_byte_Variable) == 0x00001C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_byte_Variable_1) == 0x00001D, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable) == 0x00001E, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_1) == 0x00001F, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_real_Variable) == 0x000020, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_real_Variable_1) == 0x000028, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_2) == 0x000030, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_3) == 0x000031, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_real_Variable_2) == 0x000040, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_IsUsingGamepad_ReturnValue) == 0x000048, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_real_Variable_3) == 0x000050, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000058, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_4) == 0x000068, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_SlateColor) == 0x00006C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default) == 0x000080, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Margin) == 0x000088, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetStartTime_ReturnValue) == 0x0000A0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetEndTime_ReturnValue) == 0x0000A4, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetStartTime_ReturnValue_1) == 0x0000A8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetStartTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetEndTime_ReturnValue_1) == 0x0000AC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetContext_ReturnValue_1) == 0x0000B0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue) == 0x0000B8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue_1) == 0x0000BC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue_2) == 0x0000E0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue_3) == 0x0000E4, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue_1) == 0x000100, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000108, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000118, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_real_Variable_4) == 0x000120, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Event_IsDesignTime) == 0x000128, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000130, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable_5) == 0x000138, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_real_Variable_5) == 0x000140, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_1) == 0x000148, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue_2) == 0x000150, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_2) == 0x000158, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CustomEvent_hasBranding) == 0x000160, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CustomEvent_hasBranding' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue_3) == 0x000168, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_3) == 0x000170, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_4) == 0x000178, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Margin_1) == 0x000180, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default_5) == 0x000190, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Right_ImplicitCast) == 0x000194, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000198, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast) == 0x0001A0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0001A8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0001B0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast_1) == 0x0001B8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0001C0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0001C8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0001D0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0001D8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x0001E0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0001E8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x0001F0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0001F8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1) == 0x000200, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast_2) == 0x000204, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_StartAtTime_ImplicitCast_3) == 0x000208, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_StartAtTime_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Top_ImplicitCast) == 0x00020C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.InputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_InputTypeChanged final
{
public:
	bool                                          isGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_InputTypeChanged");
static_assert(sizeof(ShowdownLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_InputTypeChanged");
static_assert(offsetof(ShowdownLobbyPanel_C_InputTypeChanged, isGamepad) == 0x000000, "Member 'ShowdownLobbyPanel_C_InputTypeChanged::isGamepad' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_PreConstruct) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_PreConstruct");
static_assert(sizeof(ShowdownLobbyPanel_C_PreConstruct) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_PreConstruct");
static_assert(offsetof(ShowdownLobbyPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ShowdownLobbyPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.Refresh
// 0x0420 (0x0420 - 0x0000)
struct ShowdownLobbyPanel_C_Refresh final
{
public:
	EFortShowdownEventState                       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesScheduledMatchmaking_ReturnValue;     // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesScheduledMatchmaking_ReturnValue_1;   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsesScheduledMatchmaking_ReturnValue_2;   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTournamentSeriesId_ReturnValue;        // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue;  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWorldCupQualifierEvent_ReturnValue;     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventTimeState_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue;      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoCalloutMFARequirement_ReturnValue_1;    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue_1; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue_1;      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0118(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue_1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0018)()
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue_2;      // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A7[0x1];                                      // 0x01A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01B0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01C8(0x0018)()
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue_1;       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x01E8(0x0018)()
	int32                                         CallFunc_GetBestEventScore_ReturnValue;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0218(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0268(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0280(0x0018)()
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue_2;       // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x02A0(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x02CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0308(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0320(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0338(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_2;                // 0x0350(0x0018)()
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue_2; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F[0x1];                                      // 0x036F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0370(0x0018)()
	class UWidget*                                K2Node_Select_Default_5;                           // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
