#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarButton.SidebarButton_C.ExecuteUbergraph_SidebarButton
// 0x0148 (0x0148 - 0x0000)
struct SidebarButton_C_ExecuteUbergraph_SidebarButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0098(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00AC(0x0014)()
	double                                        Temp_real_Variable_2;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00C8(0x0014)()
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_4;                // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00FC(0x0014)()
	double                                        K2Node_Select_Default_1;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_5;                // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0128(0x0014)()
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarButton_C_ExecuteUbergraph_SidebarButton) == 0x000008, "Wrong alignment on SidebarButton_C_ExecuteUbergraph_SidebarButton");
static_assert(sizeof(SidebarButton_C_ExecuteUbergraph_SidebarButton) == 0x000148, "Wrong size on SidebarButton_C_ExecuteUbergraph_SidebarButton");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, EntryPoint) == 0x000000, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_real_Variable) == 0x000008, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_IsUsingTouch_ReturnValue) == 0x000028, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_IsMobileGame_ReturnValue) == 0x00002A, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_real_Variable_1) == 0x000030, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_bool_Variable) == 0x000038, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_Select_Default) == 0x000040, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000048, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_Event_IsDesignTime) == 0x000050, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_GetSelected_ReturnValue) == 0x000051, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue) == 0x000054, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_IsHovered_ReturnValue) == 0x000064, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_GetSelected_ReturnValue_1) == 0x000065, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_GetSelected_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_1) == 0x000068, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_2) == 0x000078, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_3) == 0x000088, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor) == 0x000098, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_1) == 0x0000AC, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_real_Variable_2) == 0x0000C0, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_2) == 0x0000C8, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_real_Variable_3) == 0x0000E0, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_4) == 0x0000E8, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, Temp_bool_Variable_1) == 0x0000F8, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_3) == 0x0000FC, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_Select_Default_1) == 0x000110, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SelectColor_ReturnValue_5) == 0x000118, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SelectColor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, K2Node_MakeStruct_SlateColor_4) == 0x000128, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00013C, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_ExecuteUbergraph_SidebarButton, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000140, "Member 'SidebarButton_C_ExecuteUbergraph_SidebarButton::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function SidebarButton.SidebarButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SidebarButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarButton_C_PreConstruct) == 0x000001, "Wrong alignment on SidebarButton_C_PreConstruct");
static_assert(sizeof(SidebarButton_C_PreConstruct) == 0x000001, "Wrong size on SidebarButton_C_PreConstruct");
static_assert(offsetof(SidebarButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SidebarButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SidebarButton.SidebarButton_C.SetSkewBoxColor
// 0x0018 (0x0018 - 0x0000)
struct SidebarButton_C_SetSkewBoxColor final
{
public:
	struct FLinearColor                           InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarButton_C_SetSkewBoxColor) == 0x000008, "Wrong alignment on SidebarButton_C_SetSkewBoxColor");
static_assert(sizeof(SidebarButton_C_SetSkewBoxColor) == 0x000018, "Wrong size on SidebarButton_C_SetSkewBoxColor");
static_assert(offsetof(SidebarButton_C_SetSkewBoxColor, InputPin) == 0x000000, "Member 'SidebarButton_C_SetSkewBoxColor::InputPin' has a wrong offset!");
static_assert(offsetof(SidebarButton_C_SetSkewBoxColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'SidebarButton_C_SetSkewBoxColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

