#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSpecialNavWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarSpecialNavWidget.SidebarSpecialNavWidget_C.ExecuteUbergraph_SidebarSpecialNavWidget
// 0x0028 (0x0028 - 0x0000)
struct SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget) == 0x000008, "Wrong alignment on SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget");
static_assert(sizeof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget) == 0x000028, "Wrong size on SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, EntryPoint) == 0x000000, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, K2Node_MakeStruct_Margin) == 0x000004, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000018, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget, CallFunc_IsMobileGame_ReturnValue) == 0x000020, "Member 'SidebarSpecialNavWidget_C_ExecuteUbergraph_SidebarSpecialNavWidget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");

}

