#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarJoinablePartyActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarJoinablePartyActionMenu.SidebarJoinablePartyActionMenu_C
// 0x0020 (0x04D0 - 0x04B0)
class USidebarJoinablePartyActionMenu_C final : public UFortJoinablePartyActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_PartyMembers;                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarJoinablePartyActionMenu(int32 EntryPoint);
	void OnOpened();
	void OnToggleConfirmation(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarJoinablePartyActionMenu_C">();
	}
	static class USidebarJoinablePartyActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarJoinablePartyActionMenu_C>();
	}
};
static_assert(alignof(USidebarJoinablePartyActionMenu_C) == 0x000008, "Wrong alignment on USidebarJoinablePartyActionMenu_C");
static_assert(sizeof(USidebarJoinablePartyActionMenu_C) == 0x0004D0, "Wrong size on USidebarJoinablePartyActionMenu_C");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, UberGraphFrame) == 0x0004B0, "Member 'USidebarJoinablePartyActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, ConfirmationOpened) == 0x0004B8, "Member 'USidebarJoinablePartyActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, Opened) == 0x0004C0, "Member 'USidebarJoinablePartyActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(USidebarJoinablePartyActionMenu_C, CommonRichTextBlock_PartyMembers) == 0x0004C8, "Member 'USidebarJoinablePartyActionMenu_C::CommonRichTextBlock_PartyMembers' has a wrong offset!");

}

