#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserListEntry_XS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarUserListEntry_XS.SidebarUserListEntry_XS_C
// 0x0080 (0x1570 - 0x14F0)
class USidebarUserListEntry_XS_C final : public UFortSocialUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x1500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_1;                                        // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_LastInteraction;                          // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_SocialName;                               // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_DisplayName;                                  // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x1540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x1550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USocialTagWidget*>               SidebarSocialTagWidgetArray;                       // 0x1560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnEntryReleased();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SidebarUserListEntry_XS(int32 EntryPoint);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void OnInitialized();
	void OnNewAvatarsEnabledChanged(bool bUsingNewAvatars);
	void SetUnhoverState(bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarUserListEntry_XS_C">();
	}
	static class USidebarUserListEntry_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarUserListEntry_XS_C>();
	}
};
static_assert(alignof(USidebarUserListEntry_XS_C) == 0x000010, "Wrong alignment on USidebarUserListEntry_XS_C");
static_assert(sizeof(USidebarUserListEntry_XS_C) == 0x001570, "Wrong size on USidebarUserListEntry_XS_C");
static_assert(offsetof(USidebarUserListEntry_XS_C, UberGraphFrame) == 0x0014F0, "Member 'USidebarUserListEntry_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, Unhovered) == 0x0014F8, "Member 'USidebarUserListEntry_XS_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, Selected) == 0x001500, "Member 'USidebarUserListEntry_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, Hovered) == 0x001508, "Member 'USidebarUserListEntry_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x001510, "Member 'USidebarUserListEntry_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, ScaleBox_1) == 0x001518, "Member 'USidebarUserListEntry_XS_C::ScaleBox_1' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, Switcher_LastInteraction) == 0x001520, "Member 'USidebarUserListEntry_XS_C::Switcher_LastInteraction' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, Switcher_SocialName) == 0x001528, "Member 'USidebarUserListEntry_XS_C::Switcher_SocialName' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, Text_DisplayName) == 0x001530, "Member 'USidebarUserListEntry_XS_C::Text_DisplayName' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, UserActionMenuInputButton) == 0x001538, "Member 'USidebarUserListEntry_XS_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, EncourageEpicFriend_IdleColor) == 0x001540, "Member 'USidebarUserListEntry_XS_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, EncourageEpicFriend_HoveredColor) == 0x001550, "Member 'USidebarUserListEntry_XS_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(USidebarUserListEntry_XS_C, SidebarSocialTagWidgetArray) == 0x001560, "Member 'USidebarUserListEntry_XS_C::SidebarSocialTagWidgetArray' has a wrong offset!");

}

