#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarInviteListEntry_FriendInvite_XS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarInviteListEntry_FriendInvite_XS.SidebarInviteListEntry_FriendInvite_XS_C
// 0x0090 (0x1560 - 0x14D0)
class USidebarInviteListEntry_FriendInvite_XS_C final : public UFortConnectionsUserListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x14D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x14E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x14E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Notification;                                // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_LastInteraction;                          // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_MutualFriends;                            // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_SocialName;                               // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x1528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x1538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x1548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarInviteListEntry_FriendInvite_XS(int32 EntryPoint);
	void HandleOnlineIndicatorView(uint8 OnlineStatus);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnNewAvatarsEnabledChanged(bool bUsingNewAvatars);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarInviteListEntry_FriendInvite_XS_C">();
	}
	static class USidebarInviteListEntry_FriendInvite_XS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarInviteListEntry_FriendInvite_XS_C>();
	}
};
static_assert(alignof(USidebarInviteListEntry_FriendInvite_XS_C) == 0x000010, "Wrong alignment on USidebarInviteListEntry_FriendInvite_XS_C");
static_assert(sizeof(USidebarInviteListEntry_FriendInvite_XS_C) == 0x001560, "Wrong size on USidebarInviteListEntry_FriendInvite_XS_C");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, UberGraphFrame) == 0x0014D0, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Unhovered) == 0x0014D8, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Selected) == 0x0014E0, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Hovered) == 0x0014E8, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Border_OnlineStatusIndicator) == 0x0014F0, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, EmptyButtonToEatOneMouseUpEvent) == 0x0014F8, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, EntryBorder) == 0x001500, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Image_Notification) == 0x001508, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Image_Notification' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Switcher_LastInteraction) == 0x001510, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Switcher_LastInteraction' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Switcher_MutualFriends) == 0x001518, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Switcher_MutualFriends' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Switcher_SocialName) == 0x001520, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Switcher_SocialName' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Online) == 0x001528, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Online' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Offline) == 0x001538, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Offline' has a wrong offset!");
static_assert(offsetof(USidebarInviteListEntry_FriendInvite_XS_C, Away) == 0x001548, "Member 'USidebarInviteListEntry_FriendInvite_XS_C::Away' has a wrong offset!");

}

