#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSettingsListEntry_Discrete_Narrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSettingsListEntry_Discrete_Narrow.SidebarSettingsListEntry_Discrete_Narrow_C
// 0x0038 (0x0338 - 0x0300)
class USidebarSettingsListEntry_Discrete_Narrow_C final : public UFortSettingsListEntrySetting_Discrete
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_FirstOption;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_SecondOption;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OptionsSets;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Several_Options;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarSettingEntryBackground_C*       SidebarSettingEntryBackground;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow(int32 EntryPoint);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void OnEditableStateChanged(const bool bIsEditable);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSettingsListEntry_Discrete_Narrow_C">();
	}
	static class USidebarSettingsListEntry_Discrete_Narrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSettingsListEntry_Discrete_Narrow_C>();
	}
};
static_assert(alignof(USidebarSettingsListEntry_Discrete_Narrow_C) == 0x000008, "Wrong alignment on USidebarSettingsListEntry_Discrete_Narrow_C");
static_assert(sizeof(USidebarSettingsListEntry_Discrete_Narrow_C) == 0x000338, "Wrong size on USidebarSettingsListEntry_Discrete_Narrow_C");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, UberGraphFrame) == 0x000300, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, OnHover) == 0x000308, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, Button_FirstOption) == 0x000310, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::Button_FirstOption' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, Button_SecondOption) == 0x000318, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::Button_SecondOption' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, OptionsSets) == 0x000320, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::OptionsSets' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, Several_Options) == 0x000328, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::Several_Options' has a wrong offset!");
static_assert(offsetof(USidebarSettingsListEntry_Discrete_Narrow_C, SidebarSettingEntryBackground) == 0x000330, "Member 'USidebarSettingsListEntry_Discrete_Narrow_C::SidebarSettingEntryBackground' has a wrong offset!");

}

