#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarUserListHeaderEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarUserListHeaderEntry.SidebarUserListHeaderEntry_C
// 0x0030 (0x1490 - 0x1460)
class USidebarUserListHeaderEntry_C final : public USocialUserListHeaderEntry
{
public:
	uint8                                         Pad_1458[0x8];                                     // 0x1458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x1468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x1470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x1478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Meeple;                                      // 0x1480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_EntryContent;                                   // 0x1488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarUserListHeaderEntry(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnListItemObjectSet_1(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarUserListHeaderEntry_C">();
	}
	static class USidebarUserListHeaderEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarUserListHeaderEntry_C>();
	}
};
static_assert(alignof(USidebarUserListHeaderEntry_C) == 0x000010, "Wrong alignment on USidebarUserListHeaderEntry_C");
static_assert(sizeof(USidebarUserListHeaderEntry_C) == 0x001490, "Wrong size on USidebarUserListHeaderEntry_C");
static_assert(offsetof(USidebarUserListHeaderEntry_C, UberGraphFrame) == 0x001460, "Member 'USidebarUserListHeaderEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, OnExpansion) == 0x001468, "Member 'USidebarUserListHeaderEntry_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, OnHover) == 0x001470, "Member 'USidebarUserListHeaderEntry_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, ExpandDirectionTick) == 0x001478, "Member 'USidebarUserListHeaderEntry_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, Image_Meeple) == 0x001480, "Member 'USidebarUserListHeaderEntry_C::Image_Meeple' has a wrong offset!");
static_assert(offsetof(USidebarUserListHeaderEntry_C, SB_EntryContent) == 0x001488, "Member 'USidebarUserListHeaderEntry_C::SB_EntryContent' has a wrong offset!");

}

