#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarLFGChangeTagsButtonListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarLFGChangeTagsButtonListEntry.SidebarLFGChangeTagsButtonListEntry_C
// 0x0060 (0x14C0 - 0x1460)
class USidebarLFGChangeTagsButtonListEntry_C final : public USocialListInteractableEntryBase
{
public:
	uint8                                         Pad_1458[0x8];                                     // 0x1458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x1468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimatedInputBorder;                               // 0x1478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x1488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x1490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x14A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_ChangeTagsText;                               // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarLFGChangeTagsButtonListEntry(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarLFGChangeTagsButtonListEntry_C">();
	}
	static class USidebarLFGChangeTagsButtonListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarLFGChangeTagsButtonListEntry_C>();
	}
};
static_assert(alignof(USidebarLFGChangeTagsButtonListEntry_C) == 0x000010, "Wrong alignment on USidebarLFGChangeTagsButtonListEntry_C");
static_assert(sizeof(USidebarLFGChangeTagsButtonListEntry_C) == 0x0014C0, "Wrong size on USidebarLFGChangeTagsButtonListEntry_C");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, UberGraphFrame) == 0x001460, "Member 'USidebarLFGChangeTagsButtonListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Selected) == 0x001468, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Hovered) == 0x001470, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, AnimatedInputBorder) == 0x001478, "Member 'USidebarLFGChangeTagsButtonListEntry_C::AnimatedInputBorder' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Arrow) == 0x001480, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, EmptyButtonToEatOneMouseUpEvent) == 0x001488, "Member 'USidebarLFGChangeTagsButtonListEntry_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, EntryBorder) == 0x001490, "Member 'USidebarLFGChangeTagsButtonListEntry_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, HorizontalBox_0) == 0x001498, "Member 'USidebarLFGChangeTagsButtonListEntry_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, SizeBox_0) == 0x0014A0, "Member 'USidebarLFGChangeTagsButtonListEntry_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, Text_ChangeTagsText) == 0x0014A8, "Member 'USidebarLFGChangeTagsButtonListEntry_C::Text_ChangeTagsText' has a wrong offset!");
static_assert(offsetof(USidebarLFGChangeTagsButtonListEntry_C, UserActionMenuInputButton) == 0x0014B0, "Member 'USidebarLFGChangeTagsButtonListEntry_C::UserActionMenuInputButton' has a wrong offset!");

}

