#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SiderbarSupervisedSettingsTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function SiderbarSupervisedSettingsTooltip.SiderbarSupervisedSettingsTooltip_C.ExecuteUbergraph_SiderbarSupervisedSettingsTooltip
// 0x0030 (0x0030 - 0x0000)
struct SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip) == 0x000008, "Wrong alignment on SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip");
static_assert(sizeof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip) == 0x000030, "Wrong size on SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip");
static_assert(offsetof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip, EntryPoint) == 0x000000, "Member 'SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000010, "Member 'SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000018, "Member 'SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'SiderbarSupervisedSettingsTooltip_C_ExecuteUbergraph_SiderbarSupervisedSettingsTooltip::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

