#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarMainMenu.SidebarMainMenu_C
// 0x02C0 (0x0828 - 0x0568)
class USidebarMainMenu_C final : public UFortBladeMenu_MainMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Drill_In;                                          // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMainMenuButton_C*                      AthenaMainMenuClearPlayerDataButton;               // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_LegalInformation;                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_MyIsland;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_ReportBugOrPlayer;                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Button_SupportSubMenu;                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonBacchusHelp;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonCredits;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonHUDLayoutTool;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ButtonNews;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      CheatsButton;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ConsoleButton;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      DisableModeratorModeButton;                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      EnableModeratorModeButton;                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ExportIslandButton;                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      Legal;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveStreamMenuButtonToggle_C*          LiveStreamMenuButtonToggle;                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      LockerButton;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ModeratorMode;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      NewPlayerFeedback;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ParentalControlsButton;                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      RespawnButton;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      ReturnOrCancelPurchase;                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Content;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneRatingIcons;                               // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenuButton_C*                      TeamSelectButton;                                  // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_VoiceChatTitle;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextLowPowerMode;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_MainMenuButtons;                              // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_MainMenuButtons_Legal;                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_MainMenuButtons_Reporting;                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_MainMenuButtons_SupportAndRefunds;            // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CreditsScreenClass;                                // 0x0670(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   LegalInfoClass;                                    // 0x0698(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   RespawnClass;                                      // 0x06C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MobileControlsHelpClass;                           // 0x06E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AFortMinigameSettingsBuilding*          Machine;                                           // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   TeamSelectWidgetClass;                             // 0x0718(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   SettingTabToOpen;                                  // 0x0740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   AthenaMOTDWidget;                                  // 0x0748(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ParentalControlsClass_New;                         // 0x0770(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PlayerClearIslandDataClass;                        // 0x0798(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Player_Clear_Persistence_Data_Pregame_Description; // 0x07C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Player_Clear_Persistence_Data_in_Progress_Description; // 0x07D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortMinigame*                          LastMinigame;                                      // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReportButtonText_Creative;                         // 0x07F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReportButtonText_Default;                          // 0x0810(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Bind_To_State_Change_Delegate();
	void BndEvt__AthenaMainMenuClearPlayerDataButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Button_BackToHub_1_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ButtonBacchusHelp_K2Node_ComponentBoundEvent_294_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ButtonCredits_K2Node_ComponentBoundEvent_1184_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ButtonHUDLayoutTool_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ButtonNews_K2Node_ComponentBoundEvent_376_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__CheatsButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ConsoleButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__EnableModeratorModeButton_1_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__EnableModeratorModeButton_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ExportIslandButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__Legal_K2Node_ComponentBoundEvent_146_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__LockerButton_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__MinigameButtons_K2Node_ComponentBoundEvent_3_StartButtonClicked__DelegateSignature();
	void BndEvt__MinigameButtons_K2Node_ComponentBoundEvent_4_EndButtonClicked__DelegateSignature();
	void BndEvt__NewPlayerFeedback_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ParentalControlsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__RespawnButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarMainMenu_Button_LegalInformation_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarMainMenu_Button_ReportBugOrPlayer_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarMainMenu_Button_SupportLink_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarMainMenu_ReturnOrCancelPurchase_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__SidebarMainMenu_SidebarBackButton_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__TeamSelectButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void Close();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_SidebarMainMenu(int32 EntryPoint);
	void FakeSidebarBackButtonClick();
	void Handle_Low_Power_Mode();
	void Handle_On_Is_Creative_Moderator_Mode_Active_Changed(bool bIsCreativeModeratorModeActive);
	void InitializeMainMenu();
	void OnComplete_0291153C4AC0D1156C271F9118E569A1(class UUserWidget* UserWidget);
	void OnComplete_5F00D0CF4D9E12AAB69866A846D583D6(class UUserWidget* UserWidget);
	void OnComplete_6050D62B44E0DCCC7901A8A6F68E2DC5(class UUserWidget* UserWidget);
	void OnComplete_611E1BC6484238364A9971999FE6F5A2(class UUserWidget* UserWidget);
	void OnComplete_647CD804498A28A84AB5E1BAA1B3B9CF(class UUserWidget* UserWidget);
	void OnComplete_7C6F207D4CDF21EB8BD8A0B2F614AA03(class UUserWidget* UserWidget);
	void OnComplete_A8101A2145286C49CFF50A97984010E3(class UUserWidget* UserWidget);
	void OnComplete_B99DAD204A5DFFFB9673D086E81E1E79(class UUserWidget* UserWidget);
	void OnComplete_C268EAF94DCFCF67F17632BDBF6AC40F(class UUserWidget* UserWidget);
	void OnComplete_CE01A3094981560CC63CA1B171C855B3(class UUserWidget* UserWidget);
	void OnComplete_D16AF2704BEFE18C7BD980843C02589F(class UUserWidget* UserWidget);
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void OnRefreshOptions();
	void SetLegalButtonVisibility();
	void SetSupportButtonVisibility();
	void ShowMinigameButtons(class AFortPlayerControllerAthena* Player, class AFortGameStateAthena* FortGameStateAthena, bool* bResult);
	void SwitchSubMenu(int32 Index_0);
	void Update_Team_Select_Visibility();
	void UpdateButtons();
	void UpdateCreativeButtonsVisibility();
	void UpdateLowPowerMessage(bool PassThrough);
	void UpdateMinigameButtons();
	void UpdateRespawnWidgetVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarMainMenu_C">();
	}
	static class USidebarMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarMainMenu_C>();
	}
};
static_assert(alignof(USidebarMainMenu_C) == 0x000008, "Wrong alignment on USidebarMainMenu_C");
static_assert(sizeof(USidebarMainMenu_C) == 0x000828, "Wrong size on USidebarMainMenu_C");
static_assert(offsetof(USidebarMainMenu_C, UberGraphFrame) == 0x000568, "Member 'USidebarMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Drill_In) == 0x000570, "Member 'USidebarMainMenu_C::Drill_In' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, AthenaMainMenuClearPlayerDataButton) == 0x000578, "Member 'USidebarMainMenu_C::AthenaMainMenuClearPlayerDataButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Button_LegalInformation) == 0x000580, "Member 'USidebarMainMenu_C::Button_LegalInformation' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Button_MyIsland) == 0x000588, "Member 'USidebarMainMenu_C::Button_MyIsland' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Button_ReportBugOrPlayer) == 0x000590, "Member 'USidebarMainMenu_C::Button_ReportBugOrPlayer' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Button_SupportSubMenu) == 0x000598, "Member 'USidebarMainMenu_C::Button_SupportSubMenu' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ButtonBacchusHelp) == 0x0005A0, "Member 'USidebarMainMenu_C::ButtonBacchusHelp' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ButtonCredits) == 0x0005A8, "Member 'USidebarMainMenu_C::ButtonCredits' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ButtonHUDLayoutTool) == 0x0005B0, "Member 'USidebarMainMenu_C::ButtonHUDLayoutTool' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ButtonNews) == 0x0005B8, "Member 'USidebarMainMenu_C::ButtonNews' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, CheatsButton) == 0x0005C0, "Member 'USidebarMainMenu_C::CheatsButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ConsoleButton) == 0x0005C8, "Member 'USidebarMainMenu_C::ConsoleButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, DisableModeratorModeButton) == 0x0005D0, "Member 'USidebarMainMenu_C::DisableModeratorModeButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, EnableModeratorModeButton) == 0x0005D8, "Member 'USidebarMainMenu_C::EnableModeratorModeButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ExportIslandButton) == 0x0005E0, "Member 'USidebarMainMenu_C::ExportIslandButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Legal) == 0x0005E8, "Member 'USidebarMainMenu_C::Legal' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, LiveStreamMenuButtonToggle) == 0x0005F0, "Member 'USidebarMainMenu_C::LiveStreamMenuButtonToggle' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, LockerButton) == 0x0005F8, "Member 'USidebarMainMenu_C::LockerButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ModeratorMode) == 0x000600, "Member 'USidebarMainMenu_C::ModeratorMode' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, NewPlayerFeedback) == 0x000608, "Member 'USidebarMainMenu_C::NewPlayerFeedback' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ParentalControlsButton) == 0x000610, "Member 'USidebarMainMenu_C::ParentalControlsButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, RespawnButton) == 0x000618, "Member 'USidebarMainMenu_C::RespawnButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ReturnOrCancelPurchase) == 0x000620, "Member 'USidebarMainMenu_C::ReturnOrCancelPurchase' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, SafeZone_Content) == 0x000628, "Member 'USidebarMainMenu_C::SafeZone_Content' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, SafeZoneRatingIcons) == 0x000630, "Member 'USidebarMainMenu_C::SafeZoneRatingIcons' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, TeamSelectButton) == 0x000638, "Member 'USidebarMainMenu_C::TeamSelectButton' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Text_VoiceChatTitle) == 0x000640, "Member 'USidebarMainMenu_C::Text_VoiceChatTitle' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, TextLowPowerMode) == 0x000648, "Member 'USidebarMainMenu_C::TextLowPowerMode' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, VBox_MainMenuButtons) == 0x000650, "Member 'USidebarMainMenu_C::VBox_MainMenuButtons' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, VBox_MainMenuButtons_Legal) == 0x000658, "Member 'USidebarMainMenu_C::VBox_MainMenuButtons_Legal' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, VBox_MainMenuButtons_Reporting) == 0x000660, "Member 'USidebarMainMenu_C::VBox_MainMenuButtons_Reporting' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, VBox_MainMenuButtons_SupportAndRefunds) == 0x000668, "Member 'USidebarMainMenu_C::VBox_MainMenuButtons_SupportAndRefunds' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, CreditsScreenClass) == 0x000670, "Member 'USidebarMainMenu_C::CreditsScreenClass' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, LegalInfoClass) == 0x000698, "Member 'USidebarMainMenu_C::LegalInfoClass' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, RespawnClass) == 0x0006C0, "Member 'USidebarMainMenu_C::RespawnClass' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, MobileControlsHelpClass) == 0x0006E8, "Member 'USidebarMainMenu_C::MobileControlsHelpClass' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Machine) == 0x000710, "Member 'USidebarMainMenu_C::Machine' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, TeamSelectWidgetClass) == 0x000718, "Member 'USidebarMainMenu_C::TeamSelectWidgetClass' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, SettingTabToOpen) == 0x000740, "Member 'USidebarMainMenu_C::SettingTabToOpen' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, AthenaMOTDWidget) == 0x000748, "Member 'USidebarMainMenu_C::AthenaMOTDWidget' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ParentalControlsClass_New) == 0x000770, "Member 'USidebarMainMenu_C::ParentalControlsClass_New' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, PlayerClearIslandDataClass) == 0x000798, "Member 'USidebarMainMenu_C::PlayerClearIslandDataClass' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Player_Clear_Persistence_Data_Pregame_Description) == 0x0007C0, "Member 'USidebarMainMenu_C::Player_Clear_Persistence_Data_Pregame_Description' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, Player_Clear_Persistence_Data_in_Progress_Description) == 0x0007D8, "Member 'USidebarMainMenu_C::Player_Clear_Persistence_Data_in_Progress_Description' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, LastMinigame) == 0x0007F0, "Member 'USidebarMainMenu_C::LastMinigame' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ReportButtonText_Creative) == 0x0007F8, "Member 'USidebarMainMenu_C::ReportButtonText_Creative' has a wrong offset!");
static_assert(offsetof(USidebarMainMenu_C, ReportButtonText_Default) == 0x000810, "Member 'USidebarMainMenu_C::ReportButtonText_Default' has a wrong offset!");

}

