#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSettingsListEntry_Discrete_Narrow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SidebarSettingsListEntry_Discrete_Narrow.SidebarSettingsListEntry_Discrete_Narrow_C.ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow
// 0x01B8 (0x01B8 - 0x0000)
struct SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0098)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00F8(0x0098)(ConstParm)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USettingsRotator_Narrow_C*              K2Node_DynamicCast_AsSettings_Rotator_Narrow;      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USettingsRotator_Narrow_C*              K2Node_DynamicCast_AsSettings_Rotator_Narrow_1;    // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEditable;                          // 0x01B1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow) == 0x000008, "Wrong alignment on SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow");
static_assert(sizeof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow) == 0x0001B8, "Wrong size on SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, EntryPoint) == 0x000000, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, Temp_bool_Variable) == 0x000004, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, Temp_real_Variable) == 0x000008, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, Temp_real_Variable_1) == 0x00000C, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_Event_MyGeometry) == 0x000010, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000E8, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000F0, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_Event_MouseEvent) == 0x0000F8, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, CallFunc_IsUsingTouch_ReturnValue) == 0x000190, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_DynamicCast_AsSettings_Rotator_Narrow) == 0x000198, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_DynamicCast_AsSettings_Rotator_Narrow' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_DynamicCast_AsSettings_Rotator_Narrow_1) == 0x0001A8, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_DynamicCast_AsSettings_Rotator_Narrow_1' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_Event_bIsEditable) == 0x0001B1, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_Event_bIsEditable' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow, K2Node_Select_Default) == 0x0001B4, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_ExecuteUbergraph_SidebarSettingsListEntry_Discrete_Narrow::K2Node_Select_Default' has a wrong offset!");

// Function SidebarSettingsListEntry_Discrete_Narrow.SidebarSettingsListEntry_Discrete_Narrow_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function SidebarSettingsListEntry_Discrete_Narrow.SidebarSettingsListEntry_Discrete_Narrow_C.OnEditableStateChanged
// 0x0001 (0x0001 - 0x0000)
struct SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged final
{
public:
	bool                                          bIsEditable;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged) == 0x000001, "Wrong alignment on SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged");
static_assert(sizeof(SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged) == 0x000001, "Wrong size on SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged, bIsEditable) == 0x000000, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_OnEditableStateChanged::bIsEditable' has a wrong offset!");

// Function SidebarSettingsListEntry_Discrete_Narrow.SidebarSettingsListEntry_Discrete_Narrow_C.OnMouseEnter
// 0x00D8 (0x00D8 - 0x0000)
struct SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter) == 0x000008, "Wrong alignment on SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter");
static_assert(sizeof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter) == 0x0000D8, "Wrong size on SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SidebarSettingsListEntry_Discrete_Narrow.SidebarSettingsListEntry_Discrete_Narrow_C.OnMouseLeave
// 0x0098 (0x0098 - 0x0000)
struct SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave) == 0x000008, "Wrong alignment on SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave");
static_assert(sizeof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave) == 0x000098, "Wrong size on SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave");
static_assert(offsetof(SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SidebarSettingsListEntry_Discrete_Narrow_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

