#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarInteraction_Profile

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SidebarInteraction_Profile.SidebarInteraction_Profile_C.ExecuteUbergraph_SidebarInteraction_Profile
// 0x0050 (0x0050 - 0x0000)
struct SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformOnlyFriend_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetInteractionName_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile) == 0x000008, "Wrong alignment on SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile");
static_assert(sizeof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile) == 0x000050, "Wrong size on SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, EntryPoint) == 0x000000, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::EntryPoint' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_byte_Variable) == 0x000004, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_byte_Variable_1) == 0x000005, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_bool_Variable) == 0x000006, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_real_Variable) == 0x000008, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_real_Variable_1) == 0x000010, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_bool_Variable_1) == 0x000018, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_byte_Variable_2) == 0x000019, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_byte_Variable_3) == 0x00001A, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_IsPlatformOnlyFriend_ReturnValue) == 0x000030, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_IsPlatformOnlyFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_GetInteractionName_ReturnValue) == 0x000034, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_GetInteractionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000039, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, K2Node_Select_Default) == 0x00003A, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00003B, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_IsMobileGame_ReturnValue) == 0x00003D, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, K2Node_Select_Default_1) == 0x000040, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, Temp_bool_Variable_2) == 0x000048, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, K2Node_Select_Default_2) == 0x000049, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile, CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast) == 0x00004C, "Member 'SidebarInteraction_Profile_C_ExecuteUbergraph_SidebarInteraction_Profile::CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast' has a wrong offset!");

// Function SidebarInteraction_Profile.SidebarInteraction_Profile_C.SetArrow
// 0x0040 (0x0040 - 0x0000)
struct SidebarInteraction_Profile_C_SetArrow final
{
public:
	double                                        Temp_real_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSidebarSocialInteractionArrow            Temp_byte_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SidebarInteraction_Profile_C_SetArrow) == 0x000008, "Wrong alignment on SidebarInteraction_Profile_C_SetArrow");
static_assert(sizeof(SidebarInteraction_Profile_C_SetArrow) == 0x000040, "Wrong size on SidebarInteraction_Profile_C_SetArrow");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_real_Variable) == 0x000000, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_real_Variable_1) == 0x000008, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_real_Variable_2) == 0x000010, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_real_Variable_3) == 0x000018, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_real_Variable_4) == 0x000020, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_bool_Variable) == 0x000028, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_byte_Variable) == 0x000029, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_byte_Variable_1) == 0x00002A, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, Temp_byte_Variable_2) == 0x00002B, "Member 'SidebarInteraction_Profile_C_SetArrow::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'SidebarInteraction_Profile_C_SetArrow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, K2Node_Select_Default) == 0x000030, "Member 'SidebarInteraction_Profile_C_SetArrow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, K2Node_Select_Default_1) == 0x000038, "Member 'SidebarInteraction_Profile_C_SetArrow::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SidebarInteraction_Profile_C_SetArrow, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x00003C, "Member 'SidebarInteraction_Profile_C_SetArrow::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

}

