#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sidebar_FriendSearchBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Sidebar_FriendSearchBar.Sidebar_FriendSearchBar_C
// 0x0060 (0x1530 - 0x14D0)
class USidebar_FriendSearchBar_C final : public UFortFriendSearchButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x14D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AddFriendBanIcon;                                  // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClearButtonSB;                                     // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ClickCapture;                                      // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_CannotAddFriends;                         // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_SocialBan;                                // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       SharingIcon;                                       // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSimpleWidgetAnimationsPanel*       SimpleWidgetAnimationsPanel;                       // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_FriendSearch;                              // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ShakeAnimation;                                    // 0x1520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShakeAnimationIsPlaying;                          // 0x1524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__EditableText_AddFriend_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_Sidebar_FriendSearchBar(int32 EntryPoint);
	struct FEventReply On_ClickCapture_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sidebar_FriendSearchBar_C">();
	}
	static class USidebar_FriendSearchBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebar_FriendSearchBar_C>();
	}
};
static_assert(alignof(USidebar_FriendSearchBar_C) == 0x000010, "Wrong alignment on USidebar_FriendSearchBar_C");
static_assert(sizeof(USidebar_FriendSearchBar_C) == 0x001530, "Wrong size on USidebar_FriendSearchBar_C");
static_assert(offsetof(USidebar_FriendSearchBar_C, UberGraphFrame) == 0x0014D0, "Member 'USidebar_FriendSearchBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, OnHovered) == 0x0014D8, "Member 'USidebar_FriendSearchBar_C::OnHovered' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, AddFriendBanIcon) == 0x0014E0, "Member 'USidebar_FriendSearchBar_C::AddFriendBanIcon' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, ClearButtonSB) == 0x0014E8, "Member 'USidebar_FriendSearchBar_C::ClearButtonSB' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, ClickCapture) == 0x0014F0, "Member 'USidebar_FriendSearchBar_C::ClickCapture' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, RichText_CannotAddFriends) == 0x0014F8, "Member 'USidebar_FriendSearchBar_C::RichText_CannotAddFriends' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, RichText_SocialBan) == 0x001500, "Member 'USidebar_FriendSearchBar_C::RichText_SocialBan' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, SharingIcon) == 0x001508, "Member 'USidebar_FriendSearchBar_C::SharingIcon' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, SimpleWidgetAnimationsPanel) == 0x001510, "Member 'USidebar_FriendSearchBar_C::SimpleWidgetAnimationsPanel' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, SizeBox_FriendSearch) == 0x001518, "Member 'USidebar_FriendSearchBar_C::SizeBox_FriendSearch' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, ShakeAnimation) == 0x001520, "Member 'USidebar_FriendSearchBar_C::ShakeAnimation' has a wrong offset!");
static_assert(offsetof(USidebar_FriendSearchBar_C, bShakeAnimationIsPlaying) == 0x001524, "Member 'USidebar_FriendSearchBar_C::bShakeAnimationIsPlaying' has a wrong offset!");

}

