#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSocialTagFilterCheckboxListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSocialTagFilterCheckboxListEntry.SidebarSocialTagFilterCheckboxListEntry_C
// 0x0050 (0x14C0 - 0x1470)
class USidebarSocialTagFilterCheckboxListEntry_C final : public UFortLFGFilterCheckboxEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x1478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x1488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBox_Checkbox;                                     // 0x1490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x14A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x14B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_SidebarSocialTagFilterCheckboxListEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarSocialTagFilterCheckboxListEntry_C">();
	}
	static class USidebarSocialTagFilterCheckboxListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSocialTagFilterCheckboxListEntry_C>();
	}
};
static_assert(alignof(USidebarSocialTagFilterCheckboxListEntry_C) == 0x000010, "Wrong alignment on USidebarSocialTagFilterCheckboxListEntry_C");
static_assert(sizeof(USidebarSocialTagFilterCheckboxListEntry_C) == 0x0014C0, "Wrong size on USidebarSocialTagFilterCheckboxListEntry_C");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, UberGraphFrame) == 0x001470, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, Unhovered) == 0x001478, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::Unhovered' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, Hovered) == 0x001480, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::Hovered' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, Border_Background) == 0x001488, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::Border_Background' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, SBox_Checkbox) == 0x001490, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::SBox_Checkbox' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, SizeBox_0) == 0x001498, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, EncourageEpicFriend_IdleColor) == 0x0014A0, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarSocialTagFilterCheckboxListEntry_C, EncourageEpicFriend_HoveredColor) == 0x0014B0, "Member 'USidebarSocialTagFilterCheckboxListEntry_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");

}

