#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarInteraction_Profile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarInteraction_Profile.SidebarInteraction_Profile_C
// 0x0070 (0x1560 - 0x14F0)
class USidebarInteraction_Profile_C final : public UFortSidebarSocialInteractionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x14F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EncourageEpicFriend;                               // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRallyIcon_C*                 WBP_RebootRallyIcon;                               // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_IdleColor;                     // 0x1528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EncourageEpicFriend_HoveredColor;                  // 0x1538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AddFriendColor;                                    // 0x1548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SidebarInteraction_Profile(int32 EntryPoint);
	void OnInitialized();
	void OnInteractionSet();
	void SetArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SidebarInteraction_Profile_C">();
	}
	static class USidebarInteraction_Profile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarInteraction_Profile_C>();
	}
};
static_assert(alignof(USidebarInteraction_Profile_C) == 0x000010, "Wrong alignment on USidebarInteraction_Profile_C");
static_assert(sizeof(USidebarInteraction_Profile_C) == 0x001560, "Wrong size on USidebarInteraction_Profile_C");
static_assert(offsetof(USidebarInteraction_Profile_C, UberGraphFrame) == 0x0014F0, "Member 'USidebarInteraction_Profile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, OnHover) == 0x0014F8, "Member 'USidebarInteraction_Profile_C::OnHover' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend) == 0x001500, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, Image_Arrow) == 0x001508, "Member 'USidebarInteraction_Profile_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, MenuAnchor_Actions) == 0x001510, "Member 'USidebarInteraction_Profile_C::MenuAnchor_Actions' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, SizeBox_0) == 0x001518, "Member 'USidebarInteraction_Profile_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, WBP_RebootRallyIcon) == 0x001520, "Member 'USidebarInteraction_Profile_C::WBP_RebootRallyIcon' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend_IdleColor) == 0x001528, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend_IdleColor' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, EncourageEpicFriend_HoveredColor) == 0x001538, "Member 'USidebarInteraction_Profile_C::EncourageEpicFriend_HoveredColor' has a wrong offset!");
static_assert(offsetof(USidebarInteraction_Profile_C, AddFriendColor) == 0x001548, "Member 'USidebarInteraction_Profile_C::AddFriendColor' has a wrong offset!");

}

