#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingLayerAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0177 (0x0178 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_285;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_286;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_287;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_288;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_289;                                // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_290;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_291;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_292;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_293;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_294;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_295;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_297;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_298;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_299;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_300;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_301;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_302;                                  // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_303;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_304;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_305;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_306;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_307;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_308;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_309;                              // 0x008C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_310;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_311;                                // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_312;                                // 0x00BD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_313;                                // 0x00BE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_314;                              // 0x00C0(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_315;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_316;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0160(0x0018)()
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000178, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_285) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_285' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_286) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_286' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_287) == 0x00000C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_287' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_288) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_288' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_289) == 0x000014, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_289' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_290) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_290' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_291) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_291' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_292) == 0x000030, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_292' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_293) == 0x000034, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_293' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_294) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_294' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_295) == 0x00003C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_295' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x000040, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_297) == 0x000044, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_297' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_298) == 0x000048, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_298' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x00004C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_300) == 0x000050, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_300' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_301) == 0x000058, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_301' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_302) == 0x000060, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_302' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_303) == 0x000068, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_303' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_304) == 0x000069, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_304' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_305) == 0x000070, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_305' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_306) == 0x000080, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_306' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_307) == 0x000084, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_307' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_308) == 0x000088, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_308' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_309) == 0x00008C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_309' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_310) == 0x0000B8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_310' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_311) == 0x0000BC, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_311' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_312) == 0x0000BD, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_312' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_313) == 0x0000BE, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_313' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_314) == 0x0000C0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_314' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_315) == 0x0000D8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_315' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_316) == 0x0000DC, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_316' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000160, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003F (0x0040 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000040, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000024, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000034, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x00003C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");

}

