#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK
{

// Enum SmartObjectsModule.ESmartObjectChangeReason
// NumValues: 0x000C
enum class ESmartObjectChangeReason : uint8
{
	None                                     = 0,
	OnEvent                                  = 1,
	OnTagAdded                               = 2,
	OnTagRemoved                             = 3,
	OnClaimed                                = 4,
	OnOccupied                               = 5,
	OnReleased                               = 6,
	OnSlotEnabled                            = 7,
	OnSlotDisabled                           = 8,
	OnObjectEnabled                          = 9,
	OnObjectDisabled                         = 10,
	ESmartObjectChangeReason_MAX             = 11,
};

// Enum SmartObjectsModule.ESmartObjectSlotShape
// NumValues: 0x0003
enum class ESmartObjectSlotShape : uint8
{
	Circle                                   = 0,
	Rectangle                                = 1,
	ESmartObjectSlotShape_MAX                = 2,
};

// Enum SmartObjectsModule.ESmartObjectSlotState
// NumValues: 0x0006
enum class ESmartObjectSlotState : uint8
{
	Invalid                                  = 0,
	Free                                     = 1,
	Claimed                                  = 2,
	Occupied                                 = 3,
	Disabled                                 = 4,
	ESmartObjectSlotState_MAX                = 5,
};

// Enum SmartObjectsModule.FSmartObjectSlotEntrySelectionMethod
// NumValues: 0x0003
enum class EFSmartObjectSlotEntrySelectionMethod : uint8
{
	First                                    = 0,
	NearestToSearchLocation                  = 1,
	FSmartObjectSlotEntrySelectionMethod_MAX = 2,
};

// Enum SmartObjectsModule.ESmartObjectCollectionRegistrationResult
// NumValues: 0x0005
enum class ESmartObjectCollectionRegistrationResult : uint8
{
	Failed_InvalidCollection                 = 0,
	Failed_AlreadyRegistered                 = 1,
	Failed_NotFromPersistentLevel            = 2,
	Succeeded                                = 3,
	ESmartObjectCollectionRegistrationResult_MAX = 4,
};

// Enum SmartObjectsModule.ESmartObjectUnregistrationMode
// NumValues: 0x0003
enum class ESmartObjectUnregistrationMode : uint8
{
	KeepRuntimeInstanceActiveIfPartOfCollection = 0,
	DestroyRuntimeInstance                   = 1,
	ESmartObjectUnregistrationMode_MAX       = 2,
};

// Enum SmartObjectsModule.ESmartObjectTagMergingPolicy
// NumValues: 0x0003
enum class ESmartObjectTagMergingPolicy : uint8
{
	Combine                                  = 0,
	Override                                 = 1,
	ESmartObjectTagMergingPolicy_MAX         = 2,
};

// Enum SmartObjectsModule.ESmartObjectTagFilteringPolicy
// NumValues: 0x0004
enum class ESmartObjectTagFilteringPolicy : uint8
{
	NoFilter                                 = 0,
	Combine                                  = 1,
	Override                                 = 2,
	ESmartObjectTagFilteringPolicy_MAX       = 3,
};

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinitionData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectSlotDefinitionData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotDefinitionData) == 0x000008, "Wrong alignment on FSmartObjectSlotDefinitionData");
static_assert(sizeof(FSmartObjectSlotDefinitionData) == 0x000008, "Wrong size on FSmartObjectSlotDefinitionData");

// ScriptStruct SmartObjectsModule.SmartObjectSlotAnnotation
// 0x0000 (0x0008 - 0x0008)
struct FSmartObjectSlotAnnotation : public FSmartObjectSlotDefinitionData
{
};
static_assert(alignof(FSmartObjectSlotAnnotation) == 0x000008, "Wrong alignment on FSmartObjectSlotAnnotation");
static_assert(sizeof(FSmartObjectSlotAnnotation) == 0x000008, "Wrong size on FSmartObjectSlotAnnotation");

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntryAnnotation
// 0x0020 (0x0028 - 0x0008)
struct FSmartObjectSlotEntryAnnotation final : public FSmartObjectSlotAnnotation
{
public:
	struct FVector3f                              Offset;                                            // 0x0008(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator3f                             Rotation;                                          // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0020(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsEntry : 1;                                      // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsExit : 1;                                       // 0x0024(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotEntryAnnotation) == 0x000008, "Wrong alignment on FSmartObjectSlotEntryAnnotation");
static_assert(sizeof(FSmartObjectSlotEntryAnnotation) == 0x000028, "Wrong size on FSmartObjectSlotEntryAnnotation");
static_assert(offsetof(FSmartObjectSlotEntryAnnotation, Offset) == 0x000008, "Member 'FSmartObjectSlotEntryAnnotation::Offset' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotEntryAnnotation, Rotation) == 0x000014, "Member 'FSmartObjectSlotEntryAnnotation::Rotation' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotEntryAnnotation, tag) == 0x000020, "Member 'FSmartObjectSlotEntryAnnotation::tag' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectRuntime
// 0x0120 (0x0120 - 0x0000)
struct alignas(0x10) FSmartObjectRuntime final
{
public:
	struct FWorldConditionQueryState              PreconditionState;                                 // 0x0000(0x0030)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectDefinition*                 Definition;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USmartObjectComponent>   OwnerComponent;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0xB0];                                      // 0x0050(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       SpatialEntryData;                                  // 0x0100(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectRuntime) == 0x000010, "Wrong alignment on FSmartObjectRuntime");
static_assert(sizeof(FSmartObjectRuntime) == 0x000120, "Wrong size on FSmartObjectRuntime");
static_assert(offsetof(FSmartObjectRuntime, PreconditionState) == 0x000000, "Member 'FSmartObjectRuntime::PreconditionState' has a wrong offset!");
static_assert(offsetof(FSmartObjectRuntime, Definition) == 0x000040, "Member 'FSmartObjectRuntime::Definition' has a wrong offset!");
static_assert(offsetof(FSmartObjectRuntime, OwnerComponent) == 0x000048, "Member 'FSmartObjectRuntime::OwnerComponent' has a wrong offset!");
static_assert(offsetof(FSmartObjectRuntime, SpatialEntryData) == 0x000100, "Member 'FSmartObjectRuntime::SpatialEntryData' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectHandle
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectHandle final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FSmartObjectHandle) == 0x000004, "Wrong alignment on FSmartObjectHandle");
static_assert(sizeof(FSmartObjectHandle) == 0x000004, "Wrong size on FSmartObjectHandle");
static_assert(offsetof(FSmartObjectHandle, ID) == 0x000000, "Member 'FSmartObjectHandle::ID' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotHandle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectSlotHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotHandle) == 0x000008, "Wrong alignment on FSmartObjectSlotHandle");
static_assert(sizeof(FSmartObjectSlotHandle) == 0x000008, "Wrong size on FSmartObjectSlotHandle");

// ScriptStruct SmartObjectsModule.SmartObjectEventData
// 0x0028 (0x0028 - 0x0000)
struct FSmartObjectEventData final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESmartObjectChangeReason                      Reason;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           tag;                                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectEventData) == 0x000008, "Wrong alignment on FSmartObjectEventData");
static_assert(sizeof(FSmartObjectEventData) == 0x000028, "Wrong size on FSmartObjectEventData");
static_assert(offsetof(FSmartObjectEventData, SmartObjectHandle) == 0x000000, "Member 'FSmartObjectEventData::SmartObjectHandle' has a wrong offset!");
static_assert(offsetof(FSmartObjectEventData, SlotHandle) == 0x000008, "Member 'FSmartObjectEventData::SlotHandle' has a wrong offset!");
static_assert(offsetof(FSmartObjectEventData, Reason) == 0x000010, "Member 'FSmartObjectEventData::Reason' has a wrong offset!");
static_assert(offsetof(FSmartObjectEventData, tag) == 0x000014, "Member 'FSmartObjectEventData::tag' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectUserHandle
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectUserHandle final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FSmartObjectUserHandle) == 0x000004, "Wrong alignment on FSmartObjectUserHandle");
static_assert(sizeof(FSmartObjectUserHandle) == 0x000004, "Wrong size on FSmartObjectUserHandle");
static_assert(offsetof(FSmartObjectUserHandle, ID) == 0x000000, "Member 'FSmartObjectUserHandle::ID' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionBase
// 0x0000 (0x0010 - 0x0010)
struct FSmartObjectWorldConditionBase : public FWorldConditionBase
{
};
static_assert(alignof(FSmartObjectWorldConditionBase) == 0x000008, "Wrong alignment on FSmartObjectWorldConditionBase");
static_assert(sizeof(FSmartObjectWorldConditionBase) == 0x000010, "Wrong size on FSmartObjectWorldConditionBase");

// ScriptStruct SmartObjectsModule.SmartObjectSlotReference
// 0x0001 (0x0001 - 0x0000)
struct FSmartObjectSlotReference final
{
public:
	uint8                                         Index;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FSmartObjectSlotReference) == 0x000001, "Wrong alignment on FSmartObjectSlotReference");
static_assert(sizeof(FSmartObjectSlotReference) == 0x000001, "Wrong size on FSmartObjectSlotReference");
static_assert(offsetof(FSmartObjectSlotReference, Index) == 0x000000, "Member 'FSmartObjectSlotReference::Index' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotLinkAnnotation
// 0x0008 (0x0010 - 0x0008)
struct FSmartObjectSlotLinkAnnotation final : public FSmartObjectSlotAnnotation
{
public:
	struct FGameplayTag                           tag;                                               // 0x0008(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotReference              LinkedSlot;                                        // 0x000C(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotLinkAnnotation) == 0x000008, "Wrong alignment on FSmartObjectSlotLinkAnnotation");
static_assert(sizeof(FSmartObjectSlotLinkAnnotation) == 0x000010, "Wrong size on FSmartObjectSlotLinkAnnotation");
static_assert(offsetof(FSmartObjectSlotLinkAnnotation, tag) == 0x000008, "Member 'FSmartObjectSlotLinkAnnotation::tag' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotLinkAnnotation, LinkedSlot) == 0x00000C, "Member 'FSmartObjectSlotLinkAnnotation::LinkedSlot' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectComponentInstanceData
// 0x0008 (0x0070 - 0x0068)
struct FSmartObjectComponentInstanceData final : public FActorComponentInstanceData
{
public:
	class USmartObjectDefinition*                 DefinitionAsset;                                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSmartObjectComponentInstanceData) == 0x000008, "Wrong alignment on FSmartObjectComponentInstanceData");
static_assert(sizeof(FSmartObjectComponentInstanceData) == 0x000070, "Wrong size on FSmartObjectComponentInstanceData");
static_assert(offsetof(FSmartObjectComponentInstanceData, DefinitionAsset) == 0x000068, "Member 'FSmartObjectComponentInstanceData::DefinitionAsset' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinition
// 0x00F8 (0x00F8 - 0x0000)
struct FSmartObjectSlotDefinition final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RuntimeTags;                                       // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      UserTagFilter;                                     // 0x0028(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActivityTags;                                      // 0x0070(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         SelectionPreconditions;                            // 0x0090(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x00A8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x00C0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Data;                                              // 0x00D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class USmartObjectBehaviorDefinition*> BehaviorDefinitions;                               // 0x00E8(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSmartObjectSlotDefinition) == 0x000008, "Wrong alignment on FSmartObjectSlotDefinition");
static_assert(sizeof(FSmartObjectSlotDefinition) == 0x0000F8, "Wrong size on FSmartObjectSlotDefinition");
static_assert(offsetof(FSmartObjectSlotDefinition, bEnabled) == 0x000000, "Member 'FSmartObjectSlotDefinition::bEnabled' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, RuntimeTags) == 0x000008, "Member 'FSmartObjectSlotDefinition::RuntimeTags' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, UserTagFilter) == 0x000028, "Member 'FSmartObjectSlotDefinition::UserTagFilter' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, ActivityTags) == 0x000070, "Member 'FSmartObjectSlotDefinition::ActivityTags' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, SelectionPreconditions) == 0x000090, "Member 'FSmartObjectSlotDefinition::SelectionPreconditions' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, Offset) == 0x0000A8, "Member 'FSmartObjectSlotDefinition::Offset' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, Rotation) == 0x0000C0, "Member 'FSmartObjectSlotDefinition::Rotation' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, Data) == 0x0000D8, "Member 'FSmartObjectSlotDefinition::Data' has a wrong offset!");
static_assert(offsetof(FSmartObjectSlotDefinition, BehaviorDefinitions) == 0x0000E8, "Member 'FSmartObjectSlotDefinition::BehaviorDefinitions' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinitionFragment
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectSlotDefinitionFragment final : public FMassSharedFragment
{
public:
	class USmartObjectDefinition*                 SmartObjectDefinition;                             // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotDefinitionFragment) == 0x000008, "Wrong alignment on FSmartObjectSlotDefinitionFragment");
static_assert(sizeof(FSmartObjectSlotDefinitionFragment) == 0x000010, "Wrong size on FSmartObjectSlotDefinitionFragment");
static_assert(offsetof(FSmartObjectSlotDefinitionFragment, SmartObjectDefinition) == 0x000000, "Member 'FSmartObjectSlotDefinitionFragment::SmartObjectDefinition' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSpatialEntryData
// 0x0001 (0x0001 - 0x0000)
struct FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSpatialEntryData) == 0x000001, "Wrong alignment on FSmartObjectSpatialEntryData");
static_assert(sizeof(FSmartObjectSpatialEntryData) == 0x000001, "Wrong size on FSmartObjectSpatialEntryData");

// ScriptStruct SmartObjectsModule.SmartObjectHashGridEntryData
// 0x000B (0x000C - 0x0001)
struct alignas(0x04) FSmartObjectHashGridEntryData final : public FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_1[0xB];                                        // 0x0001(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectHashGridEntryData) == 0x000004, "Wrong alignment on FSmartObjectHashGridEntryData");
static_assert(sizeof(FSmartObjectHashGridEntryData) == 0x00000C, "Wrong size on FSmartObjectHashGridEntryData");

// ScriptStruct SmartObjectsModule.SmartObjectOctreeEntryData
// 0x000F (0x0010 - 0x0001)
struct alignas(0x08) FSmartObjectOctreeEntryData final : public FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectOctreeEntryData) == 0x000008, "Wrong alignment on FSmartObjectOctreeEntryData");
static_assert(sizeof(FSmartObjectOctreeEntryData) == 0x000010, "Wrong size on FSmartObjectOctreeEntryData");

// ScriptStruct SmartObjectsModule.SmartObjectCollectionEntry
// 0x00E0 (0x00E0 - 0x0000)
struct FSmartObjectCollectionEntry final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        Path;                                              // 0x0020(0x0018)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                   Bounds;                                            // 0x00A0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectHandle                     Handle;                                            // 0x00D8(0x0004)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        DefinitionIdx;                                     // 0x00DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSmartObjectCollectionEntry) == 0x000010, "Wrong alignment on FSmartObjectCollectionEntry");
static_assert(sizeof(FSmartObjectCollectionEntry) == 0x0000E0, "Wrong size on FSmartObjectCollectionEntry");
static_assert(offsetof(FSmartObjectCollectionEntry, Tags) == 0x000000, "Member 'FSmartObjectCollectionEntry::Tags' has a wrong offset!");
static_assert(offsetof(FSmartObjectCollectionEntry, Path) == 0x000020, "Member 'FSmartObjectCollectionEntry::Path' has a wrong offset!");
static_assert(offsetof(FSmartObjectCollectionEntry, Transform) == 0x000040, "Member 'FSmartObjectCollectionEntry::Transform' has a wrong offset!");
static_assert(offsetof(FSmartObjectCollectionEntry, Bounds) == 0x0000A0, "Member 'FSmartObjectCollectionEntry::Bounds' has a wrong offset!");
static_assert(offsetof(FSmartObjectCollectionEntry, Handle) == 0x0000D8, "Member 'FSmartObjectCollectionEntry::Handle' has a wrong offset!");
static_assert(offsetof(FSmartObjectCollectionEntry, DefinitionIdx) == 0x0000DC, "Member 'FSmartObjectCollectionEntry::DefinitionIdx' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectContainer
// 0x00B0 (0x00B0 - 0x0000)
struct FSmartObjectContainer final
{
public:
	struct FBox                                   Bounds;                                            // 0x0000(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectCollectionEntry>    CollectionEntries;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSmartObjectHandle, struct FSoftObjectPath> RegisteredIdToObjectMap;                           // 0x0048(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class USmartObjectDefinition*>         Definitions;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UObject*                                Owner;                                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSmartObjectContainer) == 0x000008, "Wrong alignment on FSmartObjectContainer");
static_assert(sizeof(FSmartObjectContainer) == 0x0000B0, "Wrong size on FSmartObjectContainer");
static_assert(offsetof(FSmartObjectContainer, Bounds) == 0x000000, "Member 'FSmartObjectContainer::Bounds' has a wrong offset!");
static_assert(offsetof(FSmartObjectContainer, CollectionEntries) == 0x000038, "Member 'FSmartObjectContainer::CollectionEntries' has a wrong offset!");
static_assert(offsetof(FSmartObjectContainer, RegisteredIdToObjectMap) == 0x000048, "Member 'FSmartObjectContainer::RegisteredIdToObjectMap' has a wrong offset!");
static_assert(offsetof(FSmartObjectContainer, Definitions) == 0x000098, "Member 'FSmartObjectContainer::Definitions' has a wrong offset!");
static_assert(offsetof(FSmartObjectContainer, Owner) == 0x0000A8, "Member 'FSmartObjectContainer::Owner' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectClaimHandle
// 0x0018 (0x0018 - 0x0000)
struct FSmartObjectClaimHandle final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0004)(Edit, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0008)(Edit, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectUserHandle                 UserHandle;                                        // 0x0010(0x0004)(Edit, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectClaimHandle) == 0x000008, "Wrong alignment on FSmartObjectClaimHandle");
static_assert(sizeof(FSmartObjectClaimHandle) == 0x000018, "Wrong size on FSmartObjectClaimHandle");
static_assert(offsetof(FSmartObjectClaimHandle, SmartObjectHandle) == 0x000000, "Member 'FSmartObjectClaimHandle::SmartObjectHandle' has a wrong offset!");
static_assert(offsetof(FSmartObjectClaimHandle, SlotHandle) == 0x000008, "Member 'FSmartObjectClaimHandle::SlotHandle' has a wrong offset!");
static_assert(offsetof(FSmartObjectClaimHandle, UserHandle) == 0x000010, "Member 'FSmartObjectClaimHandle::UserHandle' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotStateData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSmartObjectSlotStateData : public FMassFragment
{
};
#pragma pack(pop)
static_assert(alignof(FSmartObjectSlotStateData) == 0x000001, "Wrong alignment on FSmartObjectSlotStateData");
static_assert(sizeof(FSmartObjectSlotStateData) == 0x000001, "Wrong size on FSmartObjectSlotStateData");

// ScriptStruct SmartObjectsModule.SmartObjectSlotTransform
// 0x0060 (0x0060 - 0x0000)
struct FSmartObjectSlotTransform final : public FSmartObjectSlotStateData
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSmartObjectSlotTransform) == 0x000010, "Wrong alignment on FSmartObjectSlotTransform");
static_assert(sizeof(FSmartObjectSlotTransform) == 0x000060, "Wrong size on FSmartObjectSlotTransform");
static_assert(offsetof(FSmartObjectSlotTransform, Transform) == 0x000000, "Member 'FSmartObjectSlotTransform::Transform' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectRuntimeSlot
// 0x0088 (0x0088 - 0x0000)
struct FSmartObjectRuntimeSlot final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryState              PreconditionState;                                 // 0x0050(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectRuntimeSlot) == 0x000008, "Wrong alignment on FSmartObjectRuntimeSlot");
static_assert(sizeof(FSmartObjectRuntimeSlot) == 0x000088, "Wrong size on FSmartObjectRuntimeSlot");
static_assert(offsetof(FSmartObjectRuntimeSlot, PreconditionState) == 0x000050, "Member 'FSmartObjectRuntimeSlot::PreconditionState' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotView
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FSmartObjectSlotView final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotView) == 0x000008, "Wrong alignment on FSmartObjectSlotView");
static_assert(sizeof(FSmartObjectSlotView) == 0x000028, "Wrong size on FSmartObjectSlotView");

// ScriptStruct SmartObjectsModule.SmartObjectRequestFilter
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x10) FSmartObjectRequestFilter final
{
public:
	class AActor*                                 UserActor;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UserTags;                                          // 0x0008(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSubclassOf<class USmartObjectBehaviorDefinition> BehaviorDefinitionClass;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class USmartObjectBehaviorDefinition>> BehaviorDefinitionClasses;                         // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x68];                                      // 0x0088(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectRequestFilter) == 0x000010, "Wrong alignment on FSmartObjectRequestFilter");
static_assert(sizeof(FSmartObjectRequestFilter) == 0x0000F0, "Wrong size on FSmartObjectRequestFilter");
static_assert(offsetof(FSmartObjectRequestFilter, UserActor) == 0x000000, "Member 'FSmartObjectRequestFilter::UserActor' has a wrong offset!");
static_assert(offsetof(FSmartObjectRequestFilter, UserTags) == 0x000008, "Member 'FSmartObjectRequestFilter::UserTags' has a wrong offset!");
static_assert(offsetof(FSmartObjectRequestFilter, ActivityRequirements) == 0x000028, "Member 'FSmartObjectRequestFilter::ActivityRequirements' has a wrong offset!");
static_assert(offsetof(FSmartObjectRequestFilter, BehaviorDefinitionClass) == 0x000070, "Member 'FSmartObjectRequestFilter::BehaviorDefinitionClass' has a wrong offset!");
static_assert(offsetof(FSmartObjectRequestFilter, BehaviorDefinitionClasses) == 0x000078, "Member 'FSmartObjectRequestFilter::BehaviorDefinitionClasses' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectRequest
// 0x0130 (0x0130 - 0x0000)
struct FSmartObjectRequest final
{
public:
	struct FBox                                   QueryBox;                                          // 0x0000(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0040(0x00F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSmartObjectRequest) == 0x000010, "Wrong alignment on FSmartObjectRequest");
static_assert(sizeof(FSmartObjectRequest) == 0x000130, "Wrong size on FSmartObjectRequest");
static_assert(offsetof(FSmartObjectRequest, QueryBox) == 0x000000, "Member 'FSmartObjectRequest::QueryBox' has a wrong offset!");
static_assert(offsetof(FSmartObjectRequest, Filter) == 0x000040, "Member 'FSmartObjectRequest::Filter' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectRequestResult
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectRequestResult final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0008)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSmartObjectRequestResult) == 0x000008, "Wrong alignment on FSmartObjectRequestResult");
static_assert(sizeof(FSmartObjectRequestResult) == 0x000010, "Wrong size on FSmartObjectRequestResult");
static_assert(offsetof(FSmartObjectRequestResult, SmartObjectHandle) == 0x000000, "Member 'FSmartObjectRequestResult::SmartObjectHandle' has a wrong offset!");
static_assert(offsetof(FSmartObjectRequestResult, SlotHandle) == 0x000008, "Member 'FSmartObjectRequestResult::SlotHandle' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntryRequest
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FSmartObjectSlotEntryRequest final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotEntryRequest) == 0x000008, "Wrong alignment on FSmartObjectSlotEntryRequest");
static_assert(sizeof(FSmartObjectSlotEntryRequest) == 0x000050, "Wrong size on FSmartObjectSlotEntryRequest");

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntryLocationResult
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FSmartObjectSlotEntryLocationResult final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectSlotEntryLocationResult) == 0x000008, "Wrong alignment on FSmartObjectSlotEntryLocationResult");
static_assert(sizeof(FSmartObjectSlotEntryLocationResult) == 0x000040, "Wrong size on FSmartObjectSlotEntryLocationResult");

// ScriptStruct SmartObjectsModule.SmartObjectSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectSlotIndex final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FSmartObjectSlotIndex) == 0x000004, "Wrong alignment on FSmartObjectSlotIndex");
static_assert(sizeof(FSmartObjectSlotIndex) == 0x000004, "Wrong size on FSmartObjectSlotIndex");
static_assert(offsetof(FSmartObjectSlotIndex, Index) == 0x000000, "Member 'FSmartObjectSlotIndex::Index' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectActorUserData
// 0x0008 (0x0008 - 0x0000)
struct FSmartObjectActorUserData final
{
public:
	TWeakObjectPtr<class AActor>                  UserActor;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSmartObjectActorUserData) == 0x000004, "Wrong alignment on FSmartObjectActorUserData");
static_assert(sizeof(FSmartObjectActorUserData) == 0x000008, "Wrong size on FSmartObjectActorUserData");
static_assert(offsetof(FSmartObjectActorUserData, UserActor) == 0x000000, "Member 'FSmartObjectActorUserData::UserActor' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionObjectTagQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectWorldConditionObjectTagQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectWorldConditionObjectTagQueryState) == 0x000008, "Wrong alignment on FSmartObjectWorldConditionObjectTagQueryState");
static_assert(sizeof(FSmartObjectWorldConditionObjectTagQueryState) == 0x000008, "Wrong size on FSmartObjectWorldConditionObjectTagQueryState");

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionObjectTagQuery
// 0x0058 (0x0068 - 0x0010)
struct FSmartObjectWorldConditionObjectTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSmartObjectWorldConditionObjectTagQuery) == 0x000008, "Wrong alignment on FSmartObjectWorldConditionObjectTagQuery");
static_assert(sizeof(FSmartObjectWorldConditionObjectTagQuery) == 0x000068, "Wrong size on FSmartObjectWorldConditionObjectTagQuery");
static_assert(offsetof(FSmartObjectWorldConditionObjectTagQuery, TagQuery) == 0x000020, "Member 'FSmartObjectWorldConditionObjectTagQuery::TagQuery' has a wrong offset!");

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionSlotTagQueryState
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSmartObjectWorldConditionSlotTagQueryState final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSmartObjectWorldConditionSlotTagQueryState) == 0x000008, "Wrong alignment on FSmartObjectWorldConditionSlotTagQueryState");
static_assert(sizeof(FSmartObjectWorldConditionSlotTagQueryState) == 0x000010, "Wrong size on FSmartObjectWorldConditionSlotTagQueryState");

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionSlotTagQuery
// 0x0058 (0x0068 - 0x0010)
struct FSmartObjectWorldConditionSlotTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FSmartObjectWorldConditionSlotTagQuery) == 0x000008, "Wrong alignment on FSmartObjectWorldConditionSlotTagQuery");
static_assert(sizeof(FSmartObjectWorldConditionSlotTagQuery) == 0x000068, "Wrong size on FSmartObjectWorldConditionSlotTagQuery");
static_assert(offsetof(FSmartObjectWorldConditionSlotTagQuery, TagQuery) == 0x000020, "Member 'FSmartObjectWorldConditionSlotTagQuery::TagQuery' has a wrong offset!");

// ScriptStruct SmartObjectsModule.WorldCondition_SmartObjectActorTagQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FWorldCondition_SmartObjectActorTagQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWorldCondition_SmartObjectActorTagQueryState) == 0x000008, "Wrong alignment on FWorldCondition_SmartObjectActorTagQueryState");
static_assert(sizeof(FWorldCondition_SmartObjectActorTagQueryState) == 0x000008, "Wrong size on FWorldCondition_SmartObjectActorTagQueryState");

// ScriptStruct SmartObjectsModule.WorldCondition_SmartObjectActorTagQuery
// 0x0050 (0x0060 - 0x0010)
struct FWorldCondition_SmartObjectActorTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0018(0x0048)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWorldCondition_SmartObjectActorTagQuery) == 0x000008, "Wrong alignment on FWorldCondition_SmartObjectActorTagQuery");
static_assert(sizeof(FWorldCondition_SmartObjectActorTagQuery) == 0x000060, "Wrong size on FWorldCondition_SmartObjectActorTagQuery");
static_assert(offsetof(FWorldCondition_SmartObjectActorTagQuery, TagQuery) == 0x000018, "Member 'FWorldCondition_SmartObjectActorTagQuery::TagQuery' has a wrong offset!");

}

