#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialBanModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialBanModal.SocialBanModal_C
// 0x0088 (0x0578 - 0x04F0)
class USocialBanModal_C final : public UFortSocialBanModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       disclaimer;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       disclaimer_1;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       disclaimer_2;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Severe;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox_51;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_Message;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title_1;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangles_1;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangles_2;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangles_3;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Banned;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Warned;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_SeverityImage;                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnCloseSucceeded;                                  // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_SocialBanModal(int32 EntryPoint);
	void OnDisplayModeSet(bool bIsBanned);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialBanModal_C">();
	}
	static class USocialBanModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialBanModal_C>();
	}
};
static_assert(alignof(USocialBanModal_C) == 0x000008, "Wrong alignment on USocialBanModal_C");
static_assert(sizeof(USocialBanModal_C) == 0x000578, "Wrong size on USocialBanModal_C");
static_assert(offsetof(USocialBanModal_C, UberGraphFrame) == 0x0004F0, "Member 'USocialBanModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, disclaimer) == 0x0004F8, "Member 'USocialBanModal_C::disclaimer' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, disclaimer_1) == 0x000500, "Member 'USocialBanModal_C::disclaimer_1' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, disclaimer_2) == 0x000508, "Member 'USocialBanModal_C::disclaimer_2' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Image_Severe) == 0x000510, "Member 'USocialBanModal_C::Image_Severe' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Lightbox_51) == 0x000518, "Member 'USocialBanModal_C::Lightbox_51' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Switcher_Message) == 0x000520, "Member 'USocialBanModal_C::Switcher_Message' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Title) == 0x000528, "Member 'USocialBanModal_C::Title' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Title_1) == 0x000530, "Member 'USocialBanModal_C::Title_1' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Triangles_1) == 0x000538, "Member 'USocialBanModal_C::Triangles_1' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Triangles_2) == 0x000540, "Member 'USocialBanModal_C::Triangles_2' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, Triangles_3) == 0x000548, "Member 'USocialBanModal_C::Triangles_3' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, VBox_Banned) == 0x000550, "Member 'USocialBanModal_C::VBox_Banned' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, VBox_Warned) == 0x000558, "Member 'USocialBanModal_C::VBox_Warned' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, WidgetSwitcher_SeverityImage) == 0x000560, "Member 'USocialBanModal_C::WidgetSwitcher_SeverityImage' has a wrong offset!");
static_assert(offsetof(USocialBanModal_C, OnCloseSucceeded) == 0x000568, "Member 'USocialBanModal_C::OnCloseSucceeded' has a wrong offset!");

}

