#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanel_TopBarExtension

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanel_TopBarExtension.SocialPanel_TopBarExtension_C
// 0x0030 (0x1460 - 0x1430)
class USocialPanel_TopBarExtension_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x1438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x1440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlatformIcon;                                // 0x1448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMiniPartyBar_C*                        MiniPartyBar;                                      // 0x1450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_SocialPanel_TopBarExtension(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanel_TopBarExtension_C">();
	}
	static class USocialPanel_TopBarExtension_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanel_TopBarExtension_C>();
	}
};
static_assert(alignof(USocialPanel_TopBarExtension_C) == 0x000010, "Wrong alignment on USocialPanel_TopBarExtension_C");
static_assert(sizeof(USocialPanel_TopBarExtension_C) == 0x001460, "Wrong size on USocialPanel_TopBarExtension_C");
static_assert(offsetof(USocialPanel_TopBarExtension_C, UberGraphFrame) == 0x001430, "Member 'USocialPanel_TopBarExtension_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanel_TopBarExtension_C, Hovered) == 0x001438, "Member 'USocialPanel_TopBarExtension_C::Hovered' has a wrong offset!");
static_assert(offsetof(USocialPanel_TopBarExtension_C, Arrow) == 0x001440, "Member 'USocialPanel_TopBarExtension_C::Arrow' has a wrong offset!");
static_assert(offsetof(USocialPanel_TopBarExtension_C, Image_PlatformIcon) == 0x001448, "Member 'USocialPanel_TopBarExtension_C::Image_PlatformIcon' has a wrong offset!");
static_assert(offsetof(USocialPanel_TopBarExtension_C, MiniPartyBar) == 0x001450, "Member 'USocialPanel_TopBarExtension_C::MiniPartyBar' has a wrong offset!");

}

