#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialScreen.SocialScreen_C
// 0x0050 (0x0538 - 0x04E8)
class USocialScreen_C final : public UAthenaSocialScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RiftFadeIn;                                        // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               BottomButtonsSB;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DefaultBackground;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_4;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ViewCareer;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_ShowCareerScreen;                            // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          AutoPlayVideo;                                     // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_SocialScreen(int32 EntryPoint);
	void Show_Career_Screen_Event(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialScreen_C">();
	}
	static class USocialScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialScreen_C>();
	}
};
static_assert(alignof(USocialScreen_C) == 0x000008, "Wrong alignment on USocialScreen_C");
static_assert(sizeof(USocialScreen_C) == 0x000538, "Wrong size on USocialScreen_C");
static_assert(offsetof(USocialScreen_C, UberGraphFrame) == 0x0004E8, "Member 'USocialScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, RiftFadeIn) == 0x0004F0, "Member 'USocialScreen_C::RiftFadeIn' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, BottomButtonsSB) == 0x0004F8, "Member 'USocialScreen_C::BottomButtonsSB' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, Image_DefaultBackground) == 0x000500, "Member 'USocialScreen_C::Image_DefaultBackground' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, SafeZone_2) == 0x000508, "Member 'USocialScreen_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, SafeZone_4) == 0x000510, "Member 'USocialScreen_C::SafeZone_4' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, SizeBox_ViewCareer) == 0x000518, "Member 'USocialScreen_C::SizeBox_ViewCareer' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, Input_ShowCareerScreen) == 0x000520, "Member 'USocialScreen_C::Input_ShowCareerScreen' has a wrong offset!");
static_assert(offsetof(USocialScreen_C, AutoPlayVideo) == 0x000530, "Member 'USocialScreen_C::AutoPlayVideo' has a wrong offset!");

}

