#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocketSubsystemEOS

#include "Basic.hpp"

#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class SocketSubsystemEOS.NetConnectionEOS
// 0x0008 (0x1E90 - 0x1E88)
class UNetConnectionEOS final : public UIpConnection
{
public:
	uint8                                         Pad_1E88[0x8];                                     // 0x1E88(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetConnectionEOS">();
	}
	static class UNetConnectionEOS* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetConnectionEOS>();
	}
};
static_assert(alignof(UNetConnectionEOS) == 0x000008, "Wrong alignment on UNetConnectionEOS");
static_assert(sizeof(UNetConnectionEOS) == 0x001E90, "Wrong size on UNetConnectionEOS");

// Class SocketSubsystemEOS.NetDriverEOSBase
// 0x0008 (0x0850 - 0x0848)
class UNetDriverEOSBase : public UIpNetDriver
{
public:
	bool                                          bIsPassthrough;                                    // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingP2PSockets;                                // 0x0849(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84A[0x6];                                      // 0x084A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetDriverEOSBase">();
	}
	static class UNetDriverEOSBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetDriverEOSBase>();
	}
};
static_assert(alignof(UNetDriverEOSBase) == 0x000008, "Wrong alignment on UNetDriverEOSBase");
static_assert(sizeof(UNetDriverEOSBase) == 0x000850, "Wrong size on UNetDriverEOSBase");
static_assert(offsetof(UNetDriverEOSBase, bIsPassthrough) == 0x000848, "Member 'UNetDriverEOSBase::bIsPassthrough' has a wrong offset!");
static_assert(offsetof(UNetDriverEOSBase, bIsUsingP2PSockets) == 0x000849, "Member 'UNetDriverEOSBase::bIsUsingP2PSockets' has a wrong offset!");

}

