#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpecialEventGameplayUI

#include "Basic.hpp"

#include "SpecialEventGameplayUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpecialEventGameplayUI.FortGameplayCinematicHostWidget
// 0x0038 (0x0308 - 0x02D0)
class UFortGameplayCinematicHostWidget final : public UFortHUDElementWidget
{
public:
	class FName                                   IntroWidgetEntryName;                              // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCinematicWidgetData>           WidgetEntries;                                     // 0x02D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UAthenaLoadingScreenItemDefinition*     LoadingScreenDefinition;                           // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0x18];                                     // 0x02F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCinematicHostWidget">();
	}
	static class UFortGameplayCinematicHostWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicHostWidget>();
	}
};
static_assert(alignof(UFortGameplayCinematicHostWidget) == 0x000008, "Wrong alignment on UFortGameplayCinematicHostWidget");
static_assert(sizeof(UFortGameplayCinematicHostWidget) == 0x000308, "Wrong size on UFortGameplayCinematicHostWidget");
static_assert(offsetof(UFortGameplayCinematicHostWidget, IntroWidgetEntryName) == 0x0002D0, "Member 'UFortGameplayCinematicHostWidget::IntroWidgetEntryName' has a wrong offset!");
static_assert(offsetof(UFortGameplayCinematicHostWidget, WidgetEntries) == 0x0002D8, "Member 'UFortGameplayCinematicHostWidget::WidgetEntries' has a wrong offset!");
static_assert(offsetof(UFortGameplayCinematicHostWidget, LoadingScreenDefinition) == 0x0002E8, "Member 'UFortGameplayCinematicHostWidget::LoadingScreenDefinition' has a wrong offset!");

// Class SpecialEventGameplayUI.FortGameplayCinematicWidget
// 0x0020 (0x03C8 - 0x03A8)
class UFortGameplayCinematicWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSkipCinematics;                                   // 0x03B0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B1[0x17];                                     // 0x03B1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCinematicFinished();
	void OnStartCinematic();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCinematicWidget">();
	}
	static class UFortGameplayCinematicWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayCinematicWidget>();
	}
};
static_assert(alignof(UFortGameplayCinematicWidget) == 0x000008, "Wrong alignment on UFortGameplayCinematicWidget");
static_assert(sizeof(UFortGameplayCinematicWidget) == 0x0003C8, "Wrong size on UFortGameplayCinematicWidget");
static_assert(offsetof(UFortGameplayCinematicWidget, bSkipCinematics) == 0x0003B0, "Member 'UFortGameplayCinematicWidget::bSkipCinematics' has a wrong offset!");

// Class SpecialEventGameplayUI.FortGameplayIntroPanelWidget
// 0x0020 (0x03C8 - 0x03A8)
class UFortGameplayIntroPanelWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3A8[0x20];                                     // 0x03A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIntroFinished();
	void OnStartIntro();
	void OnWaitingForMinTime();
	void OnWaitingForPawn();
	void OnWaitingForReadyForGameplay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayIntroPanelWidget">();
	}
	static class UFortGameplayIntroPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayIntroPanelWidget>();
	}
};
static_assert(alignof(UFortGameplayIntroPanelWidget) == 0x000008, "Wrong alignment on UFortGameplayIntroPanelWidget");
static_assert(sizeof(UFortGameplayIntroPanelWidget) == 0x0003C8, "Wrong size on UFortGameplayIntroPanelWidget");

// Class SpecialEventGameplayUI.SpecialEventCursorWidget
// 0x0020 (0x0288 - 0x0268)
class USpecialEventCursorWidget final : public UUserWidget
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutomaticallyChangeVisibility;                    // 0x0270(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpecialEventCursorPawnComponent*       CursorPawnComponent;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCursorModeChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& NewCursorModeTag, const struct FGameplayTag& OldCursorModeTag);
	void BP_OnDesiredVisibilityChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& CursorModeTag, const bool bShouldBeVisible);
	void OnCursorModeChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& NewCursorModeTag, const struct FGameplayTag& OldCursorModeTag);
	void OnDesiredVisibilityChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FGameplayTag& CursorModeTag, const bool bShouldBeVisible);
	void OnViewportLocationChanged(class USpecialEventCursorPawnComponent* InCursorPawnComponent, const struct FVector2D& NormalizedLocation, const struct FVector2D& ViewportLocation);

	struct FGameplayTagContainer GetCursorModeTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpecialEventCursorWidget">();
	}
	static class USpecialEventCursorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialEventCursorWidget>();
	}
};
static_assert(alignof(USpecialEventCursorWidget) == 0x000008, "Wrong alignment on USpecialEventCursorWidget");
static_assert(sizeof(USpecialEventCursorWidget) == 0x000288, "Wrong size on USpecialEventCursorWidget");
static_assert(offsetof(USpecialEventCursorWidget, bAutomaticallyChangeVisibility) == 0x000270, "Member 'USpecialEventCursorWidget::bAutomaticallyChangeVisibility' has a wrong offset!");
static_assert(offsetof(USpecialEventCursorWidget, CursorPawnComponent) == 0x000278, "Member 'USpecialEventCursorWidget::CursorPawnComponent' has a wrong offset!");

// Class SpecialEventGameplayUI.SpecialEventPlayerInfoWidget
// 0x0020 (0x02F0 - 0x02D0)
class USpecialEventPlayerInfoWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* OldPlayerState, class AFortPlayerStateAthena* NewPlayerState)> OnRepresentedPlayerStateChanged;                   // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AFortPlayerStateAthena* GetRepresentedPlayerState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpecialEventPlayerInfoWidget">();
	}
	static class USpecialEventPlayerInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialEventPlayerInfoWidget>();
	}
};
static_assert(alignof(USpecialEventPlayerInfoWidget) == 0x000008, "Wrong alignment on USpecialEventPlayerInfoWidget");
static_assert(sizeof(USpecialEventPlayerInfoWidget) == 0x0002F0, "Wrong size on USpecialEventPlayerInfoWidget");
static_assert(offsetof(USpecialEventPlayerInfoWidget, OnRepresentedPlayerStateChanged) == 0x0002D8, "Member 'USpecialEventPlayerInfoWidget::OnRepresentedPlayerStateChanged' has a wrong offset!");

// Class SpecialEventGameplayUI.SpecialEventUILibrary
// 0x0000 (0x0028 - 0x0028)
class USpecialEventUILibrary final : public UBlueprintFunctionLibrary
{
public:
	static void HideFrontEndStateWidget(const class UObject* WorldContextObject, bool bNewlyHidden);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpecialEventUILibrary">();
	}
	static class USpecialEventUILibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecialEventUILibrary>();
	}
};
static_assert(alignof(USpecialEventUILibrary) == 0x000008, "Wrong alignment on USpecialEventUILibrary");
static_assert(sizeof(USpecialEventUILibrary) == 0x000028, "Wrong size on USpecialEventUILibrary");

}

