#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandaloneItemShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StandaloneItemShop.StandaloneItemShop_C
// 0x0040 (0x0678 - 0x0638)
class UStandaloneItemShop_C final : public UFortStandaloneItemShop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TabBackground;                               // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LoadingBackground;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_TabButtons;                               // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_StandaloneItemShop(int32 EntryPoint);
	void InitializeTabs();
	void OnCameraLevelLoaded();
	void OnLoadingIndicatorShown(bool bShown);
	void OnTabSelected(int32 TabIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StandaloneItemShop_C">();
	}
	static class UStandaloneItemShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandaloneItemShop_C>();
	}
};
static_assert(alignof(UStandaloneItemShop_C) == 0x000008, "Wrong alignment on UStandaloneItemShop_C");
static_assert(sizeof(UStandaloneItemShop_C) == 0x000678, "Wrong size on UStandaloneItemShop_C");
static_assert(offsetof(UStandaloneItemShop_C, UberGraphFrame) == 0x000638, "Member 'UStandaloneItemShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, HBox_Tabs) == 0x000640, "Member 'UStandaloneItemShop_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, Image_TabBackground) == 0x000648, "Member 'UStandaloneItemShop_C::Image_TabBackground' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, LoadingBackground) == 0x000650, "Member 'UStandaloneItemShop_C::LoadingBackground' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, MTXButton) == 0x000658, "Member 'UStandaloneItemShop_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, NextTabAction) == 0x000660, "Member 'UStandaloneItemShop_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, PreviousTabAction) == 0x000668, "Member 'UStandaloneItemShop_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UStandaloneItemShop_C, SafeZone_TabButtons) == 0x000670, "Member 'UStandaloneItemShop_C::SafeZone_TabButtons' has a wrong offset!");

}

