#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StormShieldModifierRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "StormShieldModifierRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class StormShieldModifierRuntime.FortAthenaMutator_SplitStorm
// 0x01C0 (0x0610 - 0x0450)
class AFortAthenaMutator_SplitStorm final : public AFortAthenaMutator_GameModeBase
{
public:
	TSubclassOf<class AActor>                     SafeZoneProxyClass;                                // 0x0450(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ProxyUpdateFrequency;                              // 0x0458(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplitParallelTravelDistance;                       // 0x0480(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JoinParallelTravelDistance;                        // 0x04A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplitPerpendicularTravelDistance;                  // 0x04D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JoinAngleFromParallelDegrees;                      // 0x04F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         PhaseToSplitStorm;                                 // 0x0520(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FLinearColor                           ProxyMapCircleColor;                               // 0x0548(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProxyMapCircleLineThickness;                       // 0x0558(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProxyMapCircleLineSegments;                        // 0x055C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SafeZoneProxy;                                     // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESplitStormProxyPhase                         CurrentProxyPhase;                                 // 0x0568(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MoveToHoldWaitDuration;                            // 0x056C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveToHoldDuration;                                // 0x0570(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveToEndWaitDuration;                             // 0x0574(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveToEndDuration;                                 // 0x0578(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveStartTime;                                     // 0x057C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 ProxyStartCircle;                                  // 0x0580(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 ProxyEndCircle;                                    // 0x05A0(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 ProxyHoldCircle;                                   // 0x05C0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 CurrentProxyCircle;                                // 0x05E0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_600[0x10];                                     // 0x0600(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentProxyCircle();
	void OnSafeZoneIndicatorSpawned(class AFortSafeZoneIndicator* SafeZoneIndicator);
	void OnSafeZonePhaseChanged();
	void SetProxyCenter(const struct FVector& NewCenter);
	void SetProxyRadius(const float NewRadius);
	void SetSafeZoneProxyPhase(ESplitStormProxyPhase NewPhase);
	void StartProxyUpdateTimer();
	void UpdateProxyCenterAndRadius();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_SplitStorm">();
	}
	static class AFortAthenaMutator_SplitStorm* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_SplitStorm>();
	}
};
static_assert(alignof(AFortAthenaMutator_SplitStorm) == 0x000008, "Wrong alignment on AFortAthenaMutator_SplitStorm");
static_assert(sizeof(AFortAthenaMutator_SplitStorm) == 0x000610, "Wrong size on AFortAthenaMutator_SplitStorm");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, SafeZoneProxyClass) == 0x000450, "Member 'AFortAthenaMutator_SplitStorm::SafeZoneProxyClass' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyUpdateFrequency) == 0x000458, "Member 'AFortAthenaMutator_SplitStorm::ProxyUpdateFrequency' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, SplitParallelTravelDistance) == 0x000480, "Member 'AFortAthenaMutator_SplitStorm::SplitParallelTravelDistance' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, JoinParallelTravelDistance) == 0x0004A8, "Member 'AFortAthenaMutator_SplitStorm::JoinParallelTravelDistance' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, SplitPerpendicularTravelDistance) == 0x0004D0, "Member 'AFortAthenaMutator_SplitStorm::SplitPerpendicularTravelDistance' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, JoinAngleFromParallelDegrees) == 0x0004F8, "Member 'AFortAthenaMutator_SplitStorm::JoinAngleFromParallelDegrees' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, PhaseToSplitStorm) == 0x000520, "Member 'AFortAthenaMutator_SplitStorm::PhaseToSplitStorm' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyMapCircleColor) == 0x000548, "Member 'AFortAthenaMutator_SplitStorm::ProxyMapCircleColor' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyMapCircleLineThickness) == 0x000558, "Member 'AFortAthenaMutator_SplitStorm::ProxyMapCircleLineThickness' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyMapCircleLineSegments) == 0x00055C, "Member 'AFortAthenaMutator_SplitStorm::ProxyMapCircleLineSegments' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, SafeZoneProxy) == 0x000560, "Member 'AFortAthenaMutator_SplitStorm::SafeZoneProxy' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, CurrentProxyPhase) == 0x000568, "Member 'AFortAthenaMutator_SplitStorm::CurrentProxyPhase' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, MoveToHoldWaitDuration) == 0x00056C, "Member 'AFortAthenaMutator_SplitStorm::MoveToHoldWaitDuration' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, MoveToHoldDuration) == 0x000570, "Member 'AFortAthenaMutator_SplitStorm::MoveToHoldDuration' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, MoveToEndWaitDuration) == 0x000574, "Member 'AFortAthenaMutator_SplitStorm::MoveToEndWaitDuration' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, MoveToEndDuration) == 0x000578, "Member 'AFortAthenaMutator_SplitStorm::MoveToEndDuration' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, MoveStartTime) == 0x00057C, "Member 'AFortAthenaMutator_SplitStorm::MoveStartTime' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyStartCircle) == 0x000580, "Member 'AFortAthenaMutator_SplitStorm::ProxyStartCircle' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyEndCircle) == 0x0005A0, "Member 'AFortAthenaMutator_SplitStorm::ProxyEndCircle' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, ProxyHoldCircle) == 0x0005C0, "Member 'AFortAthenaMutator_SplitStorm::ProxyHoldCircle' has a wrong offset!");
static_assert(offsetof(AFortAthenaMutator_SplitStorm, CurrentProxyCircle) == 0x0005E0, "Member 'AFortAthenaMutator_SplitStorm::CurrentProxyCircle' has a wrong offset!");

}

