#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STW_LagerRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LagerRuntime_classes.hpp"


namespace SDK
{

// Class STW_LagerRuntime.FortQuestLivingWorldVolume
// 0x0050 (0x0608 - 0x05B8)
class AFortQuestLivingWorldVolume final : public AFortAthenaLivingWorldVolume
{
public:
	struct FGameplayTagContainer                  NoPlayerNeedsQuestFilterTags;                      // 0x05B8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  PlayerNeedsQuestFilterTags;                        // 0x05D8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortQuestItemDefinition*               RequiredQuest;                                     // 0x05F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_600[0x8];                                      // 0x0600(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePIEQuestsUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestLivingWorldVolume">();
	}
	static class AFortQuestLivingWorldVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortQuestLivingWorldVolume>();
	}
};
static_assert(alignof(AFortQuestLivingWorldVolume) == 0x000008, "Wrong alignment on AFortQuestLivingWorldVolume");
static_assert(sizeof(AFortQuestLivingWorldVolume) == 0x000608, "Wrong size on AFortQuestLivingWorldVolume");
static_assert(offsetof(AFortQuestLivingWorldVolume, NoPlayerNeedsQuestFilterTags) == 0x0005B8, "Member 'AFortQuestLivingWorldVolume::NoPlayerNeedsQuestFilterTags' has a wrong offset!");
static_assert(offsetof(AFortQuestLivingWorldVolume, PlayerNeedsQuestFilterTags) == 0x0005D8, "Member 'AFortQuestLivingWorldVolume::PlayerNeedsQuestFilterTags' has a wrong offset!");
static_assert(offsetof(AFortQuestLivingWorldVolume, RequiredQuest) == 0x0005F8, "Member 'AFortQuestLivingWorldVolume::RequiredQuest' has a wrong offset!");

}

