#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupplyDropRadioRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SupplyDropRadioRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SupplyDropRadioRuntime.BuildingGameplayActorSupplyDropRadio
// 0x01E0 (0x0C10 - 0x0A30)
class ABuildingGameplayActorSupplyDropRadio final : public ABuildingGameplayActor
{
public:
	float                                         MinimumMovingSpeedThresholdSq;                     // 0x0A30(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BalloonClosedGroundedFallSpeed;                    // 0x0A34(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoOpen;                                         // 0x0A38(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ForceOpenActorTags;                                // 0x0A40(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      IgnoreMovingCollisionWithActorTagQuery;            // 0x0A60(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         InterpRateToBalloonOpenedFallSpeed;                // 0x0AA8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DistanceFromOriginalSpawnLocForBalloonOpen;        // 0x0AAC(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESupplyDropRadioBalloonState                  BalloonState;                                      // 0x0AB0(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AB1[0x7];                                      // 0x0AB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             WaterHitResult;                                    // 0x0AB8(0x00E0)(BlueprintVisible, Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bMoving;                                           // 0x0B98(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B99[0x3];                                      // 0x0B99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallSpeed;                                         // 0x0B9C(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BalloonOpenedFallSpeed;                            // 0x0BA0(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GravityMultiplier;                                 // 0x0BA4(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ServerLocation;                                    // 0x0BA8(0x0018)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientLocationCorrectionMaxDistSqWhenBalloonDisabled; // 0x0BC0(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientLocationCorrectionMaxDistSqWhenBalloonEnabled; // 0x0BC4(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Velocity;                                          // 0x0BC8(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PreviousFrameVelocity;                             // 0x0BE0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                OriginalServerSpawnLocation;                       // 0x0BF8(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleMoveIgnoredActorEndPlay(class AActor* EndPlayActor, EEndPlayReason Reason);
	void OnRep_BalloonState();
	void OnRep_DistanceFromOriginalSpawnLocForBalloonOpen();
	void OpenSupplyDrop();
	void SetBalloonState(const ESupplyDropRadioBalloonState InBalloonState);
	void SetGravityMultiplier(const float InGravityMultiplier);
	void UpdateGroundInfo(const bool bValidBlock, const struct FHitResult& MovementHitResult);

	ESupplyDropRadioBalloonState GetBalloonState() const;
	float GetGravityZ() const;
	class AActor* GetHighestAttachParent(const class AActor* InActor) const;
	class UBoxComponent* GetRootCollisionComponent() const;
	bool IsGrounded() const;
	bool IsMoving() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingGameplayActorSupplyDropRadio">();
	}
	static class ABuildingGameplayActorSupplyDropRadio* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuildingGameplayActorSupplyDropRadio>();
	}
};
static_assert(alignof(ABuildingGameplayActorSupplyDropRadio) == 0x000008, "Wrong alignment on ABuildingGameplayActorSupplyDropRadio");
static_assert(sizeof(ABuildingGameplayActorSupplyDropRadio) == 0x000C10, "Wrong size on ABuildingGameplayActorSupplyDropRadio");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, MinimumMovingSpeedThresholdSq) == 0x000A30, "Member 'ABuildingGameplayActorSupplyDropRadio::MinimumMovingSpeedThresholdSq' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, BalloonClosedGroundedFallSpeed) == 0x000A34, "Member 'ABuildingGameplayActorSupplyDropRadio::BalloonClosedGroundedFallSpeed' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, bAutoOpen) == 0x000A38, "Member 'ABuildingGameplayActorSupplyDropRadio::bAutoOpen' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, ForceOpenActorTags) == 0x000A40, "Member 'ABuildingGameplayActorSupplyDropRadio::ForceOpenActorTags' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, IgnoreMovingCollisionWithActorTagQuery) == 0x000A60, "Member 'ABuildingGameplayActorSupplyDropRadio::IgnoreMovingCollisionWithActorTagQuery' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, InterpRateToBalloonOpenedFallSpeed) == 0x000AA8, "Member 'ABuildingGameplayActorSupplyDropRadio::InterpRateToBalloonOpenedFallSpeed' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, DistanceFromOriginalSpawnLocForBalloonOpen) == 0x000AAC, "Member 'ABuildingGameplayActorSupplyDropRadio::DistanceFromOriginalSpawnLocForBalloonOpen' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, BalloonState) == 0x000AB0, "Member 'ABuildingGameplayActorSupplyDropRadio::BalloonState' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, WaterHitResult) == 0x000AB8, "Member 'ABuildingGameplayActorSupplyDropRadio::WaterHitResult' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, bMoving) == 0x000B98, "Member 'ABuildingGameplayActorSupplyDropRadio::bMoving' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, FallSpeed) == 0x000B9C, "Member 'ABuildingGameplayActorSupplyDropRadio::FallSpeed' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, BalloonOpenedFallSpeed) == 0x000BA0, "Member 'ABuildingGameplayActorSupplyDropRadio::BalloonOpenedFallSpeed' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, GravityMultiplier) == 0x000BA4, "Member 'ABuildingGameplayActorSupplyDropRadio::GravityMultiplier' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, ServerLocation) == 0x000BA8, "Member 'ABuildingGameplayActorSupplyDropRadio::ServerLocation' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, ClientLocationCorrectionMaxDistSqWhenBalloonDisabled) == 0x000BC0, "Member 'ABuildingGameplayActorSupplyDropRadio::ClientLocationCorrectionMaxDistSqWhenBalloonDisabled' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, ClientLocationCorrectionMaxDistSqWhenBalloonEnabled) == 0x000BC4, "Member 'ABuildingGameplayActorSupplyDropRadio::ClientLocationCorrectionMaxDistSqWhenBalloonEnabled' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, Velocity) == 0x000BC8, "Member 'ABuildingGameplayActorSupplyDropRadio::Velocity' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, PreviousFrameVelocity) == 0x000BE0, "Member 'ABuildingGameplayActorSupplyDropRadio::PreviousFrameVelocity' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorSupplyDropRadio, OriginalServerSpawnLocation) == 0x000BF8, "Member 'ABuildingGameplayActorSupplyDropRadio::OriginalServerSpawnLocation' has a wrong offset!");

// Class SupplyDropRadioRuntime.FortSupplyDropRadioAttachActorComponent
// 0x0000 (0x00A0 - 0x00A0)
class UFortSupplyDropRadioAttachActorComponent final : public UActorComponent
{
public:
	void SetOwningActorNetCullDistance(const float DistanceSquared) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSupplyDropRadioAttachActorComponent">();
	}
	static class UFortSupplyDropRadioAttachActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSupplyDropRadioAttachActorComponent>();
	}
};
static_assert(alignof(UFortSupplyDropRadioAttachActorComponent) == 0x000008, "Wrong alignment on UFortSupplyDropRadioAttachActorComponent");
static_assert(sizeof(UFortSupplyDropRadioAttachActorComponent) == 0x0000A0, "Wrong size on UFortSupplyDropRadioAttachActorComponent");

// Class SupplyDropRadioRuntime.FortSupplyDropRadioBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortSupplyDropRadioBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetMoveShouldAbortConversation(class AFortPlayerControllerGameplay* PlayerController, const bool bNewMoveAbortConversation);
	static void StopCurrentConversation(class AFortPlayerControllerGameplay* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSupplyDropRadioBlueprintLibrary">();
	}
	static class UFortSupplyDropRadioBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSupplyDropRadioBlueprintLibrary>();
	}
};
static_assert(alignof(UFortSupplyDropRadioBlueprintLibrary) == 0x000008, "Wrong alignment on UFortSupplyDropRadioBlueprintLibrary");
static_assert(sizeof(UFortSupplyDropRadioBlueprintLibrary) == 0x000028, "Wrong size on UFortSupplyDropRadioBlueprintLibrary");

}

