#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwimmingAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0267 (0x0268 - 0x0001)
struct SwimmingAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1106;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_1107;                              // 0x0008(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1108;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1109;                             // 0x0020(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1110;                               // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1111;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1112;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1113;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1114;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1115;                              // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1116;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1117;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1118;                              // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1119;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1120;                              // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1121;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1122;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1123;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1124;                               // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1125;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1126;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1127;                               // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1128;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1129;                              // 0x00A0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1130;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1131;                               // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1132;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1133;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1134;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1135;                               // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1136;                               // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1137;                               // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1138;                               // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1139;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1140;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1141;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1142;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1143;                               // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1144;                               // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1145;                                // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1146;                               // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1147;                              // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_1148;                             // 0x0108(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1149;                               // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1150;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1151;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1152;                              // 0x0140(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_1153;                              // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1154;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1155;                              // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1156;                               // 0x015C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1157;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1158;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1159;                                // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1160;                               // 0x016C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1161;                               // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1162;                               // 0x0174(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_1163;                               // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1164;                              // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1165;                               // 0x0180(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1166;                               // 0x0181(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1167;                               // 0x0182(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1168;                               // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1169;                                 // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1170;                               // 0x0198(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1171;                               // 0x0199(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1172;                               // 0x019A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1173;                              // 0x01A0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_1174;                             // 0x01B0(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1175;                               // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1176;                               // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0250(0x0018)()
};
static_assert(alignof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SwimmingAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000268, "Wrong size on SwimmingAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1106) == 0x000004, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1106' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1107) == 0x000008, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1107' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1108) == 0x000018, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1108' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1109) == 0x000020, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1109' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1110) == 0x000038, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1110' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1111) == 0x00003C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1111' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1112) == 0x000040, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1112' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1113) == 0x000044, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1113' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1114) == 0x000048, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1114' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1115) == 0x000050, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1115' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1116) == 0x000060, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1116' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1117) == 0x000064, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1117' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1118) == 0x000068, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1118' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1119) == 0x00006C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1119' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1120) == 0x000070, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1120' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1121) == 0x000074, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1121' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1122) == 0x000078, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1122' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1123) == 0x00007C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1123' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1124) == 0x000080, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1124' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1125) == 0x000084, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1125' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1126) == 0x000088, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1126' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1127) == 0x00008C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1127' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1128) == 0x000090, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1128' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1129) == 0x0000A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1129' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1130) == 0x0000B0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1130' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1131) == 0x0000B4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1131' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1132) == 0x0000B8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1132' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1133) == 0x0000BC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1133' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1134) == 0x0000C0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1134' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1135) == 0x0000C4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1135' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1136) == 0x0000C8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1136' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1137) == 0x0000CC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1137' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1138) == 0x0000D0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1138' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1139) == 0x0000D4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1139' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1140) == 0x0000D8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1140' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1141) == 0x0000DC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1141' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1142) == 0x0000E0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1142' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1143) == 0x0000E4, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1143' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1144) == 0x0000E8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1144' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1145) == 0x0000EC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1145' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1146) == 0x0000F0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1146' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1147) == 0x0000F8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1147' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1148) == 0x000108, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1148' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1149) == 0x000134, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1149' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1150) == 0x000138, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1150' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1151) == 0x00013C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1151' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1152) == 0x000140, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1152' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1153) == 0x000150, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1153' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1154) == 0x000154, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1154' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1155) == 0x000158, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1155' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1156) == 0x00015C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1156' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1157) == 0x000160, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1157' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1158) == 0x000164, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1158' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1159) == 0x000168, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1159' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1160) == 0x00016C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1160' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1161) == 0x000170, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1161' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1162) == 0x000174, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1162' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1163) == 0x000178, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1163' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1164) == 0x00017C, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1164' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1165) == 0x000180, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1165' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1166) == 0x000181, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1166' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1167) == 0x000182, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1167' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1168) == 0x000188, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1168' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1169) == 0x000190, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1169' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1170) == 0x000198, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1170' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1171) == 0x000199, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1171' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1172) == 0x00019A, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1172' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1173) == 0x0001A0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1173' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1174) == 0x0001B0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1174' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1175) == 0x0001C8, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1175' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1176) == 0x0001CC, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1176' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001D0, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000250, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SwimmingAnimBP.SwimmingAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00A7 (0x00A8 - 0x0001)
struct SwimmingAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_14;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_17;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_18;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_23;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_25;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_26;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_29;                                 // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x006B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_32;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_33;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_34;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_37;                             // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_38;                             // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_39;                                // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_40;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_41;                                 // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on SwimmingAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000A8, "Wrong size on SwimmingAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(SwimmingAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'SwimmingAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
