#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal_Nameplate_AddFriendButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TeamMemberPedestal_Nameplate_AddFriendButton.TeamMemberPedestal_Nameplate_AddFriendButton_C
// 0x0050 (0x1480 - 0x1430)
class UTeamMemberPedestal_Nameplate_AddFriendButton_C final : public UCommonButtonLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnUnhovered;                                       // 0x1438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x1440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x1448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayShine;                                         // 0x1450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHovered;                                         // 0x1458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x1460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTop;                                   // 0x1468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_InputAction;                                    // 0x1470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateVisuals(bool IsUsingTouch);
	void SetInputActionVisibility(ESlateVisibility InVisibility);
	void SetButtonText(const class FText& InText);
	void ExecuteUbergraph_TeamMemberPedestal_Nameplate_AddFriendButton(int32 EntryPoint);
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_Nameplate_AddFriendButton_C">();
	}
	static class UTeamMemberPedestal_Nameplate_AddFriendButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMemberPedestal_Nameplate_AddFriendButton_C>();
	}
};
static_assert(alignof(UTeamMemberPedestal_Nameplate_AddFriendButton_C) == 0x000010, "Wrong alignment on UTeamMemberPedestal_Nameplate_AddFriendButton_C");
static_assert(sizeof(UTeamMemberPedestal_Nameplate_AddFriendButton_C) == 0x001480, "Wrong size on UTeamMemberPedestal_Nameplate_AddFriendButton_C");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, UberGraphFrame) == 0x001430, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, OnUnhovered) == 0x001438, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Reset) == 0x001440, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Reset' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Disabled) == 0x001448, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Disabled' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, PlayShine) == 0x001450, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::PlayShine' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, OnHovered) == 0x001458, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, CenterButtonTextWidget) == 0x001460, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, Image_ButtonTop) == 0x001468, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::Image_ButtonTop' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, SB_InputAction) == 0x001470, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::SB_InputAction' has a wrong offset!");
static_assert(offsetof(UTeamMemberPedestal_Nameplate_AddFriendButton_C, SizeBox_0) == 0x001478, "Member 'UTeamMemberPedestal_Nameplate_AddFriendButton_C::SizeBox_0' has a wrong offset!");

}

