#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextToggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TextToggle.TextToggle_C
// 0x0060 (0x02F0 - 0x0290)
class UTextToggle_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ToggleOff;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleOn;                                          // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CText_Off;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CText_On;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isOn;                                              // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OffText;                                           // 0x02C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FText                                   OnText;                                            // 0x02D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void SwitchToggle();
	void SetToggleState(bool isOn_0);
	void Refresh();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_TextToggle(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TextToggle_C">();
	}
	static class UTextToggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextToggle_C>();
	}
};
static_assert(alignof(UTextToggle_C) == 0x000008, "Wrong alignment on UTextToggle_C");
static_assert(sizeof(UTextToggle_C) == 0x0002F0, "Wrong size on UTextToggle_C");
static_assert(offsetof(UTextToggle_C, UberGraphFrame) == 0x000290, "Member 'UTextToggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, ToggleOff) == 0x000298, "Member 'UTextToggle_C::ToggleOff' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, ToggleOn) == 0x0002A0, "Member 'UTextToggle_C::ToggleOn' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, CText_Off) == 0x0002A8, "Member 'UTextToggle_C::CText_Off' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, CText_On) == 0x0002B0, "Member 'UTextToggle_C::CText_On' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, isOn) == 0x0002B8, "Member 'UTextToggle_C::isOn' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, OffText) == 0x0002C0, "Member 'UTextToggle_C::OffText' has a wrong offset!");
static_assert(offsetof(UTextToggle_C, OnText) == 0x0002D8, "Member 'UTextToggle_C::OnText' has a wrong offset!");

}

