#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastSocialWidget_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ToastSocialWidget_Base.ToastSocialWidget_Base_C
// 0x0168 (0x0458 - 0x02F0)
class UToastSocialWidget_Base_C final : public UFortSocialNotificationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TapAccept;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClickAccept;                                       // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_NeutralInfo_Simple;                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_GoodInfo_Simple;                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_BadInfo_Simple;                              // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_NeutralInfo;                                 // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_GoodInfo;                                    // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_BadInfo;                                     // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeToRespond;                                     // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro_New;                                         // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro_Action;                                      // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundMat;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButtonHold_C*                  Button_Cursor;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Hold;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       HamburgerIcon;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fail;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Info;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Success;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Trim;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_Icon;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input_Keybind;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ResultIcon;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressCircle;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Input_Pad;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_InputButtons;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Action;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Desc;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Title;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextureIcon;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ToastCushion;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_HoldAction;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Info;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRallyIcon_C*                 WBP_RebootRallyIcon;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFinishedToast;                                   // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AnimationDelayTimer;                               // 0x0418(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bActionTaken;                                      // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseComplexAnims;                                   // 0x0421(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0422(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423[0x5];                                      // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 DownloadOnDemandErrorIcon;                         // 0x0428(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bUsingNewAvatars;                                  // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyAdditionalStyling();
	void BndEvt__Button_Hold_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ToastSocialWidget_Base_Button_Cursor_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButtonLegacy* Button);
	void BndEvt__ToastSocialWidget_Base_IconTextButtonHold_K2Node_ComponentBoundEvent_3_HoldActionStarted__DelegateSignature();
	void BndEvt__ToastSocialWidget_Base_IconTextButtonHold_K2Node_ComponentBoundEvent_4_HoldActionEnded__DelegateSignature();
	void BndEvt__ToastSocialWidget_Base_IconTextButtonHold_K2Node_ComponentBoundEvent_6_HoldActionCompleted__DelegateSignature();
	void CleanupBeforeClosing();
	void Construct();
	void Destruct();
	class UWidgetAnimation* DetermineIntroAnim();
	void ExecuteUbergraph_ToastSocialWidget_Base(int32 EntryPoint);
	int32 GetActiveWidgetIndex();
	void GetButtonCursorText(class FText* Text);
	void GetButtonHoldText(class FText* Text);
	ESlateVisibility GetInputSwitcherVisibility();
	void HandleIntroFinished();
	void HandleNotificationType(class FText* Return);
	void HandleOutroFinished();
	void HoldComplete();
	void InputBasedStyling();
	void OnCancelNotification();
	void OnCursorModeChanged(bool bCursorModeEnabled);
	void OnInputModeChanged(ECommonInputType NewInputType);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnNewAvatarsEnabledChanged(bool bUsingNewAvatars_0);
	void OnNotificationSet(class UFortUINotification* Notification);
	void OnNotificationUpdated(class UFortUINotification* Notification);
	void OnPlayOpenAnimation();
	void OnTakeActionNotification();
	void OnUserStartedHoldActionNotification();
	void PlayOutro();
	void PreConstruct(bool IsDesignTime);
	void ResetMaterials();
	void SequenceEvent__ENTRYPOINTToastSocialWidget_Base();
	void SequenceEvent__ENTRYPOINTToastSocialWidget_Base_0();
	void SequenceEvent__ENTRYPOINTToastSocialWidget_Base_1();
	void SetImage();
	void SetupAnimBindings(bool Unbind);
	void SetVisibilityForOptionalElements();
	void TakeAction();
	void UpdateIcons();
	void UpdateToast(class UFortUINotification* Notification);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToastSocialWidget_Base_C">();
	}
	static class UToastSocialWidget_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToastSocialWidget_Base_C>();
	}
};
static_assert(alignof(UToastSocialWidget_Base_C) == 0x000008, "Wrong alignment on UToastSocialWidget_Base_C");
static_assert(sizeof(UToastSocialWidget_Base_C) == 0x000458, "Wrong size on UToastSocialWidget_Base_C");
static_assert(offsetof(UToastSocialWidget_Base_C, UberGraphFrame) == 0x0002F0, "Member 'UToastSocialWidget_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, TapAccept) == 0x0002F8, "Member 'UToastSocialWidget_Base_C::TapAccept' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, ClickAccept) == 0x000300, "Member 'UToastSocialWidget_Base_C::ClickAccept' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_NeutralInfo_Simple) == 0x000308, "Member 'UToastSocialWidget_Base_C::Intro_NeutralInfo_Simple' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_GoodInfo_Simple) == 0x000310, "Member 'UToastSocialWidget_Base_C::Intro_GoodInfo_Simple' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_BadInfo_Simple) == 0x000318, "Member 'UToastSocialWidget_Base_C::Intro_BadInfo_Simple' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_NeutralInfo) == 0x000320, "Member 'UToastSocialWidget_Base_C::Intro_NeutralInfo' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_GoodInfo) == 0x000328, "Member 'UToastSocialWidget_Base_C::Intro_GoodInfo' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_BadInfo) == 0x000330, "Member 'UToastSocialWidget_Base_C::Intro_BadInfo' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, TimeToRespond) == 0x000338, "Member 'UToastSocialWidget_Base_C::TimeToRespond' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Outro_New) == 0x000340, "Member 'UToastSocialWidget_Base_C::Outro_New' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, HoldProgress) == 0x000348, "Member 'UToastSocialWidget_Base_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Intro_Action) == 0x000350, "Member 'UToastSocialWidget_Base_C::Intro_Action' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, BackgroundMat) == 0x000358, "Member 'UToastSocialWidget_Base_C::BackgroundMat' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Button_Cursor) == 0x000360, "Member 'UToastSocialWidget_Base_C::Button_Cursor' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Button_Hold) == 0x000368, "Member 'UToastSocialWidget_Base_C::Button_Hold' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, HamburgerIcon) == 0x000370, "Member 'UToastSocialWidget_Base_C::HamburgerIcon' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Image_Fail) == 0x000378, "Member 'UToastSocialWidget_Base_C::Image_Fail' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Image_Info) == 0x000380, "Member 'UToastSocialWidget_Base_C::Image_Info' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Image_Success) == 0x000388, "Member 'UToastSocialWidget_Base_C::Image_Success' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Image_Trim) == 0x000390, "Member 'UToastSocialWidget_Base_C::Image_Trim' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, LazyImage_Icon) == 0x000398, "Member 'UToastSocialWidget_Base_C::LazyImage_Icon' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Overlay_Input_Keybind) == 0x0003A0, "Member 'UToastSocialWidget_Base_C::Overlay_Input_Keybind' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Overlay_ResultIcon) == 0x0003A8, "Member 'UToastSocialWidget_Base_C::Overlay_ResultIcon' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, ProgressCircle) == 0x0003B0, "Member 'UToastSocialWidget_Base_C::ProgressCircle' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, ScaleBox_Input_Pad) == 0x0003B8, "Member 'UToastSocialWidget_Base_C::ScaleBox_Input_Pad' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Switcher_InputButtons) == 0x0003C0, "Member 'UToastSocialWidget_Base_C::Switcher_InputButtons' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Text_Action) == 0x0003C8, "Member 'UToastSocialWidget_Base_C::Text_Action' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Text_Desc) == 0x0003D0, "Member 'UToastSocialWidget_Base_C::Text_Desc' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, Text_Title) == 0x0003D8, "Member 'UToastSocialWidget_Base_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, TextureIcon) == 0x0003E0, "Member 'UToastSocialWidget_Base_C::TextureIcon' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, ToastCushion) == 0x0003E8, "Member 'UToastSocialWidget_Base_C::ToastCushion' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, VerticalBox_HoldAction) == 0x0003F0, "Member 'UToastSocialWidget_Base_C::VerticalBox_HoldAction' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, VerticalBox_Info) == 0x0003F8, "Member 'UToastSocialWidget_Base_C::VerticalBox_Info' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, WBP_RebootRallyIcon) == 0x000400, "Member 'UToastSocialWidget_Base_C::WBP_RebootRallyIcon' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, OnFinishedToast) == 0x000408, "Member 'UToastSocialWidget_Base_C::OnFinishedToast' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, AnimationDelayTimer) == 0x000418, "Member 'UToastSocialWidget_Base_C::AnimationDelayTimer' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, bActionTaken) == 0x000420, "Member 'UToastSocialWidget_Base_C::bActionTaken' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, UseComplexAnims) == 0x000421, "Member 'UToastSocialWidget_Base_C::UseComplexAnims' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, NewVar) == 0x000422, "Member 'UToastSocialWidget_Base_C::NewVar' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, DownloadOnDemandErrorIcon) == 0x000428, "Member 'UToastSocialWidget_Base_C::DownloadOnDemandErrorIcon' has a wrong offset!");
static_assert(offsetof(UToastSocialWidget_Base_C, bUsingNewAvatars) == 0x000450, "Member 'UToastSocialWidget_Base_C::bUsingNewAvatars' has a wrong offset!");

}

