#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopRightWindowControlsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopRightWindowControlsWidget.TopRightWindowControlsWidget_C
// 0x0018 (0x03E0 - 0x03C8)
class UTopRightWindowControlsWidget_C final : public UFortBladeMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USafeZone*                              SafeZone_Content;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uwindowchromebuttons_C*                 windowchromebuttons;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TopRightWindowControlsWidget(int32 EntryPoint);
	void OnRefreshOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopRightWindowControlsWidget_C">();
	}
	static class UTopRightWindowControlsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopRightWindowControlsWidget_C>();
	}
};
static_assert(alignof(UTopRightWindowControlsWidget_C) == 0x000008, "Wrong alignment on UTopRightWindowControlsWidget_C");
static_assert(sizeof(UTopRightWindowControlsWidget_C) == 0x0003E0, "Wrong size on UTopRightWindowControlsWidget_C");
static_assert(offsetof(UTopRightWindowControlsWidget_C, UberGraphFrame) == 0x0003C8, "Member 'UTopRightWindowControlsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopRightWindowControlsWidget_C, SafeZone_Content) == 0x0003D0, "Member 'UTopRightWindowControlsWidget_C::SafeZone_Content' has a wrong offset!");
static_assert(offsetof(UTopRightWindowControlsWidget_C, windowchromebuttons) == 0x0003D8, "Member 'UTopRightWindowControlsWidget_C::windowchromebuttons' has a wrong offset!");

}

