#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BigGoldButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CrewUI_structs.hpp"
#include "CrewUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_BigGoldButton.UI_BigGoldButton_C
// 0x0100 (0x15A0 - 0x14A0)
class UUI_BigGoldButton_C final : public UBattlePassCrewPurchaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldProgress;                                      // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x14B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Empty;                                        // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button;                                      // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button_Inner;                                // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CurrencyVBuck;                               // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Hover;                                     // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Input_Keybind;                             // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayStationStoreLogo;                              // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMobileImage*                       PressOrClickIcon;                                  // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressCircle;                                    // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Even;                                       // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_InputAction;                                // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Currency;                                 // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_HoldPrompt;                              // 0x1538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidgetLegacy*          Visibility_PlatformImage;                          // 0x1540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                Visuals_Glows;                                     // 0x1548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x1550(0x0018)(Edit, BlueprintVisible)
	bool                                          Unskew;                                            // 0x1568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GlowsOff;                                          // 0x1569(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HoverLightning;                                    // 0x156A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156B[0x5];                                     // 0x156B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             PurchaseButtonHover;                               // 0x1570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PurchaseButtonUnHover;                             // 0x1578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PurchaseButtonHoldSound;                           // 0x1580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PurchaseButtonReleaseSound;                        // 0x1588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PurchaseButtonHoldComplete;                        // 0x1590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PurchaseHoldComponent;                             // 0x1598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BindInputChanged();
	void BP_OnActionProgressDecreased(const float HoldPercentage);
	void BP_OnActionProgressIncreased(const float HoldPercentage);
	void BP_OnDisabled();
	void BP_OnHoldCompleted();
	void BP_OnHoldEnded(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHoldReset();
	void BP_OnHoldStarted(const float HoldPercentage, const bool bInUseSecondaryHoldAnimation);
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void Destruct();
	void EventHover(bool In);
	void ExecuteUbergraph_UI_BigGoldButton(int32 EntryPoint);
	void InputChanged(ECommonInputType bNewInputType);
	void OnCurrencyUpdated();
	void OnHoldRequiredChanged(bool bHoldRequired);
	void OnProgressAnimationFinished();
	void OnProgressAnimationStarted();
	void PlayHoldProgressAnimation(double HoldPercent);
	void PreConstruct(bool IsDesignTime);
	void UpdateAnimationBindings();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_BigGoldButton_C">();
	}
	static class UUI_BigGoldButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_BigGoldButton_C>();
	}
};
static_assert(alignof(UUI_BigGoldButton_C) == 0x000010, "Wrong alignment on UUI_BigGoldButton_C");
static_assert(sizeof(UUI_BigGoldButton_C) == 0x0015A0, "Wrong size on UUI_BigGoldButton_C");
static_assert(offsetof(UUI_BigGoldButton_C, UberGraphFrame) == 0x0014A0, "Member 'UUI_BigGoldButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HoldProgress) == 0x0014A8, "Member 'UUI_BigGoldButton_C::HoldProgress' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Hover) == 0x0014B0, "Member 'UUI_BigGoldButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HBox_Empty) == 0x0014B8, "Member 'UUI_BigGoldButton_C::HBox_Empty' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image) == 0x0014C0, "Member 'UUI_BigGoldButton_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_0) == 0x0014C8, "Member 'UUI_BigGoldButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_1) == 0x0014D0, "Member 'UUI_BigGoldButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Button) == 0x0014D8, "Member 'UUI_BigGoldButton_C::Image_Button' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Button_Inner) == 0x0014E0, "Member 'UUI_BigGoldButton_C::Image_Button_Inner' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_CurrencyVBuck) == 0x0014E8, "Member 'UUI_BigGoldButton_C::Image_CurrencyVBuck' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Image_Shadow) == 0x0014F0, "Member 'UUI_BigGoldButton_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Overlay_Hover) == 0x0014F8, "Member 'UUI_BigGoldButton_C::Overlay_Hover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Overlay_Input_Keybind) == 0x001500, "Member 'UUI_BigGoldButton_C::Overlay_Input_Keybind' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PlayStationStoreLogo) == 0x001508, "Member 'UUI_BigGoldButton_C::PlayStationStoreLogo' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PressOrClickIcon) == 0x001510, "Member 'UUI_BigGoldButton_C::PressOrClickIcon' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, ProgressCircle) == 0x001518, "Member 'UUI_BigGoldButton_C::ProgressCircle' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Spacer_Even) == 0x001520, "Member 'UUI_BigGoldButton_C::Spacer_Even' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Spacer_InputAction) == 0x001528, "Member 'UUI_BigGoldButton_C::Spacer_InputAction' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Switcher_Currency) == 0x001530, "Member 'UUI_BigGoldButton_C::Switcher_Currency' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, TextBlock_HoldPrompt) == 0x001538, "Member 'UUI_BigGoldButton_C::TextBlock_HoldPrompt' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Visibility_PlatformImage) == 0x001540, "Member 'UUI_BigGoldButton_C::Visibility_PlatformImage' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Visuals_Glows) == 0x001548, "Member 'UUI_BigGoldButton_C::Visuals_Glows' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, ButtonText) == 0x001550, "Member 'UUI_BigGoldButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, Unskew) == 0x001568, "Member 'UUI_BigGoldButton_C::Unskew' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, GlowsOff) == 0x001569, "Member 'UUI_BigGoldButton_C::GlowsOff' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, HoverLightning) == 0x00156A, "Member 'UUI_BigGoldButton_C::HoverLightning' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonHover) == 0x001570, "Member 'UUI_BigGoldButton_C::PurchaseButtonHover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonUnHover) == 0x001578, "Member 'UUI_BigGoldButton_C::PurchaseButtonUnHover' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonHoldSound) == 0x001580, "Member 'UUI_BigGoldButton_C::PurchaseButtonHoldSound' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonReleaseSound) == 0x001588, "Member 'UUI_BigGoldButton_C::PurchaseButtonReleaseSound' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseButtonHoldComplete) == 0x001590, "Member 'UUI_BigGoldButton_C::PurchaseButtonHoldComplete' has a wrong offset!");
static_assert(offsetof(UUI_BigGoldButton_C, PurchaseHoldComponent) == 0x001598, "Member 'UUI_BigGoldButton_C::PurchaseHoldComponent' has a wrong offset!");

}

