#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BigGoldButton

#include "Basic.hpp"

#include "CrewUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_BigGoldButton.UI_BigGoldButton_C.BP_OnActionProgressDecreased
// 0x0004 (0x0004 - 0x0000)
struct UI_BigGoldButton_C_BP_OnActionProgressDecreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_BP_OnActionProgressDecreased) == 0x000004, "Wrong alignment on UI_BigGoldButton_C_BP_OnActionProgressDecreased");
static_assert(sizeof(UI_BigGoldButton_C_BP_OnActionProgressDecreased) == 0x000004, "Wrong size on UI_BigGoldButton_C_BP_OnActionProgressDecreased");
static_assert(offsetof(UI_BigGoldButton_C_BP_OnActionProgressDecreased, HoldPercentage) == 0x000000, "Member 'UI_BigGoldButton_C_BP_OnActionProgressDecreased::HoldPercentage' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.BP_OnActionProgressIncreased
// 0x0004 (0x0004 - 0x0000)
struct UI_BigGoldButton_C_BP_OnActionProgressIncreased final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_BP_OnActionProgressIncreased) == 0x000004, "Wrong alignment on UI_BigGoldButton_C_BP_OnActionProgressIncreased");
static_assert(sizeof(UI_BigGoldButton_C_BP_OnActionProgressIncreased) == 0x000004, "Wrong size on UI_BigGoldButton_C_BP_OnActionProgressIncreased");
static_assert(offsetof(UI_BigGoldButton_C_BP_OnActionProgressIncreased, HoldPercentage) == 0x000000, "Member 'UI_BigGoldButton_C_BP_OnActionProgressIncreased::HoldPercentage' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.BP_OnHoldEnded
// 0x0008 (0x0008 - 0x0000)
struct UI_BigGoldButton_C_BP_OnHoldEnded final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_BP_OnHoldEnded) == 0x000004, "Wrong alignment on UI_BigGoldButton_C_BP_OnHoldEnded");
static_assert(sizeof(UI_BigGoldButton_C_BP_OnHoldEnded) == 0x000008, "Wrong size on UI_BigGoldButton_C_BP_OnHoldEnded");
static_assert(offsetof(UI_BigGoldButton_C_BP_OnHoldEnded, HoldPercentage) == 0x000000, "Member 'UI_BigGoldButton_C_BP_OnHoldEnded::HoldPercentage' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_BP_OnHoldEnded, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'UI_BigGoldButton_C_BP_OnHoldEnded::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.BP_OnHoldStarted
// 0x0008 (0x0008 - 0x0000)
struct UI_BigGoldButton_C_BP_OnHoldStarted final
{
public:
	float                                         HoldPercentage;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInUseSecondaryHoldAnimation;                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_BP_OnHoldStarted) == 0x000004, "Wrong alignment on UI_BigGoldButton_C_BP_OnHoldStarted");
static_assert(sizeof(UI_BigGoldButton_C_BP_OnHoldStarted) == 0x000008, "Wrong size on UI_BigGoldButton_C_BP_OnHoldStarted");
static_assert(offsetof(UI_BigGoldButton_C_BP_OnHoldStarted, HoldPercentage) == 0x000000, "Member 'UI_BigGoldButton_C_BP_OnHoldStarted::HoldPercentage' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_BP_OnHoldStarted, bInUseSecondaryHoldAnimation) == 0x000004, "Member 'UI_BigGoldButton_C_BP_OnHoldStarted::bInUseSecondaryHoldAnimation' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.EventHover
// 0x0001 (0x0001 - 0x0000)
struct UI_BigGoldButton_C_EventHover final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_EventHover) == 0x000001, "Wrong alignment on UI_BigGoldButton_C_EventHover");
static_assert(sizeof(UI_BigGoldButton_C_EventHover) == 0x000001, "Wrong size on UI_BigGoldButton_C_EventHover");
static_assert(offsetof(UI_BigGoldButton_C_EventHover, In) == 0x000000, "Member 'UI_BigGoldButton_C_EventHover::In' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.ExecuteUbergraph_UI_BigGoldButton
// 0x01A8 (0x01A8 - 0x0000)
struct UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseButtonCurrencyType         Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage_3;                     // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation_1;       // 0x008C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage_2;                     // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInUseSecondaryHoldAnimation;         // 0x0094(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHoldRequired;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsHoldRequired_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_3;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_4;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsHoldRequired_ReturnValue_1;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseButtonCurrencyType         Temp_byte_Variable_16;                             // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_7;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EBattlePassPurchaseButtonCurrencyType         Temp_byte_Variable_17;                             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_8;                           // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_2;                  // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldPercentage_1;                     // 0x0158(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HoldPercentage;                       // 0x0160(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_PlayHoldProgressAnimation_HoldPercent_ImplicitCast; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_PlayHoldProgressAnimation_HoldPercent_ImplicitCast_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton) == 0x000008, "Wrong alignment on UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton");
static_assert(sizeof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton) == 0x0001A8, "Wrong size on UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, EntryPoint) == 0x000000, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable) == 0x000004, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable) == 0x000005, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_object_Variable) == 0x000008, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_object_Variable_1) == 0x000010, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_1) == 0x000018, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_2) == 0x000019, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_3) == 0x00001A, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_4) == 0x00001B, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_1) == 0x00001C, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_5) == 0x00001D, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_6) == 0x00001E, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_2) == 0x00001F, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_7) == 0x000020, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_8) == 0x000021, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_3) == 0x000022, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_9) == 0x000023, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_10) == 0x000024, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetContext_ReturnValue_1) == 0x000030, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_4) == 0x000038, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_11) == 0x000039, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_12) == 0x00003A, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_5) == 0x00003B, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_13) == 0x00003C, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_14) == 0x00003D, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000040, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_CustomEvent_In) == 0x000048, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_CustomEvent_In' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000049, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004A, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default) == 0x000058, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_1) == 0x000068, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_2) == 0x000070, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_3) == 0x000071, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_SpawnSound2D_ReturnValue) == 0x000078, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000080, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_HoldPercentage_3) == 0x000088, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_HoldPercentage_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_bInUseSecondaryHoldAnimation_1) == 0x00008C, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_bInUseSecondaryHoldAnimation_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_HoldPercentage_2) == 0x000090, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_HoldPercentage_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_bInUseSecondaryHoldAnimation) == 0x000094, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_bInUseSecondaryHoldAnimation' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000095, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_IsDesignTime) == 0x000096, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetEndTime_ReturnValue) == 0x000098, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000A8, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_bHoldRequired) == 0x0000B0, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_bHoldRequired' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetIsHoldRequired_ReturnValue) == 0x0000B1, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetIsHoldRequired_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_SpawnSound2D_ReturnValue_2) == 0x0000B8, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_4) == 0x0000C0, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_SpawnSound2D_ReturnValue_3) == 0x0000C8, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_SpawnSound2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_SpawnSound2D_ReturnValue_4) == 0x0000D0, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_SpawnSound2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_15) == 0x0000D8, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsHovered_ReturnValue) == 0x0000D9, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_CustomEvent_bNewInputType) == 0x0000DA, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000DB, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000E0, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Conv_NameToString_ReturnValue) == 0x0000E8, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsEmpty_ReturnValue) == 0x0000F8, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsValid_ReturnValue) == 0x0000F9, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Not_PreBool_ReturnValue) == 0x0000FA, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_bool_Variable_6) == 0x0000FB, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_BooleanOR_ReturnValue) == 0x0000FD, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_5) == 0x0000FE, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_6) == 0x0000FF, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetIsHoldRequired_ReturnValue_1) == 0x00010C, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetIsHoldRequired_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_16) == 0x00010D, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_7) == 0x000110, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, Temp_byte_Variable_17) == 0x000118, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_8) == 0x000120, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000128, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsEmpty_ReturnValue_1) == 0x000139, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Not_PreBool_ReturnValue_1) == 0x00013A, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_BooleanAND_ReturnValue_1) == 0x00013B, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Select_Default_9) == 0x00013C, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Conv_NameToString_ReturnValue_2) == 0x000140, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsValid_ReturnValue_2) == 0x000150, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsEmpty_ReturnValue_2) == 0x000151, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Not_PreBool_ReturnValue_2) == 0x000152, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_BooleanAND_ReturnValue_2) == 0x000153, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsHovered_ReturnValue_1) == 0x000154, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsHovered_ReturnValue_2) == 0x000155, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsHovered_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Not_PreBool_ReturnValue_3) == 0x000156, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Not_PreBool_ReturnValue_4) == 0x000157, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_HoldPercentage_1) == 0x000158, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_HoldPercentage_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00015C, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, K2Node_Event_HoldPercentage) == 0x000160, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::K2Node_Event_HoldPercentage' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Not_PreBool_ReturnValue_5) == 0x000164, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_GetEndTime_ReturnValue_1) == 0x000168, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimation_ReturnValue) == 0x000170, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayHoldProgressAnimation_HoldPercent_ImplicitCast) == 0x000180, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayHoldProgressAnimation_HoldPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000190, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast) == 0x000198, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton, CallFunc_PlayHoldProgressAnimation_HoldPercent_ImplicitCast_1) == 0x0001A0, "Member 'UI_BigGoldButton_C_ExecuteUbergraph_UI_BigGoldButton::CallFunc_PlayHoldProgressAnimation_HoldPercent_ImplicitCast_1' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.InputChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_BigGoldButton_C_InputChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_InputChanged) == 0x000001, "Wrong alignment on UI_BigGoldButton_C_InputChanged");
static_assert(sizeof(UI_BigGoldButton_C_InputChanged) == 0x000001, "Wrong size on UI_BigGoldButton_C_InputChanged");
static_assert(offsetof(UI_BigGoldButton_C_InputChanged, bNewInputType) == 0x000000, "Member 'UI_BigGoldButton_C_InputChanged::bNewInputType' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.OnHoldRequiredChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_BigGoldButton_C_OnHoldRequiredChanged final
{
public:
	bool                                          bHoldRequired;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_OnHoldRequiredChanged) == 0x000001, "Wrong alignment on UI_BigGoldButton_C_OnHoldRequiredChanged");
static_assert(sizeof(UI_BigGoldButton_C_OnHoldRequiredChanged) == 0x000001, "Wrong size on UI_BigGoldButton_C_OnHoldRequiredChanged");
static_assert(offsetof(UI_BigGoldButton_C_OnHoldRequiredChanged, bHoldRequired) == 0x000000, "Member 'UI_BigGoldButton_C_OnHoldRequiredChanged::bHoldRequired' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.PlayHoldProgressAnimation
// 0x0048 (0x0048 - 0x0000)
struct UI_BigGoldButton_C_PlayHoldProgressAnimation final
{
public:
	double                                        HoldPercent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_PlayHoldProgressAnimation) == 0x000008, "Wrong alignment on UI_BigGoldButton_C_PlayHoldProgressAnimation");
static_assert(sizeof(UI_BigGoldButton_C_PlayHoldProgressAnimation) == 0x000048, "Wrong size on UI_BigGoldButton_C_PlayHoldProgressAnimation");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, HoldPercent) == 0x000000, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::HoldPercent' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000028, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000040, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BigGoldButton_C_PlayHoldProgressAnimation, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000044, "Member 'UI_BigGoldButton_C_PlayHoldProgressAnimation::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_BigGoldButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BigGoldButton_C_PreConstruct) == 0x000001, "Wrong alignment on UI_BigGoldButton_C_PreConstruct");
static_assert(sizeof(UI_BigGoldButton_C_PreConstruct) == 0x000001, "Wrong size on UI_BigGoldButton_C_PreConstruct");
static_assert(offsetof(UI_BigGoldButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_BigGoldButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_BigGoldButton.UI_BigGoldButton_C.UpdateAnimationBindings
// 0x0040 (0x0040 - 0x0000)
struct UI_BigGoldButton_C_UpdateAnimationBindings final
{
public:
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
