#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealEngineExperimental_0

#include "Basic.hpp"

#include "UnrealEngineExperimental_0_structs.hpp"


namespace SDK::Params
{

// Function UnrealEngineExperimental.Curves_editable_curve._L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R) == 0x000008, "Wrong alignment on Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R");
static_assert(sizeof(Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R) == 0x000010, "Wrong size on Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R");
static_assert(offsetof(Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R, RetVal) == 0x000008, "Member 'Curves_editable_curve__L_2fUnrealEngine_2ecom_2fTemporary_2fCurves_2feditable__curve_N_REvaluate_L_Nfloat_R::RetVal' has a wrong offset!");

// Function UnrealEngineExperimental.Diagnostics_log._L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R
// 0x0018 (0x0018 - 0x0000)
struct Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R final
{
public:
	struct UnrealEngineExperimental_0::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R) == 0x000008, "Wrong alignment on Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R");
static_assert(sizeof(Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R) == 0x000018, "Wrong size on Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R");
static_assert(offsetof(Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrint_L_N_Kchar_M_Nlog__level_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function UnrealEngineExperimental.Diagnostics_log._L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R
// 0x0002 (0x0002 - 0x0000)
struct Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R final
{
public:
	FOptionProperty_                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R) == 0x000001, "Wrong alignment on Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R");
static_assert(sizeof(Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R) == 0x000002, "Wrong size on Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R");
static_assert(offsetof(Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Diagnostics_log__L_2fUnrealEngine_2ecom_2fTemporary_2fDiagnostics_2flog_N_RPrintCallStack_L_Nlog__level_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

}

