#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VBucksStoreScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VBucksStoreScreen.VBucksStoreScreen_C
// 0x0090 (0x04E8 - 0x0458)
class UVBucksStoreScreen_C final : public UFortVbucksStoreScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CurrencyNotificationBorder;                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyNotificationText;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInfoFlag_C*                            InfoFlag;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_ExtraContentBottom;                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewNoOffersBox;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewPurchasingDisabledBox;                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewSpinner;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            NewSwitcherItemsProgress;                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewVbuckOffers;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewVBuckSection;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              OfferScaleBoxRoot;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        Ambient_Sound;                                     // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                InitiallyFocusedOffer;                             // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingCampaignUpsell;                            // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMobileLayout;                                  // 0x04E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ApplyMobileLayout();
	void BP_OnActivated();
	void ExecuteUbergraph_VBucksStoreScreen(int32 EntryPoint);
	void GetVisibilityByChildrenPresence(class UPanelWidget* Panel, ESlateVisibility* NewParam);
	void HandleAllOffersGenerated();
	void HandleBack(bool* PassThrough);
	void HandleRedeem(bool* bPassThrough);
	void NoOffersAvailable();
	void OnOffersGenerated();
	void OnPurchasingDisabled();
	void OnStartReadingOffers();
	void OnTransitionedBySwitcher_1();
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, const class FText& CurrencyMessageLocText);
	void PlayEquippedLockerMusic();
	void PreConstruct(bool IsDesignTime);
	void UpdateCurrencyNotification();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VBucksStoreScreen_C">();
	}
	static class UVBucksStoreScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVBucksStoreScreen_C>();
	}
};
static_assert(alignof(UVBucksStoreScreen_C) == 0x000008, "Wrong alignment on UVBucksStoreScreen_C");
static_assert(sizeof(UVBucksStoreScreen_C) == 0x0004E8, "Wrong size on UVBucksStoreScreen_C");
static_assert(offsetof(UVBucksStoreScreen_C, UberGraphFrame) == 0x000458, "Member 'UVBucksStoreScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, Intro) == 0x000460, "Member 'UVBucksStoreScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, CurrencyNotificationBorder) == 0x000468, "Member 'UVBucksStoreScreen_C::CurrencyNotificationBorder' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, CurrencyNotificationText) == 0x000470, "Member 'UVBucksStoreScreen_C::CurrencyNotificationText' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, HorizontalBox_0) == 0x000478, "Member 'UVBucksStoreScreen_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, InfoFlag) == 0x000480, "Member 'UVBucksStoreScreen_C::InfoFlag' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NamedSlot_ExtraContentBottom) == 0x000488, "Member 'UVBucksStoreScreen_C::NamedSlot_ExtraContentBottom' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewNoOffersBox) == 0x000490, "Member 'UVBucksStoreScreen_C::NewNoOffersBox' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewPurchasingDisabledBox) == 0x000498, "Member 'UVBucksStoreScreen_C::NewPurchasingDisabledBox' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewSpinner) == 0x0004A0, "Member 'UVBucksStoreScreen_C::NewSpinner' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewSwitcherItemsProgress) == 0x0004A8, "Member 'UVBucksStoreScreen_C::NewSwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewVbuckOffers) == 0x0004B0, "Member 'UVBucksStoreScreen_C::NewVbuckOffers' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, NewVBuckSection) == 0x0004B8, "Member 'UVBucksStoreScreen_C::NewVBuckSection' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, OfferScaleBoxRoot) == 0x0004C0, "Member 'UVBucksStoreScreen_C::OfferScaleBoxRoot' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, Overlay_0) == 0x0004C8, "Member 'UVBucksStoreScreen_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, Ambient_Sound) == 0x0004D0, "Member 'UVBucksStoreScreen_C::Ambient_Sound' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, InitiallyFocusedOffer) == 0x0004D8, "Member 'UVBucksStoreScreen_C::InitiallyFocusedOffer' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, bShowingCampaignUpsell) == 0x0004E0, "Member 'UVBucksStoreScreen_C::bShowingCampaignUpsell' has a wrong offset!");
static_assert(offsetof(UVBucksStoreScreen_C, bUseMobileLayout) == 0x0004E1, "Member 'UVBucksStoreScreen_C::bUseMobileLayout' has a wrong offset!");

}

