#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNPC

#include "Basic.hpp"

#include "VerseAIBase_0_structs.hpp"
#include "VerseNPC_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function VerseNPC.task_VerseNPC_npc_component$Jump.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Jump_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Jump_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Jump_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Jump_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Jump_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Jump_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Jump_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$AttackObstacle_L_Nfort__obstacle__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$LookAt_L_Nvector3_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_LookAt_L_Nvector3_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$AttackThreat_L_Nfort__threat__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$LootObject_L_Nfort__loot__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Crouch.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Crouch_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Crouch_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Crouch_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Crouch_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Crouch_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Crouch_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Crouch_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Idle_L_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Idle_L_Nfloat_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$MoveInRangeToAttack.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_MoveInRangeToAttack_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_MoveInRangeToAttack_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_MoveInRangeToAttack_Update");
static_assert(sizeof(task_VerseNPC_npc_component_MoveInRangeToAttack_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_MoveInRangeToAttack_Update");
static_assert(offsetof(task_VerseNPC_npc_component_MoveInRangeToAttack_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_MoveInRangeToAttack_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$PlayRandomEmote.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_PlayRandomEmote_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_PlayRandomEmote_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_PlayRandomEmote_Update");
static_assert(sizeof(task_VerseNPC_npc_component_PlayRandomEmote_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_PlayRandomEmote_Update");
static_assert(offsetof(task_VerseNPC_npc_component_PlayRandomEmote_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_PlayRandomEmote_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Revive_L_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Revive_L_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Revive_L_Nagent_R_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Revive_L_Nagent_R_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Revive_L_Nagent_R_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Revive_L_Nagent_R_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Revive_L_Nagent_R_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Revive_L_Nagent_R_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$RoamAround.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_RoamAround_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_RoamAround_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_RoamAround_Update");
static_assert(sizeof(task_VerseNPC_npc_component_RoamAround_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_RoamAround_Update");
static_assert(offsetof(task_VerseNPC_npc_component_RoamAround_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_RoamAround_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Slide.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Slide_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Slide_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Slide_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Slide_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Slide_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Slide_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Slide_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Sprint.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Sprint_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Sprint_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Sprint_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Sprint_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Sprint_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Sprint_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Sprint_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$TacticalSprint.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_TacticalSprint_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_TacticalSprint_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_TacticalSprint_Update");
static_assert(sizeof(task_VerseNPC_npc_component_TacticalSprint_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_TacticalSprint_Update");
static_assert(offsetof(task_VerseNPC_npc_component_TacticalSprint_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_TacticalSprint_Update::RetVal' has a wrong offset!");

// Function VerseNPC.task_VerseNPC_npc_component$Walk.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseNPC_npc_component_Walk_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseNPC_npc_component_Walk_Update) == 0x000008, "Wrong alignment on task_VerseNPC_npc_component_Walk_Update");
static_assert(sizeof(task_VerseNPC_npc_component_Walk_Update) == 0x000008, "Wrong size on task_VerseNPC_npc_component_Walk_Update");
static_assert(offsetof(task_VerseNPC_npc_component_Walk_Update, RetVal) == 0x000000, "Member 'task_VerseNPC_npc_component_Walk_Update::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R
// 0x0030 (0x0030 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R final
{
public:
	struct VerseNPC::Ftuple_Lfort__inventory__item__asset_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0019)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R) == 0x000030, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R, RetVal) == 0x000010, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0018(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R, RetVal) == 0x000018, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems
// 0x0018 (0x0018 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseAIBase_fort_item_descriptor> RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems) == 0x000018, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems, RetVal) == 0x000008, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0019)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon) == 0x000028, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon, RetVal) == 0x000008, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R
// 0x0038 (0x0038 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	FOptionProperty_                              RetVal;                                            // 0x0018(0x0019)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R) == 0x000038, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R, RetVal) == 0x000018, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R
// 0x0018 (0x0018 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R) == 0x000018, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R, RetVal) == 0x000010, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_inventory_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R) == 0x000008, "Wrong alignment on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R");
static_assert(sizeof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R) == 0x000008, "Wrong size on VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R");
static_assert(offsetof(VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_inventory_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_leash_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash
// 0x0001 (0x0001 - 0x0000)
struct VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash) == 0x000001, "Wrong alignment on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash");
static_assert(sizeof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash) == 0x000001, "Wrong size on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash");
static_assert(offsetof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_leash_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R final
{
public:
	struct VerseNPC::Ftuple_Lagent_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R) == 0x000018, "Wrong size on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_leash_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R final
{
public:
	struct VerseNPC::Ftuple_Lvector3_Mfloat_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R) == 0x000008, "Wrong alignment on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R");
static_assert(sizeof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R) == 0x000028, "Wrong size on VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R");
static_assert(offsetof(VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_leash_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct VerseNPC_npc_component__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__InitCDO) == 0x000008, "Wrong alignment on VerseNPC_npc_component__InitCDO");
static_assert(sizeof(VerseNPC_npc_component__InitCDO) == 0x000040, "Wrong size on VerseNPC_npc_component__InitCDO");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _ExprResult_0) == 0x000000, "Member 'VerseNPC_npc_component__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _InstancingGraph_1) == 0x000008, "Member 'VerseNPC_npc_component__InitCDO::_InstancingGraph_1' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _ExprResult_2) == 0x000010, "Member 'VerseNPC_npc_component__InitCDO::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _InstancingGraph_3) == 0x000018, "Member 'VerseNPC_npc_component__InitCDO::_InstancingGraph_3' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _ExprResult_4) == 0x000020, "Member 'VerseNPC_npc_component__InitCDO::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _InstancingGraph_5) == 0x000028, "Member 'VerseNPC_npc_component__InitCDO::_InstancingGraph_5' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _ExprResult_6) == 0x000030, "Member 'VerseNPC_npc_component__InitCDO::_ExprResult_6' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__InitCDO, _InstancingGraph_7) == 0x000038, "Member 'VerseNPC_npc_component__InitCDO::_InstancingGraph_7' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp
// 0x0002 (0x0002 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    RetVal;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp) == 0x000001, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp) == 0x000002, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp, RetVal) == 0x000001, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent) == 0x000010, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0029)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot) == 0x000038, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0029)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo) == 0x000038, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent) == 0x000010, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent) == 0x000010, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent) == 0x000010, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent::RetVal' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R
// 0x0030 (0x0030 - 0x0000)
struct VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R final
{
public:
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R) == 0x000030, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseNPC.VerseNPC_npc_component._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo final
{
public:
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0031)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo) == 0x000008, "Wrong alignment on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo");
static_assert(sizeof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo) == 0x000040, "Wrong size on VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo, RetVal) == 0x000008, "Member 'VerseNPC_npc_component__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo::RetVal' has a wrong offset!");

