#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNPC

#include "Basic.hpp"

#include "VerseNPC_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNPC_0_classes.hpp"
#include "VerseAIBase_classes.hpp"


namespace SDK
{

// VerseClass VerseNPC.task_VerseNPC_npc_component$Jump
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_Jump final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Jump">();
	}
	static class Utask_VerseNPC_npc_component_Jump* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Jump>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Jump) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Jump");
static_assert(sizeof(Utask_VerseNPC_npc_component_Jump) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_Jump");
static_assert(offsetof(Utask_VerseNPC_npc_component_Jump, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Jump::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Jump, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Jump::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Jump, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_Jump::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$AttackObstacle_L_Nfort__obstacle__info_R
// 0x0038 (0x0180 - 0x0148)
class Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info        __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0028)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$AttackObstacle_L_Nfort__obstacle__info_R">();
	}
	static class Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R) == 0x000180, "Wrong size on Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R, _RetVal) == 0x000178, "Member 'Utask_VerseNPC_npc_component_AttackObstacle_L_Nfort__obstacle__info_R::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R
// 0x0028 (0x0170 - 0x0148)
class Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0018)(Parm, HasGetValueTypeHash)
	EVerseAIBase_navigation_result                _RetVal;                                           // 0x0168(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R">();
	}
	static class Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R) == 0x000170, "Wrong size on Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R, _RetVal) == 0x000168, "Member 'Utask_VerseNPC_npc_component_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseNPC::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseNPC.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseNPC::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseNPC::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseNPC::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseNPC::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseNPC::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseNPC::U_SolarisSignatureFunctionOuter");

// VerseClass VerseNPC.task_VerseNPC_npc_component$LookAt_L_Nvector3_R
// 0x0020 (0x0168 - 0x0148)
class Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$LookAt_L_Nvector3_R">();
	}
	static class Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R) == 0x000168, "Wrong size on Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_LookAt_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$AttackThreat_L_Nfort__threat__info_R
// 0x0040 (0x0188 - 0x0148)
class Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0030)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0180(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$AttackThreat_L_Nfort__threat__info_R">();
	}
	static class Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R) == 0x000188, "Wrong size on Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R, _RetVal) == 0x000180, "Member 'Utask_VerseNPC_npc_component_AttackThreat_L_Nfort__threat__info_R::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$LootObject_L_Nfort__loot__info_R
// 0x0038 (0x0180 - 0x0148)
class Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_loot_info            __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0028)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$LootObject_L_Nfort__loot__info_R">();
	}
	static class Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R) == 0x000180, "Wrong size on Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R, _RetVal) == 0x000178, "Member 'Utask_VerseNPC_npc_component_LootObject_L_Nfort__loot__info_R::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$Crouch
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_Crouch final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Crouch">();
	}
	static class Utask_VerseNPC_npc_component_Crouch* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Crouch>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Crouch) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Crouch");
static_assert(sizeof(Utask_VerseNPC_npc_component_Crouch) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_Crouch");
static_assert(offsetof(Utask_VerseNPC_npc_component_Crouch, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Crouch::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Crouch, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Crouch::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Crouch, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_Crouch::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$Idle_L_Nfloat_R
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_Idle_L_Nfloat_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Idle_L_Nfloat_R">();
	}
	static class Utask_VerseNPC_npc_component_Idle_L_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Idle_L_Nfloat_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Idle_L_Nfloat_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Idle_L_Nfloat_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_Idle_L_Nfloat_R) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_Idle_L_Nfloat_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_Idle_L_Nfloat_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Idle_L_Nfloat_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Idle_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Idle_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$MoveInRangeToAttack
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_MoveInRangeToAttack final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$MoveInRangeToAttack">();
	}
	static class Utask_VerseNPC_npc_component_MoveInRangeToAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_MoveInRangeToAttack>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_MoveInRangeToAttack) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_MoveInRangeToAttack");
static_assert(sizeof(Utask_VerseNPC_npc_component_MoveInRangeToAttack) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_MoveInRangeToAttack");
static_assert(offsetof(Utask_VerseNPC_npc_component_MoveInRangeToAttack, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_MoveInRangeToAttack::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_MoveInRangeToAttack, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_MoveInRangeToAttack::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_MoveInRangeToAttack, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_MoveInRangeToAttack::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$PlayRandomEmote
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_PlayRandomEmote final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$PlayRandomEmote">();
	}
	static class Utask_VerseNPC_npc_component_PlayRandomEmote* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_PlayRandomEmote>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_PlayRandomEmote) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_PlayRandomEmote");
static_assert(sizeof(Utask_VerseNPC_npc_component_PlayRandomEmote) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_PlayRandomEmote");
static_assert(offsetof(Utask_VerseNPC_npc_component_PlayRandomEmote, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_PlayRandomEmote::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_PlayRandomEmote, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_PlayRandomEmote::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_PlayRandomEmote, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_PlayRandomEmote::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$Revive_L_Nagent_R
// 0x0018 (0x0160 - 0x0148)
class Utask_VerseNPC_npc_component_Revive_L_Nagent_R final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0158(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Revive_L_Nagent_R">();
	}
	static class Utask_VerseNPC_npc_component_Revive_L_Nagent_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Revive_L_Nagent_R>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Revive_L_Nagent_R) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Revive_L_Nagent_R");
static_assert(sizeof(Utask_VerseNPC_npc_component_Revive_L_Nagent_R) == 0x000160, "Wrong size on Utask_VerseNPC_npc_component_Revive_L_Nagent_R");
static_assert(offsetof(Utask_VerseNPC_npc_component_Revive_L_Nagent_R, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Revive_L_Nagent_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Revive_L_Nagent_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Revive_L_Nagent_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Revive_L_Nagent_R, _RetVal) == 0x000158, "Member 'Utask_VerseNPC_npc_component_Revive_L_Nagent_R::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$RoamAround
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_RoamAround final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_navigation_result                _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$RoamAround">();
	}
	static class Utask_VerseNPC_npc_component_RoamAround* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_RoamAround>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_RoamAround) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_RoamAround");
static_assert(sizeof(Utask_VerseNPC_npc_component_RoamAround) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_RoamAround");
static_assert(offsetof(Utask_VerseNPC_npc_component_RoamAround, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_RoamAround::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_RoamAround, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_RoamAround::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_RoamAround, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_RoamAround::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$Slide
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_Slide final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Slide">();
	}
	static class Utask_VerseNPC_npc_component_Slide* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Slide>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Slide) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Slide");
static_assert(sizeof(Utask_VerseNPC_npc_component_Slide) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_Slide");
static_assert(offsetof(Utask_VerseNPC_npc_component_Slide, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Slide::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Slide, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Slide::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Slide, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_Slide::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$Sprint
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_Sprint final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Sprint">();
	}
	static class Utask_VerseNPC_npc_component_Sprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Sprint>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Sprint) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Sprint");
static_assert(sizeof(Utask_VerseNPC_npc_component_Sprint) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_Sprint");
static_assert(offsetof(Utask_VerseNPC_npc_component_Sprint, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Sprint::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Sprint, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Sprint::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Sprint, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_Sprint::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$TacticalSprint
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_TacticalSprint final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$TacticalSprint">();
	}
	static class Utask_VerseNPC_npc_component_TacticalSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_TacticalSprint>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_TacticalSprint) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_TacticalSprint");
static_assert(sizeof(Utask_VerseNPC_npc_component_TacticalSprint) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_TacticalSprint");
static_assert(offsetof(Utask_VerseNPC_npc_component_TacticalSprint, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_TacticalSprint::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_TacticalSprint, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_TacticalSprint::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_TacticalSprint, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_TacticalSprint::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.task_VerseNPC_npc_component$Walk
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseNPC_npc_component_Walk final : public UConcurrency_task
{
public:
	class UVerseNPC_npc_component*                _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNPC::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseNPC_npc_component$Walk">();
	}
	static class Utask_VerseNPC_npc_component_Walk* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseNPC_npc_component_Walk>();
	}
};
static_assert(alignof(Utask_VerseNPC_npc_component_Walk) == 0x000008, "Wrong alignment on Utask_VerseNPC_npc_component_Walk");
static_assert(sizeof(Utask_VerseNPC_npc_component_Walk) == 0x000158, "Wrong size on Utask_VerseNPC_npc_component_Walk");
static_assert(offsetof(Utask_VerseNPC_npc_component_Walk, _Self) == 0x000148, "Member 'Utask_VerseNPC_npc_component_Walk::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Walk, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseNPC_npc_component_Walk::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseNPC_npc_component_Walk, _RetVal) == 0x000151, "Member 'Utask_VerseNPC_npc_component_Walk::_RetVal' has a wrong offset!");

// VerseClass VerseNPC.VerseNPC_inventory_component
// 0x00C8 (0x0158 - 0x0090)
class UVerseNPC_inventory_component final : public UInventoryComponentBase
{
public:
	FVerseFunctionProperty_                       __verse_0x55D5AF48__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R; // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7388F5F7__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x011710B3__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5EDD40A0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCAF8BDA2__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7247ECB0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x353458B7__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x677C715F__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x52D1687A__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_120[0x38];                                     // 0x0120(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R(const struct VerseNPC::Ftuple_Lfort__inventory__item__asset_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R(const struct FVerseAIBase_fort_item_descriptor& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R(const struct FVerseAIBase_fort_item_descriptor& __verse_0xB2CDDD72_Argument);
	TArray<struct FVerseAIBase_fort_item_descriptor> _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R(const struct FVerseAIBase_fort_item_descriptor& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R(const struct FVerseAIBase_fort_item_descriptor& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseNPC_inventory_component">();
	}
	static class UVerseNPC_inventory_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseNPC_inventory_component>();
	}
};
static_assert(alignof(UVerseNPC_inventory_component) == 0x000008, "Wrong alignment on UVerseNPC_inventory_component");
static_assert(sizeof(UVerseNPC_inventory_component) == 0x000158, "Wrong size on UVerseNPC_inventory_component");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x55D5AF48__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R) == 0x000090, "Member 'UVerseNPC_inventory_component::__verse_0x55D5AF48__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x7388F5F7__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems) == 0x0000A0, "Member 'UVerseNPC_inventory_component::__verse_0x7388F5F7__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x011710B3__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R) == 0x0000B0, "Member 'UVerseNPC_inventory_component::__verse_0x011710B3__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x5EDD40A0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon) == 0x0000C0, "Member 'UVerseNPC_inventory_component::__verse_0x5EDD40A0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetCurrentWeapon' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0xCAF8BDA2__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R) == 0x0000D0, "Member 'UVerseNPC_inventory_component::__verse_0xCAF8BDA2__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x7247ECB0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R) == 0x0000E0, "Member 'UVerseNPC_inventory_component::__verse_0x7247ECB0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RIsWeaponEquipped_L_Nfort__item__descriptor_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x353458B7__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R) == 0x0000F0, "Member 'UVerseNPC_inventory_component::__verse_0x353458B7__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetWeaponDescriptor_L_Nfort__item__descriptor_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x677C715F__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R) == 0x000100, "Member 'UVerseNPC_inventory_component::__verse_0x677C715F__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RRegisterUseSuggestedWeaponCallback_L_Nfort__item__descriptor_Tlogic_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_inventory_component, __verse_0x52D1687A__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R) == 0x000110, "Member 'UVerseNPC_inventory_component::__verse_0x52D1687A__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RUnregisterUseSuggestedWeaponCallback_L_Nint_R' has a wrong offset!");

// VerseClass VerseNPC.VerseNPC_leash_component
// 0x0030 (0x00D8 - 0x00A8)
class UVerseNPC_leash_component final : public ULeashComponentBase
{
public:
	FVerseFunctionProperty_                       __verse_0x1AFB5507__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC10D4AEC__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x306BB328__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R(const struct VerseNPC::Ftuple_Lagent_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R(const struct VerseNPC::Ftuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseNPC_leash_component">();
	}
	static class UVerseNPC_leash_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseNPC_leash_component>();
	}
};
static_assert(alignof(UVerseNPC_leash_component) == 0x000008, "Wrong alignment on UVerseNPC_leash_component");
static_assert(sizeof(UVerseNPC_leash_component) == 0x0000D8, "Wrong size on UVerseNPC_leash_component");
static_assert(offsetof(UVerseNPC_leash_component, __verse_0x1AFB5507__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R) == 0x0000A8, "Member 'UVerseNPC_leash_component::__verse_0x1AFB5507__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_leash_component, __verse_0xC10D4AEC__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R) == 0x0000B8, "Member 'UVerseNPC_leash_component::__verse_0xC10D4AEC__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UVerseNPC_leash_component, __verse_0x306BB328__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash) == 0x0000C8, "Member 'UVerseNPC_leash_component::__verse_0x306BB328__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__leash__interface_N_RClearLeash' has a wrong offset!");

// VerseClass VerseNPC.VerseNPC_npc_component
// 0x0278 (0x0330 - 0x00B8)
class UVerseNPC_npc_component : public UAIActionsComponent
{
public:
	uint8                                         Pad_B8[0x30];                                      // 0x00B8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       __verse_0xA9D01BCC_RoamAround;                     // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x514829C1_MoveInRangeToAttack;            // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE4D0BB73_Crouch;                         // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD59E8F01_Walk;                           // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x19F8ABA1_Sprint;                         // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCB7DDA42_TacticalSprint;                 // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x91E44EAA_Jump;                           // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD27C8306_Slide;                          // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCE057ADF__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA043FAF9_Idle_L_Nfloat_R;                // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9765CB04_PlayRandomEmote;                // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x75C586C9_Revive_L_Nagent_R;              // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC907A4E0_LookAt_L_Nvector3_R;            // 0x01A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3C8F838B_LootObject_L_Nfort__loot__info_R; // 0x01B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x276F9F03_AttackThreat_L_Nfort__threat__info_R; // 0x01C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7421E7C0_AttackObstacle_L_Nfort__obstacle__info_R; // 0x01D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4EF5F14A__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetCurrentThreatInfo; // 0x01E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x77D2ED1E__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatsInfo; // 0x01F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x09501A7F__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetThreatInfo_L_Nagent_R; // 0x0208(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1C40929F__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RGetOrCreateThreatInfo_L_Nagent_M_Nlogic_R; // 0x0218(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x83990954__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RForgetThreat_L_Nfort__threat__info_R; // 0x0228(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFCAF49DC__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatChangedEvent; // 0x0238(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x49668C09__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__threat__perception__interface_N_RCurrentThreatStatusChangedEvent; // 0x0248(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x47C9249E__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo; // 0x0258(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE7FD7E10__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RObstacleChangedEvent; // 0x0268(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6C1D2881__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot; // 0x0278(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x075D6F58__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent; // 0x0288(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x96D81014__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RFire; // 0x0298(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x48209BC3__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RReload; // 0x02A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3B37FA9B__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__weapon__actions__interface_N_RMeleeAttack; // 0x02B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x74A2518B__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fnavigation__interface_N_RGetCurrentDestination; // 0x02C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1EBBDB13_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R; // 0x02D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7F258131__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fnavigation__interface_N_RStopNavigation; // 0x02E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_2F8[0x18];                                     // 0x02F8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_subscribable_event*        __verse_0xE0E8A985_CurrentThreatChangedEventInternal; // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x12343732_CurrentThreatStatusChangedEventInternal; // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xB7573589_ObstacleChangedEventInternal;   // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x1F8E9B61_BestObjectToLootChangedEventInternal; // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	EVerseAIBase_action_result _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RBestObjectTolootChangedEvent(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__loot__perception__interface_N_RGetBestObjectToLoot(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__obstacle__perception__interface_N_RGetObstacleInfo(const struct VerseNPC::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
