#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseGameplayTags_0

#include "Basic.hpp"

#include "VerseGameplayTags_structs.hpp"
#include "VerseGameplayTags_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R final
{
public:
	struct Ftuple_Ltag__container_Mtag__container_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R, RetVal) == 0x000010, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag__container_M_Ntag__container_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R final
{
public:
	struct Ftuple_Ltag_Mtag_R                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R, RetVal) == 0x000010, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_REquals_L_Ntag_M_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTag_L_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R final
{
public:
	class UTags_tag_search_criteria*              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectsWithTags_L_Ntag__search__criteria_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R) == 0x000010, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RFindObjectWithTag_L_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R
// 0x0010 (0x0010 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R final
{
public:
	struct FVerseGameplayTag                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R) == 0x000010, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTag_L_Ntag__selector_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R
// 0x0010 (0x0010 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R) == 0x000010, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeGameplayTagFromSubClass_L_Ntype_Lany_M_20tag_R_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R
// 0x0020 (0x0020 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	uint64                                        InstancingGraph;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTags_tag_container*                    __verse_0xB482F2DD_CurrentlyInstantiatedObject;    // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R) == 0x000020, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R, InstancingGraph) == 0x000010, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R::InstancingGraph' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R, __verse_0xB482F2DD_CurrentlyInstantiatedObject) == 0x000018, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_N_Ktag_R::__verse_0xB482F2DD_CurrentlyInstantiatedObject' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R final
{
public:
	struct FVerseGameplayTagContainer             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R, RetVal) == 0x000010, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RMakeTagContainer_L_Ntag__selector__container_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag__container_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags._L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R) == 0x000008, "Wrong alignment on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R");
static_assert(sizeof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R) == 0x000018, "Wrong size on Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R, RetVal) == 0x000008, "Member 'Tags__L_2fVerse_2eorg_2fSimulation_2fTags_N_RToString_L_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R) == 0x000010, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R) == 0x000008, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R) == 0x000008, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RAdd_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum final
{
public:
	struct VerseGameplayTags_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum) == 0x000010, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum, RetVal) == 0x000008, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RNum::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R) == 0x000010, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R) == 0x000008, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R) == 0x000010, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R, RetVal) == 0x000008, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RRemove_L_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset
// 0x0001 (0x0001 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset final
{
public:
	struct VerseGameplayTags_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset) == 0x000001, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset) == 0x000001, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RReset::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R) == 0x000008, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container_N_RResetWithSlack_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R) == 0x000010, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R, RetVal) == 0x000008, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R) == 0x000018, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R, RetVal) == 0x000010, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R");
static_assert(sizeof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R) == 0x000018, "Wrong size on Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R, RetVal) == 0x000010, "Member 'Tags_tag_container__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_search_criteria.$InitCDO
// 0x00D8 (0x00D8 - 0x0000)
struct Tags_tag_search_criteria__InitCDO final
{
public:
	TArray<class UTags_tag*>                      _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTags_tag*>                      _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTags_tag*>                      _ExprResult_10;                                    // 0x0090(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_9;                        // 0x00A0(0x0010)(ContainsInstancedReference)
	TArray<class UTags_tag*>                      _ForResult_11;                                     // 0x00B0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_12;                                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_13;                                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_11;                        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x00D1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Tags_tag_search_criteria__InitCDO) == 0x000008, "Wrong alignment on Tags_tag_search_criteria__InitCDO");
static_assert(sizeof(Tags_tag_search_criteria__InitCDO) == 0x0000D8, "Wrong size on Tags_tag_search_criteria__InitCDO");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ExprResult_0) == 0x000000, "Member 'Tags_tag_search_criteria__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, __verse_0xFFC68BC5_Array_1) == 0x000010, "Member 'Tags_tag_search_criteria__InitCDO::__verse_0xFFC68BC5_Array_1' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForResult_1) == 0x000020, "Member 'Tags_tag_search_criteria__InitCDO::_ForResult_1' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForIndex_2) == 0x000030, "Member 'Tags_tag_search_criteria__InitCDO::_ForIndex_2' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForLength_3) == 0x000038, "Member 'Tags_tag_search_criteria__InitCDO::_ForLength_3' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, __verse_0xFB88B569_Item_3) == 0x000040, "Member 'Tags_tag_search_criteria__InitCDO::__verse_0xFB88B569_Item_3' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ExprResult_5) == 0x000048, "Member 'Tags_tag_search_criteria__InitCDO::_ExprResult_5' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, __verse_0xFFC68BC5_Array_5) == 0x000058, "Member 'Tags_tag_search_criteria__InitCDO::__verse_0xFFC68BC5_Array_5' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForResult_6) == 0x000068, "Member 'Tags_tag_search_criteria__InitCDO::_ForResult_6' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForIndex_7) == 0x000078, "Member 'Tags_tag_search_criteria__InitCDO::_ForIndex_7' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForLength_8) == 0x000080, "Member 'Tags_tag_search_criteria__InitCDO::_ForLength_8' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, __verse_0xFB88B569_Item_7) == 0x000088, "Member 'Tags_tag_search_criteria__InitCDO::__verse_0xFB88B569_Item_7' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ExprResult_10) == 0x000090, "Member 'Tags_tag_search_criteria__InitCDO::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, __verse_0xFFC68BC5_Array_9) == 0x0000A0, "Member 'Tags_tag_search_criteria__InitCDO::__verse_0xFFC68BC5_Array_9' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForResult_11) == 0x0000B0, "Member 'Tags_tag_search_criteria__InitCDO::_ForResult_11' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForIndex_12) == 0x0000C0, "Member 'Tags_tag_search_criteria__InitCDO::_ForIndex_12' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, _ForLength_13) == 0x0000C8, "Member 'Tags_tag_search_criteria__InitCDO::_ForLength_13' has a wrong offset!");
static_assert(offsetof(Tags_tag_search_criteria__InitCDO, __verse_0xFB88B569_Item_11) == 0x0000D0, "Member 'Tags_tag_search_criteria__InitCDO::__verse_0xFB88B569_Item_11' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R) == 0x000008, "Wrong alignment on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R");
static_assert(sizeof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R) == 0x000008, "Wrong size on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R");
static_assert(offsetof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RAddTag_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags final
{
public:
	struct VerseGameplayTags_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTags_tag_container*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags) == 0x000008, "Wrong alignment on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags");
static_assert(sizeof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags) == 0x000010, "Wrong size on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags");
static_assert(offsetof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags, RetVal) == 0x000008, "Member 'Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RGetTags::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R) == 0x000008, "Wrong alignment on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R");
static_assert(sizeof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R) == 0x000010, "Wrong size on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R");
static_assert(offsetof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RRemoveTag_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_container_component._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R
// 0x0008 (0x0008 - 0x0000)
struct Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R) == 0x000008, "Wrong alignment on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R");
static_assert(sizeof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R) == 0x000008, "Wrong size on Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R");
static_assert(offsetof(Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_container_component__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__container__component_N_RSetTags_L_Ntag__container_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_view._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R) == 0x000008, "Wrong alignment on Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R");
static_assert(sizeof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R) == 0x000010, "Wrong size on Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R");
static_assert(offsetof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R, RetVal) == 0x000008, "Member 'Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHas_L_Ntag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_view._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R");
static_assert(sizeof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R) == 0x000018, "Wrong size on Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R");
static_assert(offsetof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R, RetVal) == 0x000010, "Member 'Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAll_L_N_Ktag_R::RetVal' has a wrong offset!");

// Function VerseGameplayTags.Tags_tag_view._L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R
// 0x0018 (0x0018 - 0x0000)
struct Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R final
{
public:
	TArray<class UTags_tag*>                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R) == 0x000008, "Wrong alignment on Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R");
static_assert(sizeof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R) == 0x000018, "Wrong size on Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R");
static_assert(offsetof(Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Tags_tag_view__L_2fVerse_2eorg_2fSimulation_2fTags_2ftag__view_N_RHasAny_L_N_Ktag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
