#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAIBase_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseAIBase_classes.hpp"
#include "VerseAssets_classes.hpp"
#include "VerseGameplayTags_0_classes.hpp"


namespace SDK
{

// VerseClass VerseAIBase.VerseAIBase_fort_navigation_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_navigation_interface final : public UObject
{
public:
	class UConcurrency_task* MoveInRangeToAttack(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* RoamAround(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_navigation_interface">();
	}
	static class UVerseAIBase_fort_navigation_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_navigation_interface>();
	}
};
static_assert(alignof(UVerseAIBase_fort_navigation_interface) == 0x000008, "Wrong alignment on UVerseAIBase_fort_navigation_interface");
static_assert(sizeof(UVerseAIBase_fort_navigation_interface) == 0x000028, "Wrong size on UVerseAIBase_fort_navigation_interface");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R
// 0x0038 (0x0180 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_loot_info            __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0028)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$LootObject_L_Nfort__loot__info_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R) == 0x000180, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R, _RetVal) == 0x000178, "Member 'Utask_VerseAIBase_fort_character_actions_interface_LootObject_L_Nfort__loot__info_R::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R
// 0x0038 (0x0180 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_obstacle_info        __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0028)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$AttackObstacle_L_Nfort__obstacle__info_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R) == 0x000180, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R, _RetVal) == 0x000178, "Member 'Utask_VerseAIBase_fort_character_actions_interface_AttackObstacle_L_Nfort__obstacle__info_R::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseAIBase_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseAIBase.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseAIBase_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseAIBase_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseAIBase_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseAIBase_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseAIBase_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseAIBase_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseAIBase.VerseAIBase_fort_item_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_item_tag : public UTags_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_item_tag">();
	}
	static class UVerseAIBase_fort_item_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_item_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_item_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_item_tag");
static_assert(sizeof(UVerseAIBase_fort_item_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_item_tag");

// VerseClass VerseAIBase.VerseAIBase_fort_weapon_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_weapon_tag : public UVerseAIBase_fort_item_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_weapon_tag">();
	}
	static class UVerseAIBase_fort_weapon_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_weapon_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_weapon_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_weapon_tag");
static_assert(sizeof(UVerseAIBase_fort_weapon_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_weapon_tag");

// VerseClass VerseAIBase.VerseAIBase_fort_range_weapon_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_range_weapon_tag : public UVerseAIBase_fort_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_range_weapon_tag">();
	}
	static class UVerseAIBase_fort_range_weapon_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_range_weapon_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_range_weapon_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_range_weapon_tag");
static_assert(sizeof(UVerseAIBase_fort_range_weapon_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_range_weapon_tag");

// VerseClass VerseAIBase.VerseAIBase_fort_LMG_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_LMG_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_LMG_tag">();
	}
	static class UVerseAIBase_fort_LMG_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_LMG_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_LMG_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_LMG_tag");
static_assert(sizeof(UVerseAIBase_fort_LMG_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_LMG_tag");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$LookAt_L_Nvector3_R
// 0x0020 (0x0168 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$LookAt_L_Nvector3_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R) == 0x000168, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_LookAt_L_Nvector3_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VerseAIBase.VerseAIBase_fort_pistol_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_pistol_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_pistol_tag">();
	}
	static class UVerseAIBase_fort_pistol_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_pistol_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_pistol_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_pistol_tag");
static_assert(sizeof(UVerseAIBase_fort_pistol_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_pistol_tag");

// VerseClass VerseAIBase.task_VerseAIBase_ai_behavior$OnBegin
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_ai_behavior_OnBegin final : public UConcurrency_task
{
public:
	class UVerseAIBase_ai_behavior*               _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_ai_behavior$OnBegin">();
	}
	static class Utask_VerseAIBase_ai_behavior_OnBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_ai_behavior_OnBegin>();
	}
};
static_assert(alignof(Utask_VerseAIBase_ai_behavior_OnBegin) == 0x000008, "Wrong alignment on Utask_VerseAIBase_ai_behavior_OnBegin");
static_assert(sizeof(Utask_VerseAIBase_ai_behavior_OnBegin) == 0x000158, "Wrong size on Utask_VerseAIBase_ai_behavior_OnBegin");
static_assert(offsetof(Utask_VerseAIBase_ai_behavior_OnBegin, _Self) == 0x000148, "Member 'Utask_VerseAIBase_ai_behavior_OnBegin::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_ai_behavior_OnBegin, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_ai_behavior_OnBegin::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VerseAIBase.VerseAIBase_fort_grenade_launcher_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_grenade_launcher_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_grenade_launcher_tag">();
	}
	static class UVerseAIBase_fort_grenade_launcher_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_grenade_launcher_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_grenade_launcher_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_grenade_launcher_tag");
static_assert(sizeof(UVerseAIBase_fort_grenade_launcher_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_grenade_launcher_tag");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$PlayRandomEmote
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$PlayRandomEmote">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_actions_interface_PlayRandomEmote::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.VerseAIBase_fort_mini_gun_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_mini_gun_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_mini_gun_tag">();
	}
	static class UVerseAIBase_fort_mini_gun_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_mini_gun_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_mini_gun_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_mini_gun_tag");
static_assert(sizeof(UVerseAIBase_fort_mini_gun_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_mini_gun_tag");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Nfort__threat__info_R
// 0x0040 (0x0188 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0030)(Parm, NoDestructor)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0180(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$AttackThreat_L_Nfort__threat__info_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R) == 0x000188, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R, _RetVal) == 0x000180, "Member 'Utask_VerseAIBase_fort_character_actions_interface_AttackThreat_L_Nfort__threat__info_R::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Idle_L_Nfloat_R
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$Idle_L_Nfloat_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_Idle_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R
// 0x0018 (0x0160 - 0x0148)
class Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_actions_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0158(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_actions_interface$Revive_L_Nagent_R">();
	}
	static class Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R");
static_assert(sizeof(Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R) == 0x000160, "Wrong size on Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R, _RetVal) == 0x000158, "Member 'Utask_VerseAIBase_fort_character_actions_interface_Revive_L_Nagent_R::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.VerseAIBase_fort_bow_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_bow_tag final : public UVerseAIBase_fort_range_weapon_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_bow_tag">();
	}
	static class UVerseAIBase_fort_bow_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_bow_tag>();
	}
};
static_assert(alignof(UVerseAIBase_fort_bow_tag) == 0x000008, "Wrong alignment on UVerseAIBase_fort_bow_tag");
static_assert(sizeof(UVerseAIBase_fort_bow_tag) == 0x000028, "Wrong size on UVerseAIBase_fort_bow_tag");

// VerseClass VerseAIBase.VerseAIBase_fort_item_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_item_interface final : public UObject
{
public:
	static uint8 _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__item__interface_N_RHasTag_L_Nfort__item__descriptor_M_Nfort__item__tag_R(const struct VerseAIBase_0::Ftuple_Lfort__item__descriptor_Mfort__item__tag_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_item_interface">();
	}
	static class UVerseAIBase_fort_item_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_item_interface>();
	}
};
static_assert(alignof(UVerseAIBase_fort_item_interface) == 0x000008, "Wrong alignment on UVerseAIBase_fort_item_interface");
static_assert(sizeof(UVerseAIBase_fort_item_interface) == 0x000028, "Wrong size on UVerseAIBase_fort_item_interface");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Crouch
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_movement_interface_Crouch final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Crouch">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Crouch* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Crouch>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_movement_interface_Crouch) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_movement_interface_Crouch");
static_assert(sizeof(Utask_VerseAIBase_fort_character_movement_interface_Crouch) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_movement_interface_Crouch");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Crouch, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Crouch::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Crouch, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Crouch::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Crouch, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Crouch::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Jump
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_movement_interface_Jump final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Jump">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Jump* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Jump>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_movement_interface_Jump) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_movement_interface_Jump");
static_assert(sizeof(Utask_VerseAIBase_fort_character_movement_interface_Jump) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_movement_interface_Jump");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Jump, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Jump::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Jump, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Jump::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Jump, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Jump::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Slide
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_movement_interface_Slide final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Slide">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Slide* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Slide>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_movement_interface_Slide) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_movement_interface_Slide");
static_assert(sizeof(Utask_VerseAIBase_fort_character_movement_interface_Slide) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_movement_interface_Slide");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Slide, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Slide::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Slide, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Slide::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Slide, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Slide::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Sprint
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_movement_interface_Sprint final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Sprint">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Sprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Sprint>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_movement_interface_Sprint) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_movement_interface_Sprint");
static_assert(sizeof(Utask_VerseAIBase_fort_character_movement_interface_Sprint) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_movement_interface_Sprint");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Sprint, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Sprint::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Sprint, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Sprint::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Sprint, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Sprint::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$TacticalSprint
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$TacticalSprint">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint");
static_assert(sizeof(Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_movement_interface_TacticalSprint::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_character_movement_interface$Walk
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_character_movement_interface_Walk final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_character_movement_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_character_movement_interface$Walk">();
	}
	static class Utask_VerseAIBase_fort_character_movement_interface_Walk* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_character_movement_interface_Walk>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_character_movement_interface_Walk) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_character_movement_interface_Walk");
static_assert(sizeof(Utask_VerseAIBase_fort_character_movement_interface_Walk) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_character_movement_interface_Walk");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Walk, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Walk::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Walk, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Walk::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_character_movement_interface_Walk, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_character_movement_interface_Walk::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_navigation_interface$MoveInRangeToAttack
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_navigation_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_action_result                    _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_navigation_interface$MoveInRangeToAttack">();
	}
	static class Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack");
static_assert(sizeof(Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack");
static_assert(offsetof(Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_navigation_interface_MoveInRangeToAttack::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_fort_navigation_interface$RoamAround
// 0x0010 (0x0158 - 0x0148)
class Utask_VerseAIBase_fort_navigation_interface_RoamAround final : public UConcurrency_task
{
public:
	class UVerseAIBase_fort_navigation_interface* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	EVerseAIBase_navigation_result                _RetVal;                                           // 0x0151(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_fort_navigation_interface$RoamAround">();
	}
	static class Utask_VerseAIBase_fort_navigation_interface_RoamAround* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_fort_navigation_interface_RoamAround>();
	}
};
static_assert(alignof(Utask_VerseAIBase_fort_navigation_interface_RoamAround) == 0x000008, "Wrong alignment on Utask_VerseAIBase_fort_navigation_interface_RoamAround");
static_assert(sizeof(Utask_VerseAIBase_fort_navigation_interface_RoamAround) == 0x000158, "Wrong size on Utask_VerseAIBase_fort_navigation_interface_RoamAround");
static_assert(offsetof(Utask_VerseAIBase_fort_navigation_interface_RoamAround, _Self) == 0x000148, "Member 'Utask_VerseAIBase_fort_navigation_interface_RoamAround::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_navigation_interface_RoamAround, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_fort_navigation_interface_RoamAround::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_fort_navigation_interface_RoamAround, _RetVal) == 0x000151, "Member 'Utask_VerseAIBase_fort_navigation_interface_RoamAround::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.task_VerseAIBase_navigation_interface$NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R
// 0x0028 (0x0170 - 0x0148)
class Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R final : public UConcurrency_task
{
public:
	class UVerseAIBase_navigation_interface*      _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAIBase_0::Ftuple_Lnavigation__target_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0018)(Parm, HasGetValueTypeHash)
	EVerseAIBase_navigation_result                _RetVal;                                           // 0x0168(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseAIBase_navigation_interface$NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R">();
	}
	static class Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R>();
	}
};
static_assert(alignof(Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R) == 0x000008, "Wrong alignment on Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R");
static_assert(sizeof(Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R) == 0x000170, "Wrong size on Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R");
static_assert(offsetof(Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R, _Self) == 0x000148, "Member 'Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R, _RetVal) == 0x000168, "Member 'Utask_VerseAIBase_navigation_interface_NavigateTo_L_Nnavigation__target_M_Nfloat_M_Nlogic_R::_RetVal' has a wrong offset!");

// VerseClass VerseAIBase.VerseAIBase
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase final : public UObject
{
public:
	static struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RGetThreatLocation_L_Nfort__threat__info_R(const struct FVerseAIBase_fort_threat_info& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UVerseAIBase_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__loot__info_R(const struct FVerseAIBase_fort_loot_info& __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UVerseAIBase_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nfort__threat__info_R(const struct FVerseAIBase_fort_threat_info& __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UVerseAIBase_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_RMakeNavigationTarget_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument, uint64 InstancingGraph, class UVerseAIBase_navigation_target* __verse_0xB482F2DD_CurrentlyInstantiatedObject);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterActions_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortCharacterMovement_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortInventory_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLeash_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortLootPerception_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortNavigation_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortObstaclePerception_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortThreatPerception_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_N_Roperator_U_2eGetFortWeaponActions_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseAIBase_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FVerseAIBase_fort_item_descriptor VerseAIBase_fort_item_descriptor_Factory();
	static struct FVerseAIBase_fort_loot_info VerseAIBase_fort_loot_info_Factory();
	static struct FVerseAIBase_fort_obstacle_info VerseAIBase_fort_obstacle_info_Factory();
	static struct FVerseAIBase_fort_threat_info VerseAIBase_fort_threat_info_Factory();
	static struct FVerseAIBase_fort_weapon_descriptor VerseAIBase_fort_weapon_descriptor_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase">();
	}
	static class UVerseAIBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase>();
	}
};
static_assert(alignof(UVerseAIBase) == 0x000008, "Wrong alignment on UVerseAIBase");
static_assert(sizeof(UVerseAIBase) == 0x000028, "Wrong size on UVerseAIBase");

// VerseClass VerseAIBase.VerseAIBase_ai_behavior
// 0x0038 (0x00C8 - 0x0090)
class UVerseAIBase_ai_behavior : public UAIBehaviorScript
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBB3A9AC0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0C06B9E8__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_ai_behavior">();
	}
	static class UVerseAIBase_ai_behavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_ai_behavior>();
	}
};
static_assert(alignof(UVerseAIBase_ai_behavior) == 0x000008, "Wrong alignment on UVerseAIBase_ai_behavior");
static_assert(sizeof(UVerseAIBase_ai_behavior) == 0x0000C8, "Wrong size on UVerseAIBase_ai_behavior");
static_assert(offsetof(UVerseAIBase_ai_behavior, __verse_0x1F792AAA_OnBegin) == 0x000090, "Member 'UVerseAIBase_ai_behavior::__verse_0x1F792AAA_OnBegin' has a wrong offset!");
static_assert(offsetof(UVerseAIBase_ai_behavior, __verse_0xBB3A9AC0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd) == 0x0000A0, "Member 'UVerseAIBase_ai_behavior::__verse_0xBB3A9AC0__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd' has a wrong offset!");
static_assert(offsetof(UVerseAIBase_ai_behavior, __verse_0x0C06B9E8__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent) == 0x0000B0, "Member 'UVerseAIBase_ai_behavior::__verse_0x0C06B9E8__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_RGetAgent' has a wrong offset!");

// VerseClass VerseAIBase.VerseAIBase_fort_character_actions_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_character_actions_interface final : public UObject
{
public:
	class UConcurrency_task* AttackObstacle_L_Nfort__obstacle__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FVerseAIBase_fort_obstacle_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* AttackThreat_L_Nfort__threat__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FVerseAIBase_fort_threat_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Idle_L_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAt_L_Nvector3_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LootObject_L_Nfort__loot__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FVerseAIBase_fort_loot_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* PlayRandomEmote(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Revive_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_character_actions_interface">();
	}
	static class UVerseAIBase_fort_character_actions_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_character_actions_interface>();
	}
};
static_assert(alignof(UVerseAIBase_fort_character_actions_interface) == 0x000008, "Wrong alignment on UVerseAIBase_fort_character_actions_interface");
static_assert(sizeof(UVerseAIBase_fort_character_actions_interface) == 0x000028, "Wrong size on UVerseAIBase_fort_character_actions_interface");

// VerseClass VerseAIBase.VerseAIBase_fort_character_movement_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_character_movement_interface final : public UObject
{
public:
	EVerseAIBase_action_result _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__character__movement__interface_N_RStandUp(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Crouch(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Jump(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Slide(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Sprint(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* TacticalSprint(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Walk(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_character_movement_interface">();
	}
	static class UVerseAIBase_fort_character_movement_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_character_movement_interface>();
	}
};
static_assert(alignof(UVerseAIBase_fort_character_movement_interface) == 0x000008, "Wrong alignment on UVerseAIBase_fort_character_movement_interface");
static_assert(sizeof(UVerseAIBase_fort_character_movement_interface) == 0x000028, "Wrong size on UVerseAIBase_fort_character_movement_interface");

// VerseClass VerseAIBase.VerseAIBase_fort_creature_actions_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_creature_actions_interface final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAIBase_fort_creature_actions_interface">();
	}
	static class UVerseAIBase_fort_creature_actions_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAIBase_fort_creature_actions_interface>();
	}
};
static_assert(alignof(UVerseAIBase_fort_creature_actions_interface) == 0x000008, "Wrong alignment on UVerseAIBase_fort_creature_actions_interface");
static_assert(sizeof(UVerseAIBase_fort_creature_actions_interface) == 0x000028, "Wrong size on UVerseAIBase_fort_creature_actions_interface");

// VerseClass VerseAIBase.VerseAIBase_fort_inventory_interface
// 0x0000 (0x0028 - 0x0028)
class UVerseAIBase_fort_inventory_interface final : public UObject
{
public:
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RAddItemToInventory_L_Nfort__inventory__item__asset_M_Nint_R(const struct VerseAIBase_0::Ftuple_Lfort__inventory__item__asset_Mint_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RDropItem_L_Nfort__item__descriptor_R(const struct FVerseAIBase_fort_item_descriptor& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_REquipWeapon_L_Nfort__item__descriptor_R(const struct FVerseAIBase_fort_item_descriptor& __verse_0xB2CDDD72_Argument);
	TArray<struct FVerseAIBase_fort_item_descriptor> _L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2ffort__inventory__interface_N_RGetAllItems(const struct VerseAIBase_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
