#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteInternal_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseFortniteInternal_0_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteInternal.Game_fort_playspace_component.__WaitForPlayerEliminated
// 0x0028 (0x0028 - 0x0000)
struct Game_fort_playspace_component___WaitForPlayerEliminated final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_fort_playspace_component___WaitForPlayerEliminated) == 0x000008, "Wrong alignment on Game_fort_playspace_component___WaitForPlayerEliminated");
static_assert(sizeof(Game_fort_playspace_component___WaitForPlayerEliminated) == 0x000028, "Wrong size on Game_fort_playspace_component___WaitForPlayerEliminated");
static_assert(offsetof(Game_fort_playspace_component___WaitForPlayerEliminated, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'Game_fort_playspace_component___WaitForPlayerEliminated::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(Game_fort_playspace_component___WaitForPlayerEliminated, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'Game_fort_playspace_component___WaitForPlayerEliminated::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(Game_fort_playspace_component___WaitForPlayerEliminated, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'Game_fort_playspace_component___WaitForPlayerEliminated::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(Game_fort_playspace_component___WaitForPlayerEliminated, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'Game_fort_playspace_component___WaitForPlayerEliminated::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_fort_playspace_component___WaitForPlayerEliminated, RetVal) == 0x000020, "Member 'Game_fort_playspace_component___WaitForPlayerEliminated::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R
// 0x0020 (0x0020 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R final
{
public:
	struct Ftuple_Lcomponent_Mcomponent_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
static_assert(alignof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R) == 0x000008, "Wrong alignment on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R");
static_assert(sizeof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R) == 0x000020, "Wrong size on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R");
static_assert(offsetof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R, RetVal) == 0x000010, "Member 'Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Ncomponent_M_Ntype_Lany_M_20component_R_R::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R) == 0x000008, "Wrong alignment on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R");
static_assert(sizeof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R) == 0x000010, "Wrong size on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R");
static_assert(offsetof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R, RetVal) == 0x000008, "Member 'Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R final
{
public:
	struct Ftuple_Lplayer__component_Mplayer__start__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R) == 0x000008, "Wrong alignment on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R");
static_assert(sizeof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R) == 0x000010, "Wrong size on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R");
static_assert(offsetof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RrespawnPlayer_L_Nplayer__component_M_Nplayer__start__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R final
{
public:
	struct Ftuple_Lcomponent_Mlogic_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R) == 0x000008, "Wrong alignment on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R");
static_assert(sizeof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R) == 0x000010, "Wrong size on Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R");
static_assert(offsetof(Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RsetAutoRespawnEnabled_L_Ncomponent_M_Nlogic_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Player_PlayerTravel._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R) == 0x000008, "Wrong alignment on Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R");
static_assert(sizeof(Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R) == 0x000008, "Wrong size on Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R");
static_assert(offsetof(Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Player_PlayerTravel__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerTravel_N_RSendToLobby_L_Nplayer_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R final
{
public:
	struct Ftuple_Lgameplay__effect__asset_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R) == 0x000008, "Wrong alignment on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R");
static_assert(sizeof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R) == 0x000010, "Wrong size on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R");
static_assert(offsetof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RApplyGameplayEffectToSelf_L_Ngameplay__effect__asset_M_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R) == 0x000008, "Wrong alignment on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R");
static_assert(sizeof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R) == 0x000008, "Wrong size on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R");
static_assert(offsetof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RClearAbility_L_Nany_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R) == 0x000008, "Wrong alignment on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R");
static_assert(sizeof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R) == 0x000008, "Wrong size on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R");
static_assert(offsetof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbility_L_Nany_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R) == 0x000008, "Wrong alignment on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R");
static_assert(sizeof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R) == 0x000008, "Wrong size on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R");
static_assert(offsetof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnce_L_Nany_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lany_Mability__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R) == 0x000008, "Wrong alignment on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R");
static_assert(sizeof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R) == 0x000010, "Wrong size on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R");
static_assert(offsetof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RGiveAbilityAndActivateOnceWithTarget_L_Nany_M_Nability__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_ability_component._L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R) == 0x000008, "Wrong alignment on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R");
static_assert(sizeof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R) == 0x000010, "Wrong size on Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R");
static_assert(offsetof(Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_ability_component__L_2fFortnite_2ecom_2fGame_2fAbilities_2fability__component_N_RTryActivateAbility_L_Nany_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_AbilityComponent._L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R final
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R) == 0x000008, "Wrong alignment on Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R");
static_assert(sizeof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R) == 0x000010, "Wrong size on Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R");
static_assert(offsetof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R, RetVal) == 0x000008, "Member 'Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_AbilityComponent._L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R) == 0x000008, "Wrong alignment on Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R");
static_assert(sizeof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R) == 0x000010, "Wrong size on Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R");
static_assert(offsetof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R, RetVal) == 0x000008, "Member 'Game_Abilities_AbilityComponent__L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R) == 0x000008, "Wrong alignment on Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R");
static_assert(sizeof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R) == 0x000010, "Wrong size on Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R");
static_assert(offsetof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R, RetVal) == 0x000008, "Member 'Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RGetStatValue_L_Nint_R::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R) == 0x000008, "Wrong alignment on Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R");
static_assert(sizeof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R) == 0x000018, "Wrong size on Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R");
static_assert(offsetof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RIncrementStat_L_Nint_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_stat_container._L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R final
{
public:
	struct VerseFortniteInternal_0::Ftuple_Lint_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R) == 0x000008, "Wrong alignment on Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R");
static_assert(sizeof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R) == 0x000018, "Wrong size on Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R");
static_assert(offsetof(Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_stat_container__L_2fFortnite_2ecom_2fGame_2fstat__container_N_RSetStatValue_L_Nint_M_Nint_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Abilities_gameplay_ability_asset._L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType
// 0x0010 (0x0010 - 0x0000)
struct Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType) == 0x000008, "Wrong alignment on Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType");
static_assert(sizeof(Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType) == 0x000010, "Wrong size on Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType");
static_assert(offsetof(Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType, RetVal) == 0x000008, "Member 'Game_Abilities_gameplay_ability_asset__L_2fFortnite_2ecom_2fGame_2fAbilities_2fgameplay__ability__asset_N_RGetAbilityType::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R) == 0x000001, "Wrong alignment on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R");
static_assert(sizeof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R) == 0x000001, "Wrong size on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R");
static_assert(offsetof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R) == 0x000001, "Wrong alignment on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R");
static_assert(sizeof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R) == 0x000001, "Wrong size on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R");
static_assert(offsetof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R) == 0x000001, "Wrong alignment on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R");
static_assert(sizeof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R) == 0x000001, "Wrong size on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R");
static_assert(offsetof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R) == 0x000001, "Wrong alignment on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R");
static_assert(sizeof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R) == 0x000001, "Wrong size on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R");
static_assert(offsetof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R) == 0x000001, "Wrong alignment on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R");
static_assert(sizeof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R) == 0x000001, "Wrong size on Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R");
static_assert(offsetof(Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged) == 0x000001, "Wrong alignment on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged");
static_assert(sizeof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged) == 0x000002, "Wrong size on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged");
static_assert(offsetof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced) == 0x000001, "Wrong alignment on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced");
static_assert(sizeof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced) == 0x000002, "Wrong size on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced");
static_assert(offsetof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R) == 0x000001, "Wrong alignment on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R");
static_assert(sizeof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R) == 0x000001, "Wrong size on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R");

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R) == 0x000001, "Wrong alignment on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R");
static_assert(sizeof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R) == 0x000001, "Wrong size on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R");

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt) == 0x000001, "Wrong alignment on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt");
static_assert(sizeof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt) == 0x000002, "Wrong size on Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt");
static_assert(offsetof(Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R final
{
public:
	struct Ftuple_Litem__type_Mint_Mplayer__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R) == 0x000008, "Wrong alignment on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R");
static_assert(sizeof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R) == 0x000018, "Wrong size on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RattemptPartialCollect_L_Nitem__type_M_Nint_M_Nplayer__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R
// 0x0010 (0x0010 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R final
{
public:
	class UGame_Item_item_type*                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R) == 0x000008, "Wrong alignment on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R");
static_assert(sizeof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R) == 0x000010, "Wrong size on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R, RetVal) == 0x000008, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetNumOfItemType_L_Nitem__type_R::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType
// 0x0010 (0x0010 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType final
{
public:
	struct VerseFortniteInternal_0::Ftuple_L_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_Item_item_type*                   RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType) == 0x000008, "Wrong alignment on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType");
static_assert(sizeof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType) == 0x000010, "Wrong size on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType, RetVal) == 0x000008, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgetPrimaryItemType::RetVal' has a wrong offset!");

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R
// 0x0008 (0x0008 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R) == 0x000008, "Wrong alignment on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R");
static_assert(sizeof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R) == 0x000008, "Wrong size on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RgivePickupTo_L_Nplayer__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Item_player_pickup_component._L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R
// 0x0020 (0x0020 - 0x0000)
struct Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R final
{
public:
	struct Ftuple_Lvector3_M_Qplayer__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R) == 0x000008, "Wrong alignment on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R");
static_assert(sizeof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R) == 0x000020, "Wrong size on Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R");
static_assert(offsetof(Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Item_player_pickup_component__L_2fFortnite_2ecom_2fGame_2fItem_2fplayer__pickup__component_N_RtossPickup_L_Nvector3_M_N_Qplayer__component_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteInternal.Game_Player_PlayerStatus._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R final
{
public:
	struct Ftuple_Lplayer__component_Mplayer__status__type_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R) == 0x000008, "Wrong alignment on Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R");
static_assert(sizeof(Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R) == 0x000018, "Wrong size on Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R");
static_assert(offsetof(Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

