#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseArchetypes

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseAIBase_0_structs.hpp"
#include "VerseAIBase_0_classes.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseArchetypes_structs.hpp"
#include "Verse_structs.hpp"


namespace SDK
{

// VerseClass VerseArchetypes.task_VerseArchetypes_sniper_ai$RunGameplayLogic
// 0x03F8 (0x0540 - 0x0148)
class Utask_VerseArchetypes_sniper_ai_RunGameplayLogic final : public UConcurrency_task
{
public:
	class UVerseArchetypes_sniper_ai*             _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x0F05355D_ThreatPerception_1;             // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x1EB80E5B_ThreatInfo_1;                   // 0x0168(0x0031)(NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          _ExprResult_1;                                     // 0x01A0(0x0030)(NoDestructor)
	class UObject*                                __verse_0x00000000__2;                             // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_2;                                // 0x01D8(0x0031)(NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0210(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_4;                                     // 0x0220(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          __verse_0x2CFDBF0A_CurrentThreat_4;                // 0x0228(0x0030)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_5;                                // 0x0258(0x0031)(NoDestructor)
	uint8                                         _AsyncBeginCount_6 : 1;                            // 0x0289(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_289_1 : 7;                                  // 0x0289(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_7 : 1;                            // 0x028A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_28B[0x5];                                      // 0x028B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_8;                                      // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_9;                                 // 0x0298(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_10;                                   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_11 : 1;                           // 0x02B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          __verse_0xEBCD492A_NewThreatInfo_5;                // 0x02B8(0x0030)(NoDestructor)
	class UObject*                                __verse_0x00000000__6;                             // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__7;                             // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x02F8(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_13;                                    // 0x0308(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_15;                                     // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_16;                                // 0x0328(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_17;                                    // 0x0338(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_18;                                   // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_19;                                    // 0x0348(0x0031)(NoDestructor)
	uint8                                         _AsyncBeginCount_20 : 1;                           // 0x0379(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          __verse_0xE0991445_UpdatedThreatInfo_8;            // 0x0380(0x0030)(NoDestructor)
	class UObject*                                __verse_0x00000000__9;                             // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__10;                            // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x03C0(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_22;                                    // 0x03D0(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x03D8(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_24;                                     // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_25;                                // 0x03F0(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_26;                                    // 0x0400(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_27;                                   // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_28;                                    // 0x0410(0x0031)(NoDestructor)
	uint8                                         _AsyncBeginCount_29 : 1;                           // 0x0441(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_441_1 : 7;                                  // 0x0441(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_30 : 1;                           // 0x0442(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_31;                                     // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_32;                                // 0x0450(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_33;                                    // 0x0460(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_34;                                   // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_35 : 1;                           // 0x0470(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAIBase_fort_threat_info          __verse_0xEBCD492A_NewThreatInfo_12;               // 0x0478(0x0030)(NoDestructor)
	class UObject*                                __verse_0x00000000__13;                            // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__14;                            // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_36;                                        // 0x04B8(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_37;                                    // 0x04C8(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_38;                                    // 0x04D0(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_39;                                     // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_40;                                // 0x04E8(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_41;                                    // 0x04F8(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_42;                                   // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_43;                                    // 0x0508(0x0031)(NoDestructor)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseArchetypes_sniper_ai$RunGameplayLogic">();
	}
	static class Utask_VerseArchetypes_sniper_ai_RunGameplayLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseArchetypes_sniper_ai_RunGameplayLogic>();
	}
};
static_assert(alignof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic) == 0x000008, "Wrong alignment on Utask_VerseArchetypes_sniper_ai_RunGameplayLogic");
static_assert(sizeof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic) == 0x000540, "Wrong size on Utask_VerseArchetypes_sniper_ai_RunGameplayLogic");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _Self) == 0x000148, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x0F05355D_ThreatPerception_1) == 0x000158, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x0F05355D_ThreatPerception_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResultStack_0) == 0x000160, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x1EB80E5B_ThreatInfo_1) == 0x000168, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x1EB80E5B_ThreatInfo_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_1) == 0x0001A0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__2) == 0x0001D0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__2' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResultStack_2) == 0x0001D8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResultStack_2' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _Callee_3) == 0x000210, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_Callee_3' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_4) == 0x000220, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x2CFDBF0A_CurrentThreat_4) == 0x000228, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x2CFDBF0A_CurrentThreat_4' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResultStack_5) == 0x000258, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResultStack_5' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTask_8) == 0x000290, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTask_8' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTaskClass_9) == 0x000298, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTaskClass_9' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncResult_10) == 0x0002A8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncResult_10' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0xEBCD492A_NewThreatInfo_5) == 0x0002B8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0xEBCD492A_NewThreatInfo_5' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__6) == 0x0002E8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__6' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__7) == 0x0002F0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__7' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _Callee_12) == 0x0002F8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_Callee_12' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_13) == 0x000308, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_13' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_14) == 0x000310, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_14' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTask_15) == 0x000320, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTask_15' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTaskClass_16) == 0x000328, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTaskClass_16' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_17) == 0x000338, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_17' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncResult_18) == 0x000340, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncResult_18' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_19) == 0x000348, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_19' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0xE0991445_UpdatedThreatInfo_8) == 0x000380, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0xE0991445_UpdatedThreatInfo_8' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__9) == 0x0003B0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__9' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__10) == 0x0003B8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__10' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _Callee_21) == 0x0003C0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_Callee_21' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_22) == 0x0003D0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_22' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_23) == 0x0003D8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_23' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTask_24) == 0x0003E8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTask_24' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTaskClass_25) == 0x0003F0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTaskClass_25' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_26) == 0x000400, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_26' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncResult_27) == 0x000408, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncResult_27' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_28) == 0x000410, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_28' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTask_31) == 0x000448, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTask_31' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTaskClass_32) == 0x000450, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTaskClass_32' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_33) == 0x000460, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_33' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncResult_34) == 0x000468, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncResult_34' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0xEBCD492A_NewThreatInfo_12) == 0x000478, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0xEBCD492A_NewThreatInfo_12' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__13) == 0x0004A8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__13' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, __verse_0x00000000__14) == 0x0004B0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::__verse_0x00000000__14' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _Callee_36) == 0x0004B8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_Callee_36' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_37) == 0x0004C8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_37' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_38) == 0x0004D0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_38' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTask_39) == 0x0004E0, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTask_39' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncTaskClass_40) == 0x0004E8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncTaskClass_40' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_41) == 0x0004F8, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_41' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _AsyncResult_42) == 0x000500, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_AsyncResult_42' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_RunGameplayLogic, _ExprResult_43) == 0x000508, "Member 'Utask_VerseArchetypes_sniper_ai_RunGameplayLogic::_ExprResult_43' has a wrong offset!");

// VerseClass VerseArchetypes.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseArchetypes::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseArchetypes.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseArchetypes::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseArchetypes::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseArchetypes::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseArchetypes::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseArchetypes::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseArchetypes::U_SolarisSignatureFunctionOuter");

// VerseClass VerseArchetypes.task_VerseArchetypes_sniper_ai$SelectFightingStance_L_Nfort__threat__info_R
// 0x0260 (0x03A8 - 0x0148)
class Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R final : public UConcurrency_task
{
public:
	class UVerseArchetypes_sniper_ai*             _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0030)(Parm, NoDestructor)
	class UObject*                                __verse_0xCCC0089F_Navigation_1;                   // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0188(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0xA26259EF_Movement_1;                     // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0198(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x2E1D28B3_Inventory_1;                    // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_2;                                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x91E0A2A2_NPCActions_1;                   // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_3;                                // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVerseAIBase_fort_item_descriptor      __verse_0xE0E78A95_CurrentWeapon_3;                // 0x01C0(0x0018)(NoDestructor)
	class UObject*                                __verse_0x00000000__4;                             // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_4;                                // 0x01E0(0x0019)(NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0200(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_6;                                     // 0x0210(0x0001)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_7;                                // 0x0211(0x0002)(NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResultStack_8 : 1;                            // 0x0213(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0218(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_Lfort__item__descriptor_Mfort__item__tag_R _ExprResult_10;                                    // 0x0228(0x0020)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_11 : 1;                           // 0x0248(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_248_1 : 7;                                  // 0x0248(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_12 : 1;                           // 0x0249(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_13;                                     // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_14;                                // 0x0258(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_15;                                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_16 : 1;                           // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__7;                             // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_17;                                     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_18;                                // 0x0288(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_19;                                    // 0x0298(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_20;                                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_21 : 1;                           // 0x02A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_22;                                     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_23;                                // 0x02B8(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_24;                                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_25 : 1;                           // 0x02D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           __verse_0x00000000__8;                             // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_26;                                     // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_27;                                // 0x02E8(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_28;                                    // 0x02F8(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_29;                                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_30 : 1;                           // 0x0308(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_308_1 : 7;                                  // 0x0308(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_31 : 1;                           // 0x0309(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__10;                            // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_32;                                     // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_33;                                // 0x0320(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_34;                                   // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_35 : 1;                           // 0x0338(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__11;                            // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_36;                                     // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_37;                                // 0x0350(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_38;                                    // 0x0360(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_39;                                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_40 : 1;                           // 0x0370(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           __verse_0x00000000__12;                            // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_41;                                     // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_42;                                // 0x0388(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_43;                                    // 0x0398(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_44;                                   // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseArchetypes_sniper_ai$SelectFightingStance_L_Nfort__threat__info_R">();
	}
	static class Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R>();
	}
};
static_assert(alignof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R) == 0x000008, "Wrong alignment on Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R");
static_assert(sizeof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R) == 0x0003A8, "Wrong size on Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _Self) == 0x000148, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0xCCC0089F_Navigation_1) == 0x000180, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0xCCC0089F_Navigation_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResultStack_0) == 0x000188, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0xA26259EF_Movement_1) == 0x000190, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0xA26259EF_Movement_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResultStack_1) == 0x000198, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResultStack_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x2E1D28B3_Inventory_1) == 0x0001A0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x2E1D28B3_Inventory_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResultStack_2) == 0x0001A8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResultStack_2' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x91E0A2A2_NPCActions_1) == 0x0001B0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x91E0A2A2_NPCActions_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResultStack_3) == 0x0001B8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResultStack_3' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0xE0E78A95_CurrentWeapon_3) == 0x0001C0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0xE0E78A95_CurrentWeapon_3' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x00000000__4) == 0x0001D8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x00000000__4' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResultStack_4) == 0x0001E0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResultStack_4' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _Callee_5) == 0x000200, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_Callee_5' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResult_6) == 0x000210, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResult_6' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResultStack_7) == 0x000211, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResultStack_7' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _Callee_9) == 0x000218, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_Callee_9' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResult_10) == 0x000228, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_13) == 0x000250, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_13' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_14) == 0x000258, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_14' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_15) == 0x000268, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_15' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x00000000__7) == 0x000278, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x00000000__7' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_17) == 0x000280, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_17' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_18) == 0x000288, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_18' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResult_19) == 0x000298, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResult_19' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_20) == 0x0002A0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_20' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_22) == 0x0002B0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_22' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_23) == 0x0002B8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_23' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_24) == 0x0002C8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_24' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x00000000__8) == 0x0002D8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x00000000__8' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_26) == 0x0002E0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_26' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_27) == 0x0002E8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_27' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResult_28) == 0x0002F8, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResult_28' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_29) == 0x000300, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_29' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x00000000__10) == 0x000310, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x00000000__10' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_32) == 0x000318, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_32' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_33) == 0x000320, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_33' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_34) == 0x000330, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_34' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x00000000__11) == 0x000340, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x00000000__11' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_36) == 0x000348, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_36' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_37) == 0x000350, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_37' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResult_38) == 0x000360, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResult_38' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_39) == 0x000368, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_39' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, __verse_0x00000000__12) == 0x000378, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::__verse_0x00000000__12' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTask_41) == 0x000380, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTask_41' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncTaskClass_42) == 0x000388, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncTaskClass_42' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _ExprResult_43) == 0x000398, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_ExprResult_43' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R, _AsyncResult_44) == 0x0003A0, "Member 'Utask_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R::_AsyncResult_44' has a wrong offset!");

// VerseClass VerseArchetypes.task_VerseArchetypes_sniper_ai$LookAtThreat_L_Nfort__threat__info_R
// 0x00C8 (0x0210 - 0x0148)
class Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R final : public UConcurrency_task
{
public:
	class UVerseArchetypes_sniper_ai*             _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0030)(Parm, NoDestructor)
	class UObject*                                __verse_0x91E0A2A2_NPCActions_1;                   // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0188(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_1 : 1;                            // 0x0190(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_190_1 : 7;                                  // 0x0190(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_2 : 1;                            // 0x0191(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__3;                             // 0x0198(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_4;                                 // 0x01A8(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResultStack_5;                                // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x01D0(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_7;                                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_8 : 1;                            // 0x01E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_9;                                      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_10;                                // 0x01F8(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncResult_11;                                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseArchetypes_sniper_ai$LookAtThreat_L_Nfort__threat__info_R">();
	}
	static class Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R>();
	}
};
static_assert(alignof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R) == 0x000008, "Wrong alignment on Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R");
static_assert(sizeof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R) == 0x000210, "Wrong size on Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _Self) == 0x000148, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_Self' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0x91E0A2A2_NPCActions_1) == 0x000180, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0x91E0A2A2_NPCActions_1' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _ExprResultStack_0) == 0x000188, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0x00000000__3) == 0x000198, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0x00000000__3' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _AsyncTask_3) == 0x0001A0, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_AsyncTask_3' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _AsyncTaskClass_4) == 0x0001A8, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_AsyncTaskClass_4' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _ExprResultStack_5) == 0x0001B8, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_ExprResultStack_5' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _Callee_6) == 0x0001D0, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_Callee_6' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _AsyncResult_7) == 0x0001E0, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_AsyncResult_7' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _AsyncTask_9) == 0x0001F0, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_AsyncTask_9' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _AsyncTaskClass_10) == 0x0001F8, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_AsyncTaskClass_10' has a wrong offset!");
static_assert(offsetof(Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, _AsyncResult_11) == 0x000208, "Member 'Utask_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::_AsyncResult_11' has a wrong offset!");

// VerseClass VerseArchetypes.task_VerseArchetypes_sniper_ai$TryToAttackThreat_L_Nfort__threat__info_R
// 0x00E8 (0x0230 - 0x0148)
class Utask_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R final : public UConcurrency_task
{
public:
	class UVerseArchetypes_sniper_ai*             _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0030)(Parm, NoDestructor)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0180(0x0002)(NoDestructor, HasGetValueTypeHash)
