#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAssets_0

#include "Basic.hpp"

#include "VerseNative_classes.hpp"


namespace SDK
{

// Class VerseAssets.VerseAssetPtr
// 0x0060 (0x0090 - 0x0030)
class UVerseAssetPtr : public UVerseAsset
{
public:
	TSoftObjectPtr<class UObject>                 AssetForEditor;                                    // 0x0030(0x0028)(Edit, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AssetPathName;                                     // 0x0058(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x28];                                      // 0x0068(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AssetPathName();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAssetPtr">();
	}
	static class UVerseAssetPtr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAssetPtr>();
	}
};
static_assert(alignof(UVerseAssetPtr) == 0x000008, "Wrong alignment on UVerseAssetPtr");
static_assert(sizeof(UVerseAssetPtr) == 0x000090, "Wrong size on UVerseAssetPtr");
static_assert(offsetof(UVerseAssetPtr, AssetForEditor) == 0x000030, "Member 'UVerseAssetPtr::AssetForEditor' has a wrong offset!");
static_assert(offsetof(UVerseAssetPtr, AssetPathName) == 0x000058, "Member 'UVerseAssetPtr::AssetPathName' has a wrong offset!");
static_assert(offsetof(UVerseAssetPtr, Object) == 0x000060, "Member 'UVerseAssetPtr::Object' has a wrong offset!");

}

