#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteUI_0

#include "Basic.hpp"

#include "VerseFortniteUI_0_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Lfort__playspace_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R) == 0x000008, "Wrong alignment on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R");
static_assert(sizeof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R) == 0x000018, "Wrong size on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R");
static_assert(offsetof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R, RetVal) == 0x000010, "Member 'UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eGetHUDController_U_L_Nfort__playspace_M_Ntuple_L_R_R::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R
// 0x0020 (0x0020 - 0x0000)
struct UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R final
{
public:
	struct Ftuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R");
static_assert(sizeof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R) == 0x000020, "Wrong size on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R");
static_assert(offsetof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eHideHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R
// 0x0020 (0x0020 - 0x0000)
struct UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R final
{
public:
	struct Ftuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R");
static_assert(sizeof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R) == 0x000020, "Wrong size on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R");
static_assert(offsetof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eResetHUDElementVisibility_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI._L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R
// 0x0020 (0x0020 - 0x0000)
struct UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R final
{
public:
	struct Ftuple_Lplayer__ui_Mtuple_L_R_M_Khud__element__identifier_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R");
static_assert(sizeof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R) == 0x000020, "Wrong size on UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R");
static_assert(offsetof(UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI__L_2fFortnite_2ecom_2fUI_N_Roperator_U_2eShowHUDElements_U_L_Nplayer__ui_M_Ntuple_L_R_M_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_mimimap.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_mimimap__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_mimimap__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_mimimap__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_mimimap__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_mimimap__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_mimimap__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_mimimap__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_team_info.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_team_info__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_team_info__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_team_info__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_team_info__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_team_info__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_team_info__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_team_info__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_experience_ui.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_experience_ui__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_experience_ui__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_experience_ui__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_experience_ui__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_experience_ui__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_experience_ui__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_experience_ui__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_editable_text_base.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct UI_editable_text_base__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_editable_text_base__InitCDO) == 0x000008, "Wrong alignment on UI_editable_text_base__InitCDO");
static_assert(sizeof(UI_editable_text_base__InitCDO) == 0x000010, "Wrong size on UI_editable_text_base__InitCDO");
static_assert(offsetof(UI_editable_text_base__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_editable_text_base__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(UI_editable_text_base__InitCDO, _InstancingGraph_1) == 0x000008, "Member 'UI_editable_text_base__InitCDO::_InstancingGraph_1' has a wrong offset!");

// Function VerseFortniteUI.UI_editable_text_base._L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted
// 0x0010 (0x0010 - 0x0000)
struct UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted) == 0x000008, "Wrong alignment on UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted");
static_assert(sizeof(UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted) == 0x000010, "Wrong size on UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted");
static_assert(offsetof(UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted, RetVal) == 0x000008, "Member 'UI_editable_text_base__L_2fFortnite_2ecom_2fUI_2feditable__text__base_N_ROnTextCommitted::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_fort_hud_controller._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R
// 0x0010 (0x0010 - 0x0000)
struct UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R final
{
public:
	TArray<class UUI_hud_element_identifier*>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R");
static_assert(sizeof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R) == 0x000010, "Wrong size on UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R");
static_assert(offsetof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_fort_hud_controller._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R
// 0x0010 (0x0010 - 0x0000)
struct UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R final
{
public:
	TArray<class UUI_hud_element_identifier*>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R");
static_assert(sizeof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R) == 0x000010, "Wrong size on UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R");
static_assert(offsetof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_fort_hud_controller._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R
// 0x0010 (0x0010 - 0x0000)
struct UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R final
{
public:
	TArray<class UUI_hud_element_identifier*>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R");
static_assert(sizeof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R) == 0x000010, "Wrong size on UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R");
static_assert(offsetof(UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_fort_hud_controller__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct UI_slider_regular__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__InitCDO) == 0x000008, "Wrong alignment on UI_slider_regular__InitCDO");
static_assert(sizeof(UI_slider_regular__InitCDO) == 0x000010, "Wrong size on UI_slider_regular__InitCDO");
static_assert(offsetof(UI_slider_regular__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_slider_regular__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(UI_slider_regular__InitCDO, _InstancingGraph_1) == 0x000008, "Member 'UI_slider_regular__InitCDO::_InstancingGraph_1' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue
// 0x0010 (0x0010 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue) == 0x000010, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue, RetVal) == 0x000008, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMaxValue::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue
// 0x0010 (0x0010 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue) == 0x000010, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue, RetVal) == 0x000008, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetMinValue::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize
// 0x0010 (0x0010 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize) == 0x000010, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize, RetVal) == 0x000008, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetStepSize::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue
// 0x0010 (0x0010 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue) == 0x000010, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue, RetVal) == 0x000008, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RGetValue::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged
// 0x0010 (0x0010 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged) == 0x000010, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged, RetVal) == 0x000008, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_ROnValueChanged::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R) == 0x000008, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMaxValue_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R) == 0x000008, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetMinValue_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R) == 0x000008, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetStepSize_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_slider_regular._L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R) == 0x000008, "Wrong alignment on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R");
static_assert(sizeof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R) == 0x000008, "Wrong size on UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R");
static_assert(offsetof(UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_slider_regular__L_2fFortnite_2ecom_2fUI_2fslider__regular_N_RSetValue_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R
// 0x0010 (0x0010 - 0x0000)
struct UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R final
{
public:
	TArray<class UUI_hud_element_identifier*>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R");
static_assert(sizeof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R) == 0x000010, "Wrong size on UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R");
static_assert(offsetof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RHideElements_L_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R
// 0x0010 (0x0010 - 0x0000)
struct UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R final
{
public:
	TArray<class UUI_hud_element_identifier*>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R");
static_assert(sizeof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R) == 0x000010, "Wrong size on UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R");
static_assert(offsetof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RResetElementVisibility_L_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_fort_playspace_hud_controller_impl._L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R
// 0x0010 (0x0010 - 0x0000)
struct UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R final
{
public:
	TArray<class UUI_hud_element_identifier*>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
};
static_assert(alignof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R) == 0x000008, "Wrong alignment on UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R");
static_assert(sizeof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R) == 0x000010, "Wrong size on UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R");
static_assert(offsetof(UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_fort_playspace_hud_controller_impl__L_2fFortnite_2ecom_2fUI_2ffort__hud__controller_N_RShowElements_L_N_Khud__element__identifier_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_pickup_stream.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_pickup_stream__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_pickup_stream__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_pickup_stream__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_pickup_stream__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_pickup_stream__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_pickup_stream__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_pickup_stream__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_player_count.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_player_count__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_player_count__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_player_count__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_player_count__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_player_count__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_player_count__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_player_count__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_player_inventory.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_player_inventory__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_player_inventory__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_player_inventory__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_player_inventory__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_player_inventory__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_player_inventory__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_player_inventory__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_all.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_all__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_all__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_all__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_all__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_all__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_all__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_all__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_round_info.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_round_info__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_round_info__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_round_info__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_round_info__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_round_info__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_round_info__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_round_info__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_build_menu.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_build_menu__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_build_menu__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_build_menu__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_build_menu__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_build_menu__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_build_menu__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_build_menu__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block.$InitCDO
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) UI_text_block__InitCDO final
{
public:
	FOptionProperty_                              _ExprResult_0;                                     // 0x0000(0x0011)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0011(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x0013(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_2;                                // 0x0014(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_text_block__InitCDO) == 0x000008, "Wrong alignment on UI_text_block__InitCDO");
static_assert(sizeof(UI_text_block__InitCDO) == 0x000018, "Wrong size on UI_text_block__InitCDO");
static_assert(offsetof(UI_text_block__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_text_block__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(UI_text_block__InitCDO, __verse_0x00000000__1) == 0x000011, "Member 'UI_text_block__InitCDO::__verse_0x00000000__1' has a wrong offset!");
static_assert(offsetof(UI_text_block__InitCDO, _ExprResultStack_2) == 0x000014, "Member 'UI_text_block__InitCDO::_ExprResultStack_2' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor
// 0x0020 (0x0020 - 0x0000)
struct UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor) == 0x000008, "Wrong alignment on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor");
static_assert(sizeof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor) == 0x000020, "Wrong size on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor, RetVal) == 0x000008, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowColor::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0011)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset) == 0x000008, "Wrong alignment on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset");
static_assert(sizeof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset) == 0x000020, "Wrong size on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset, RetVal) == 0x000008, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOffset::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity
// 0x0010 (0x0010 - 0x0000)
struct UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity final
{
public:
	struct VerseFortniteUI_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity) == 0x000008, "Wrong alignment on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity");
static_assert(sizeof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity) == 0x000010, "Wrong size on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity, RetVal) == 0x000008, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RGetShadowOpacity::RetVal' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R
// 0x0018 (0x0018 - 0x0000)
struct UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R final
{
public:
	struct FColors_color                          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R) == 0x000008, "Wrong alignment on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R");
static_assert(sizeof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R) == 0x000018, "Wrong size on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowColor_L_Ncolor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R final
{
public:
	FOptionProperty_                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0011)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R) == 0x000008, "Wrong alignment on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R");
static_assert(sizeof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R) == 0x000018, "Wrong size on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOffset_L_N_Qvector2_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_text_block._L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R
// 0x0008 (0x0008 - 0x0000)
struct UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R) == 0x000008, "Wrong alignment on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R");
static_assert(sizeof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R) == 0x000008, "Wrong size on UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R");
static_assert(offsetof(UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'UI_text_block__L_2fFortnite_2ecom_2fUI_2ftext__block_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_round_timer.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_round_timer__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_round_timer__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_round_timer__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_round_timer__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_round_timer__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_round_timer__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_round_timer__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_crafting_resources.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_crafting_resources__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_crafting_resources__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_crafting_resources__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_crafting_resources__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_crafting_resources__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_crafting_resources__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_crafting_resources__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_shield_numbers.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_shield_numbers__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_shield_numbers__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_shield_numbers__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_shield_numbers__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_shield_numbers__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_shield_numbers__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_shield_numbers__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_elimination_counter.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_elimination_counter__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_elimination_counter__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_elimination_counter__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_elimination_counter__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_elimination_counter__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_elimination_counter__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_elimination_counter__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_shileds.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_shileds__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_shileds__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_shileds__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_shileds__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_shileds__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_shileds__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_shileds__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_equipped_item.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_equipped_item__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_equipped_item__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_equipped_item__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_equipped_item__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_equipped_item__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_equipped_item__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_equipped_item__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_storm_notifications.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_storm_notifications__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_storm_notifications__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_storm_notifications__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_storm_notifications__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_storm_notifications__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_storm_notifications__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_storm_notifications__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_experience_level.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_experience_level__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_experience_level__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_experience_level__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_experience_level__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_experience_level__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_experience_level__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_experience_level__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_storm_timer.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_storm_timer__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_storm_timer__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_storm_timer__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_storm_timer__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_storm_timer__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_storm_timer__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_storm_timer__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_experience_supercharged.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_experience_supercharged__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(UI_creative_hud_identifier_experience_supercharged__InitCDO) == 0x000008, "Wrong alignment on UI_creative_hud_identifier_experience_supercharged__InitCDO");
static_assert(sizeof(UI_creative_hud_identifier_experience_supercharged__InitCDO) == 0x000010, "Wrong size on UI_creative_hud_identifier_experience_supercharged__InitCDO");
static_assert(offsetof(UI_creative_hud_identifier_experience_supercharged__InitCDO, _ExprResult_0) == 0x000000, "Member 'UI_creative_hud_identifier_experience_supercharged__InitCDO::_ExprResult_0' has a wrong offset!");

// Function VerseFortniteUI.UI_creative_hud_identifier_health.$InitCDO
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) UI_creative_hud_identifier_health__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
};
