#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseArchetypes

#include "Basic.hpp"

#include "VerseAIBase_0_structs.hpp"
#include "VerseArchetypes_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseFortnite_0_structs.hpp"


namespace SDK::Params
{

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$RunGameplayLogic.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_RunGameplayLogic_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$SelectFightingStance_L_Nfort__threat__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_SelectFightingStance_L_Nfort__threat__info_R_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$LookAtThreat_L_Nfort__threat__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$TryToAttackThreat_L_Nfort__threat__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_TryToAttackThreat_L_Nfort__threat__info_R_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$OnBegin.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_OnBegin_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_OnBegin_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_OnBegin_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_OnBegin_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_OnBegin_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_OnBegin_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_OnBegin_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$UseSniperWeapon_L_Nfort__threat__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_UseSniperWeapon_L_Nfort__threat__info_R_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_sniper_ai$PatrolAround.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseArchetypes_sniper_ai_PatrolAround_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_sniper_ai_PatrolAround_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_sniper_ai_PatrolAround_Update");
static_assert(sizeof(task_VerseArchetypes_sniper_ai_PatrolAround_Update) == 0x000008, "Wrong size on task_VerseArchetypes_sniper_ai_PatrolAround_Update");
static_assert(offsetof(task_VerseArchetypes_sniper_ai_PatrolAround_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_sniper_ai_PatrolAround_Update::RetVal' has a wrong offset!");

// Function VerseArchetypes.task_VerseArchetypes_template_ai$OnBegin.Update
// 0x0028 (0x0028 - 0x0000)
struct task_VerseArchetypes_template_ai_OnBegin_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_46;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_63;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_95;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_118;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(task_VerseArchetypes_template_ai_OnBegin_Update) == 0x000008, "Wrong alignment on task_VerseArchetypes_template_ai_OnBegin_Update");
static_assert(sizeof(task_VerseArchetypes_template_ai_OnBegin_Update) == 0x000028, "Wrong size on task_VerseArchetypes_template_ai_OnBegin_Update");
static_assert(offsetof(task_VerseArchetypes_template_ai_OnBegin_Update, RetVal) == 0x000000, "Member 'task_VerseArchetypes_template_ai_OnBegin_Update::RetVal' has a wrong offset!");
static_assert(offsetof(task_VerseArchetypes_template_ai_OnBegin_Update, _InstancingGraph_46) == 0x000008, "Member 'task_VerseArchetypes_template_ai_OnBegin_Update::_InstancingGraph_46' has a wrong offset!");
static_assert(offsetof(task_VerseArchetypes_template_ai_OnBegin_Update, _InstancingGraph_63) == 0x000010, "Member 'task_VerseArchetypes_template_ai_OnBegin_Update::_InstancingGraph_63' has a wrong offset!");
static_assert(offsetof(task_VerseArchetypes_template_ai_OnBegin_Update, _InstancingGraph_95) == 0x000018, "Member 'task_VerseArchetypes_template_ai_OnBegin_Update::_InstancingGraph_95' has a wrong offset!");
static_assert(offsetof(task_VerseArchetypes_template_ai_OnBegin_Update, _InstancingGraph_118) == 0x000020, "Member 'task_VerseArchetypes_template_ai_OnBegin_Update::_InstancingGraph_118' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai.$InitCDO
// 0x0030 (0x0030 - 0x0000)
struct VerseArchetypes_sniper_ai__InitCDO final
{
public:
	FOptionProperty_                              _ExprResult_0;                                     // 0x0000(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__1;                             // 0x0009(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_2;                                // 0x000C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           _ExprResult_3;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                       _ExprResult_5;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai__InitCDO) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai__InitCDO");
static_assert(sizeof(VerseArchetypes_sniper_ai__InitCDO) == 0x000030, "Wrong size on VerseArchetypes_sniper_ai__InitCDO");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, _ExprResult_0) == 0x000000, "Member 'VerseArchetypes_sniper_ai__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, __verse_0x00000000__1) == 0x000009, "Member 'VerseArchetypes_sniper_ai__InitCDO::__verse_0x00000000__1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, _ExprResultStack_2) == 0x00000C, "Member 'VerseArchetypes_sniper_ai__InitCDO::_ExprResultStack_2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, _ExprResult_3) == 0x000010, "Member 'VerseArchetypes_sniper_ai__InitCDO::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, _InstancingGraph_4) == 0x000018, "Member 'VerseArchetypes_sniper_ai__InitCDO::_InstancingGraph_4' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, _ExprResult_5) == 0x000020, "Member 'VerseArchetypes_sniper_ai__InitCDO::_ExprResult_5' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__InitCDO, _InstancingGraph_6) == 0x000028, "Member 'VerseArchetypes_sniper_ai__InitCDO::_InstancingGraph_6' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai._L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd
// 0x0060 (0x0060 - 0x0000)
struct VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd final
{
public:
	struct VerseArchetypes::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0xD3E63614_CallbackId_1;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0010(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x2E1D28B3_Inventory_1;                    // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_1;                                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__3;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_4;                                     // 0x0050(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FOptionProperty_                              __verse_0x00000000__4;                             // 0x0059(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x005B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	FOptionProperty_                              _ExprResultStack_6;                                // 0x005C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd");
static_assert(sizeof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd) == 0x000060, "Wrong size on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, __verse_0xD3E63614_CallbackId_1) == 0x000008, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::__verse_0xD3E63614_CallbackId_1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, _ExprResultStack_0) == 0x000010, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, __verse_0x2E1D28B3_Inventory_1) == 0x000020, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::__verse_0x2E1D28B3_Inventory_1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, _ExprResultStack_1) == 0x000028, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::_ExprResultStack_1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, __verse_0x00000000__3) == 0x000030, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::__verse_0x00000000__3' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, _InvokeSureResultDummy_2) == 0x000038, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::_InvokeSureResultDummy_2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, _Callee_3) == 0x000040, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::_Callee_3' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, _ExprResult_4) == 0x000050, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, __verse_0x00000000__4) == 0x000059, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::__verse_0x00000000__4' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd, _ExprResultStack_6) == 0x00005C, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseAIBase_2fai__behavior_N_ROnEnd::_ExprResultStack_6' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R
// 0x0140 (0x0140 - 0x0000)
struct VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R final
{
public:
	class UVerseAIBase_fort_item_tag*             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x2E1D28B3_Inventory_2;                    // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FVerseAIBase_fort_item_descriptor> _ForIterable_1;                                    // 0x0020(0x0010)(ContainsInstancedReference)
	class UObject*                                __verse_0x00000000__6;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_3;                                     // 0x0048(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_4;                                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_item_descriptor      __verse_0xFB88B569_Item_7;                         // 0x0060(0x0018)(NoDestructor)
	FOptionProperty_                              _ExprResultStack_6;                                // 0x0078(0x0002)(NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResultStack_7 : 1;                            // 0x007A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0080(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_Lfort__item__descriptor_Mfort__item__tag_R _ExprResult_9;                                     // 0x0090(0x0020)(HasGetValueTypeHash)
	struct FVerseAIBase_fort_weapon_descriptor    __verse_0x18F7B1AE_Weapon_10;                      // 0x00B0(0x0018)(NoDestructor)
	class UObject*                                __verse_0x00000000__11;                            // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_10;                               // 0x00D0(0x0019)(NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00F0(0x0010)(HasGetValueTypeHash)
	class UVerseAIBase_fort_melee_weapon_tag*     _FallibleType_12;                                  // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _FallibleType_13;                                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_14;                               // 0x0110(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__12;                            // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_15;                               // 0x0128(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0130(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R");
static_assert(sizeof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R) == 0x000140, "Wrong size on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0x2E1D28B3_Inventory_2) == 0x000010, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0x2E1D28B3_Inventory_2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResultStack_0) == 0x000018, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ForIterable_1) == 0x000020, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ForIterable_1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0x00000000__6) == 0x000030, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0x00000000__6' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _Callee_2) == 0x000038, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_Callee_2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResult_3) == 0x000048, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ForIndex_4) == 0x000050, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ForIndex_4' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ForLength_5) == 0x000058, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ForLength_5' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0xFB88B569_Item_7) == 0x000060, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0xFB88B569_Item_7' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResultStack_6) == 0x000078, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResultStack_6' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _Callee_8) == 0x000080, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_Callee_8' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResult_9) == 0x000090, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResult_9' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0x18F7B1AE_Weapon_10) == 0x0000B0, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0x18F7B1AE_Weapon_10' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0x00000000__11) == 0x0000C8, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0x00000000__11' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResultStack_10) == 0x0000D0, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResultStack_10' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _Callee_11) == 0x0000F0, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_Callee_11' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _FallibleType_12) == 0x000100, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_FallibleType_12' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _FallibleType_13) == 0x000108, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_FallibleType_13' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResultStack_14) == 0x000110, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResultStack_14' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, __verse_0x00000000__12) == 0x000120, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::__verse_0x00000000__12' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _ExprResultStack_15) == 0x000128, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_ExprResultStack_15' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R, _Callee_16) == 0x000130, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_REquipWeapon_L_Nfort__item__tag_R::_Callee_16' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R
// 0x00E8 (0x00E8 - 0x0000)
struct VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_2;                                     // 0x0028(0x0040)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_Kchar_M_QColor_Ncolor_M_QDuration_Nfloat_R __verse_0x00000000__1;                             // 0x0068(0x0040)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResult_3;                                     // 0x00A8(0x0019)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResult_4;                                     // 0x00C8(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultDummy_5;                                // 0x00D8(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R");
static_assert(sizeof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R) == 0x0000E8, "Wrong size on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, _InvokeSureResultDummy_0) == 0x000010, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::_InvokeSureResultDummy_0' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, _Callee_1) == 0x000018, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::_Callee_1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, _ExprResult_2) == 0x000028, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, __verse_0x00000000__1) == 0x000068, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::__verse_0x00000000__1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, _ExprResult_3) == 0x0000A8, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, _ExprResult_4) == 0x0000C8, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R, _ExprResultDummy_5) == 0x0000D8, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RPrintMessage_L_N_Kchar_R::_ExprResultDummy_5' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R
// 0x01A0 (0x01A0 - 0x0000)
struct VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R final
{
public:
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              _ExprResultStack_0;                                // 0x0038(0x0009)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResultStack_1;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0050(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_Lvector3_Mvector3_R _ExprResult_3;                                     // 0x0060(0x0030)(HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_4;                                     // 0x0090(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__2;                             // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_5;                                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0100(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_7;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FOptionProperty_                              _ExprResultStack_8;                                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0128(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_10;                                    // 0x0138(0x0001)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_11;                                    // 0x0139(0x0001)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_12;                                    // 0x013A(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x0140(0x0010)(HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            _ExprResult_14;                                    // 0x0150(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResultStack_15;                               // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0190(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R) == 0x000010, "Wrong alignment on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R");
static_assert(sizeof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R) == 0x0001A0, "Wrong size on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResultStack_0) == 0x000038, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResultStack_0' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResultStack_1) == 0x000048, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResultStack_1' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_2) == 0x000050, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_3) == 0x000060, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_4) == 0x000090, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, __verse_0x00000000__2) == 0x0000F0, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::__verse_0x00000000__2' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResultStack_5) == 0x0000F8, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResultStack_5' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_6) == 0x000100, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_6' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_7) == 0x000110, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_7' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResultStack_8) == 0x000120, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResultStack_8' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_9) == 0x000128, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_9' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_10) == 0x000138, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_11) == 0x000139, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_11' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_12) == 0x00013A, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_12' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_13) == 0x000140, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_13' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResult_14) == 0x000150, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResult_14' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _ExprResultStack_15) == 0x000158, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_ExprResultStack_15' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_16) == 0x000170, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_16' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_17) == 0x000180, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_17' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R, _Callee_18) == 0x000190, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RSelectWeaponForThreat_L_Nfort__threat__info_R::_Callee_18' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai._L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R
// 0x0020 (0x0020 - 0x0000)
struct VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R final
{
public:
	struct FVerseAIBase_fort_item_descriptor      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	uint8                                         RetVal : 1;                                        // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R");
static_assert(sizeof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R) == 0x000020, "Wrong size on VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R");
static_assert(offsetof(VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'VerseArchetypes_sniper_ai__L_2fFortnite_2ecom_2fAI_2fVerseArchetypes_2fsniper__ai_N_RShouldUseSuggestedWeapon_L_Nfort__item__descriptor_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai.LookAtThreat_L_Nfort__threat__info_R
// 0x0050 (0x0050 - 0x0000)
struct VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseAIBase_fort_threat_info          __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0030)(Parm, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0048(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R");
static_assert(sizeof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R) == 0x000050, "Wrong size on VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R");
static_assert(offsetof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R, RetVal) == 0x000048, "Member 'VerseArchetypes_sniper_ai_LookAtThreat_L_Nfort__threat__info_R::RetVal' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai.OnBegin
// 0x0028 (0x0028 - 0x0000)
struct VerseArchetypes_sniper_ai_OnBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseArchetypes::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(VerseArchetypes_sniper_ai_OnBegin) == 0x000008, "Wrong alignment on VerseArchetypes_sniper_ai_OnBegin");
static_assert(sizeof(VerseArchetypes_sniper_ai_OnBegin) == 0x000028, "Wrong size on VerseArchetypes_sniper_ai_OnBegin");
static_assert(offsetof(VerseArchetypes_sniper_ai_OnBegin, __verse_0xC1E81372_CallingTask) == 0x000000, "Member 'VerseArchetypes_sniper_ai_OnBegin::__verse_0xC1E81372_CallingTask' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_OnBegin, __verse_0xA3A00DDB_CallerResumeState) == 0x000008, "Member 'VerseArchetypes_sniper_ai_OnBegin::__verse_0xA3A00DDB_CallerResumeState' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_OnBegin, __verse_0x2AC0E4D8_CallerCancelState) == 0x000010, "Member 'VerseArchetypes_sniper_ai_OnBegin::__verse_0x2AC0E4D8_CallerCancelState' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_OnBegin, __verse_0xB2CDDD72_Argument) == 0x000018, "Member 'VerseArchetypes_sniper_ai_OnBegin::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(VerseArchetypes_sniper_ai_OnBegin, RetVal) == 0x000020, "Member 'VerseArchetypes_sniper_ai_OnBegin::RetVal' has a wrong offset!");

// Function VerseArchetypes.VerseArchetypes_sniper_ai.PatrolAround
// 0x0028 (0x0028 - 0x0000)
struct VerseArchetypes_sniper_ai_PatrolAround final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
