#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseDevices_0_structs.hpp"
#include "VerseDevices_classes.hpp"
#include "VerseAssets_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "Verse_structs.hpp"
#include "VerseNative_0_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseClass VerseDevices.Devices_device_function_get_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_get_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_base">();
	}
	static class UDevices_device_function_get_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_base>();
	}
};
static_assert(alignof(UDevices_device_function_get_base) == 0x000008, "Wrong alignment on UDevices_device_function_get_base");
static_assert(sizeof(UDevices_device_function_get_base) == 0x000038, "Wrong size on UDevices_device_function_get_base");
static_assert(offsetof(UDevices_device_function_get_base, __verse_0xF8B4D924_FunctionName) == 0x000028, "Member 'UDevices_device_function_get_base::__verse_0xF8B4D924_FunctionName' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_get_vector3
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_vector3 final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0xED077618__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_vector3">();
	}
	static class UDevices_device_function_get_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_vector3>();
	}
};
static_assert(alignof(UDevices_device_function_get_vector3) == 0x000008, "Wrong alignment on UDevices_device_function_get_vector3");
static_assert(sizeof(UDevices_device_function_get_vector3) == 0x000048, "Wrong size on UDevices_device_function_get_vector3");
static_assert(offsetof(UDevices_device_function_get_vector3, __verse_0xED077618__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke) == 0x000038, "Member 'UDevices_device_function_get_vector3::__verse_0xED077618__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_event
// 0x0080 (0x00A8 - 0x0028)
class UDevices_device_event : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x21011A72_EventName;                      // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event">();
	}
	static class UDevices_device_event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event>();
	}
};
static_assert(alignof(UDevices_device_event) == 0x000008, "Wrong alignment on UDevices_device_event");
static_assert(sizeof(UDevices_device_event) == 0x0000A8, "Wrong size on UDevices_device_event");
static_assert(offsetof(UDevices_device_event, __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R) == 0x000028, "Member 'UDevices_device_event::__verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R' has a wrong offset!");
static_assert(offsetof(UDevices_device_event, __verse_0x8DE7DBE5_Await) == 0x000038, "Member 'UDevices_device_event::__verse_0x8DE7DBE5_Await' has a wrong offset!");
static_assert(offsetof(UDevices_device_event, __verse_0x21011A72_EventName) == 0x000048, "Member 'UDevices_device_event::__verse_0x21011A72_EventName' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_event_agent_int
// 0x0020 (0x00C8 - 0x00A8)
class UDevices_device_event_agent_int final : public UDevices_device_event
{
public:
	FVerseFunctionProperty_                       __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_agent_int; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await_Devices_device_event_agent_int; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_agent_int">();
	}
	static class UDevices_device_event_agent_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_agent_int>();
	}
};
static_assert(alignof(UDevices_device_event_agent_int) == 0x000008, "Wrong alignment on UDevices_device_event_agent_int");
static_assert(sizeof(UDevices_device_event_agent_int) == 0x0000C8, "Wrong size on UDevices_device_event_agent_int");
static_assert(offsetof(UDevices_device_event_agent_int, __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_agent_int) == 0x0000A8, "Member 'UDevices_device_event_agent_int::__verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_agent_int' has a wrong offset!");
static_assert(offsetof(UDevices_device_event_agent_int, __verse_0x8DE7DBE5_Await_Devices_device_event_agent_int) == 0x0000B8, "Member 'UDevices_device_event_agent_int::__verse_0x8DE7DBE5_Await_Devices_device_event_agent_int' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_object
// 0x0080 (0x00B8 - 0x0038)
#pragma pack(push, 0x1)
class alignas(0x08) UDevices_creative_object : public UVerseCreativeObject
{
public:
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_48[0x70];                                      // 0x0048(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object">();
	}
	static class UDevices_creative_object* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object>();
	}
};
#pragma pack(pop)
static_assert(alignof(UDevices_creative_object) == 0x000008, "Wrong alignment on UDevices_creative_object");
static_assert(sizeof(UDevices_creative_object) == 0x0000B8, "Wrong size on UDevices_creative_object");
static_assert(offsetof(UDevices_creative_object, __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x000038, "Member 'UDevices_creative_object::__verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_prop
// 0x0068 (0x0120 - 0x00B8)
class UDevices_creative_prop final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0x58E9ADAD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x30E66B48__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDB5EC38A_MoveToInternal_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	EDevices_teleport_to_result _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveToInternal_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop">();
	}
	static class UDevices_creative_prop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop>();
	}
};
static_assert(alignof(UDevices_creative_prop) == 0x000008, "Wrong alignment on UDevices_creative_prop");
static_assert(sizeof(UDevices_creative_prop) == 0x000120, "Wrong size on UDevices_creative_prop");
static_assert(offsetof(UDevices_creative_prop, __verse_0x58E9ADAD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R) == 0x0000B8, "Member 'UDevices_creative_prop::__verse_0x58E9ADAD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x30E66B48__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R) == 0x0000C8, "Member 'UDevices_creative_prop::__verse_0x30E66B48__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RTeleportTo_L_Nvector3_M_Nrotation_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R) == 0x0000D8, "Member 'UDevices_creative_prop::__verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0xDB5EC38A_MoveToInternal_L_Nvector3_M_Nrotation_M_Nfloat_R) == 0x0000E8, "Member 'UDevices_creative_prop::__verse_0xDB5EC38A_MoveToInternal_L_Nvector3_M_Nrotation_M_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid) == 0x0000F8, "Member 'UDevices_creative_prop::__verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UDevices_creative_prop, __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose) == 0x000108, "Member 'UDevices_creative_prop::__verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose' has a wrong offset!");

// VerseClass VerseDevices.Devices
// 0x0008 (0x0030 - 0x0028)
class UDevices final : public UObject
{
public:
	class UDevices_creative_prop_asset*           __verse_0x88F30926_DefaultCreativePropAsset;       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nany_R(class UClass* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R(class UTags_tag_search_criteria* __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lcreative__prop__asset_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices">();
	}
	static class UDevices* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices>();
	}
};
static_assert(alignof(UDevices) == 0x000008, "Wrong alignment on UDevices");
static_assert(sizeof(UDevices) == 0x000030, "Wrong size on UDevices");
static_assert(offsetof(UDevices, __verse_0x88F30926_DefaultCreativePropAsset) == 0x000028, "Member 'UDevices::__verse_0x88F30926_DefaultCreativePropAsset' has a wrong offset!");

// VerseClass VerseDevices.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseDevices_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseDevices.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseDevices_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseDevices_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseDevices_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseDevices_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseDevices_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseDevices_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseDevices.Devices_device_function_set_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_set_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_base">();
	}
	static class UDevices_device_function_set_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_base>();
	}
};
static_assert(alignof(UDevices_device_function_set_base) == 0x000008, "Wrong alignment on UDevices_device_function_set_base");
static_assert(sizeof(UDevices_device_function_set_base) == 0x000038, "Wrong size on UDevices_device_function_set_base");
static_assert(offsetof(UDevices_device_function_set_base, __verse_0xF8B4D924_FunctionName) == 0x000028, "Member 'UDevices_device_function_set_base::__verse_0xF8B4D924_FunctionName' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function_set_string
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_string final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0x23330E3C__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_string">();
	}
	static class UDevices_device_function_set_string* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_string>();
	}
};
static_assert(alignof(UDevices_device_function_set_string) == 0x000008, "Wrong alignment on UDevices_device_function_set_string");
static_assert(sizeof(UDevices_device_function_set_string) == 0x000048, "Wrong size on UDevices_device_function_set_string");
static_assert(offsetof(UDevices_device_function_set_string, __verse_0x23330E3C__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R) == 0x000038, "Member 'UDevices_device_function_set_string::__verse_0x23330E3C__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__string_N_RInvoke_L_N_Kchar_R' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_device_asset
// 0x0000 (0x00D8 - 0x00D8)
class UDevices_creative_device_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_asset">();
	}
	static class UDevices_creative_device_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_asset>();
	}
};
static_assert(alignof(UDevices_creative_device_asset) == 0x000008, "Wrong alignment on UDevices_creative_device_asset");
static_assert(sizeof(UDevices_creative_device_asset) == 0x0000D8, "Wrong size on UDevices_creative_device_asset");

// VerseClass VerseDevices.Devices_creative_device
// 0x0040 (0x0070 - 0x0030)
class UDevices_creative_device final : public UVerseCreativeDevice
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd; // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEAC73ECC__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal; // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device">();
	}
	static class UDevices_creative_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device>();
	}
};
static_assert(alignof(UDevices_creative_device) == 0x000008, "Wrong alignment on UDevices_creative_device");
static_assert(sizeof(UDevices_creative_device) == 0x000070, "Wrong size on UDevices_creative_device");
static_assert(offsetof(UDevices_creative_device, __verse_0x1F792AAA_OnBegin) == 0x000030, "Member 'UDevices_creative_device::__verse_0x1F792AAA_OnBegin' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd) == 0x000040, "Member 'UDevices_creative_device::__verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0xEAC73ECC__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal) == 0x000050, "Member 'UDevices_creative_device::__verse_0xEAC73ECC__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnBegin__Internal' has a wrong offset!");
static_assert(offsetof(UDevices_creative_device, __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x000060, "Member 'UDevices_creative_device::__verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_device_base
// 0x0008 (0x00C0 - 0x00B8)
class UDevices_creative_device_base final : public UDevices_creative_object
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_base">();
	}
	static class UDevices_creative_device_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_base>();
	}
};
static_assert(alignof(UDevices_creative_device_base) == 0x000008, "Wrong alignment on UDevices_creative_device_base");
static_assert(sizeof(UDevices_creative_device_base) == 0x0000C0, "Wrong size on UDevices_creative_device_base");

// VerseClass VerseDevices.Devices_function_parameter_base
// 0x0000 (0x0028 - 0x0028)
class UDevices_function_parameter_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_base">();
	}
	static class UDevices_function_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_base>();
	}
};
static_assert(alignof(UDevices_function_parameter_base) == 0x000008, "Wrong alignment on UDevices_function_parameter_base");
static_assert(sizeof(UDevices_function_parameter_base) == 0x000028, "Wrong size on UDevices_function_parameter_base");

// VerseClass VerseDevices.Devices_function_parameter_float
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_float final : public UDevices_function_parameter_base
{
public:
	double                                        __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_float">();
	}
	static class UDevices_function_parameter_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_float>();
	}
};
static_assert(alignof(UDevices_function_parameter_float) == 0x000008, "Wrong alignment on UDevices_function_parameter_float");
static_assert(sizeof(UDevices_function_parameter_float) == 0x000030, "Wrong size on UDevices_function_parameter_float");
static_assert(offsetof(UDevices_function_parameter_float, __verse_0x31A8F10C_Value) == 0x000028, "Member 'UDevices_function_parameter_float::__verse_0x31A8F10C_Value' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_object_interface
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_object_interface final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object_interface">();
	}
	static class UDevices_creative_object_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object_interface>();
	}
};
static_assert(alignof(UDevices_creative_object_interface) == 0x000008, "Wrong alignment on UDevices_creative_object_interface");
static_assert(sizeof(UDevices_creative_object_interface) == 0x000028, "Wrong size on UDevices_creative_object_interface");

// VerseClass VerseDevices.Devices_device_event_void
// 0x0020 (0x00C8 - 0x00A8)
class UDevices_device_event_void final : public UDevices_device_event
{
public:
	FVerseFunctionProperty_                       __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_void; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await_Devices_device_event_void; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_void">();
	}
	static class UDevices_device_event_void* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_void>();
	}
};
static_assert(alignof(UDevices_device_event_void) == 0x000008, "Wrong alignment on UDevices_device_event_void");
static_assert(sizeof(UDevices_device_event_void) == 0x0000C8, "Wrong size on UDevices_device_event_void");
static_assert(offsetof(UDevices_device_event_void, __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_void) == 0x0000A8, "Member 'UDevices_device_event_void::__verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_void' has a wrong offset!");
static_assert(offsetof(UDevices_device_event_void, __verse_0x8DE7DBE5_Await_Devices_device_event_void) == 0x0000B8, "Member 'UDevices_device_event_void::__verse_0x8DE7DBE5_Await_Devices_device_event_void' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_prop_asset
// 0x0000 (0x00D8 - 0x00D8)
class UDevices_creative_prop_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_asset">();
	}
	static class UDevices_creative_prop_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_asset>();
	}
};
static_assert(alignof(UDevices_creative_prop_asset) == 0x000008, "Wrong alignment on UDevices_creative_prop_asset");
static_assert(sizeof(UDevices_creative_prop_asset) == 0x0000D8, "Wrong size on UDevices_creative_prop_asset");

// VerseClass VerseDevices.Devices_device_event_optional_agent
// 0x0020 (0x00C8 - 0x00A8)
class UDevices_device_event_optional_agent final : public UDevices_device_event
{
public:
	FVerseFunctionProperty_                       __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_optional_agent; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await_Devices_device_event_optional_agent; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_optional_agent">();
	}
	static class UDevices_device_event_optional_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_optional_agent>();
	}
};
static_assert(alignof(UDevices_device_event_optional_agent) == 0x000008, "Wrong alignment on UDevices_device_event_optional_agent");
static_assert(sizeof(UDevices_device_event_optional_agent) == 0x0000C8, "Wrong size on UDevices_device_event_optional_agent");
static_assert(offsetof(UDevices_device_event_optional_agent, __verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_optional_agent) == 0x0000A8, "Member 'UDevices_device_event_optional_agent::__verse_0xC9C8F929__L_2fVerse_2eorg_2fVerse_2fsubscribable_2fsubscribable_Lt_R_N_RSubscribe_L_Nt_Tvoid_R_Devices_device_event_optional_agent' has a wrong offset!");
static_assert(offsetof(UDevices_device_event_optional_agent, __verse_0x8DE7DBE5_Await_Devices_device_event_optional_agent) == 0x0000B8, "Member 'UDevices_device_event_optional_agent::__verse_0x8DE7DBE5_Await_Devices_device_event_optional_agent' has a wrong offset!");

// VerseClass VerseDevices.Devices_creative_prop_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_prop_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_debug_log">();
	}
	static class UDevices_creative_prop_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_debug_log>();
	}
};
static_assert(alignof(UDevices_creative_prop_debug_log) == 0x000008, "Wrong alignment on UDevices_creative_prop_debug_log");
static_assert(sizeof(UDevices_creative_prop_debug_log) == 0x000028, "Wrong size on UDevices_creative_prop_debug_log");

// VerseClass VerseDevices.Devices_CreativeAnimation
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation final : public UObject
{
public:
	static struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__prop_R(class UDevices_creative_prop* __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_Factory();
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation">();
	}
	static class UDevices_CreativeAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation");
static_assert(sizeof(UDevices_CreativeAnimation) == 0x000028, "Wrong size on UDevices_CreativeAnimation");

// VerseClass VerseDevices.Devices_device_function_set_int
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_int final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0x53CE1022__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_int">();
	}
	static class UDevices_device_function_set_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_int>();
	}
};
static_assert(alignof(UDevices_device_function_set_int) == 0x000008, "Wrong alignment on UDevices_device_function_set_int");
static_assert(sizeof(UDevices_device_function_set_int) == 0x000048, "Wrong size on UDevices_device_function_set_int");
static_assert(offsetof(UDevices_device_function_set_int, __verse_0x53CE1022__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R) == 0x000038, "Member 'UDevices_device_function_set_int::__verse_0x53CE1022__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R' has a wrong offset!");

// VerseClass VerseDevices.Devices_device_function
// 0x0030 (0x0058 - 0x0028)
class UDevices_device_function final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x72D2D0E5__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x40164272__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function">();
	}
	static class UDevices_device_function* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function>();
	}
};
static_assert(alignof(UDevices_device_function) == 0x000008, "Wrong alignment on UDevices_device_function");
static_assert(sizeof(UDevices_device_function) == 0x000058, "Wrong size on UDevices_device_function");
static_assert(offsetof(UDevices_device_function, __verse_0x72D2D0E5__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke) == 0x000028, "Member 'UDevices_device_function::__verse_0x72D2D0E5__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke' has a wrong offset!");
static_assert(offsetof(UDevices_device_function, __verse_0x40164272__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R) == 0x000038, "Member 'UDevices_device_function::__verse_0x40164272__L_2fFortnite_2ecom_2fDevices_2fdevice__function_N_RInvoke_L_Nagent_R' has a wrong offset!");
static_assert(offsetof(UDevices_device_function, __verse_0xF8B4D924_FunctionName) == 0x000048, "Member 'UDevices_device_function::__verse_0xF8B4D924_FunctionName' has a wrong offset!");

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller
// 0x0138 (0x0160 - 0x0028)
class UDevices_CreativeAnimation_animation_controller final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x0E85E6FA__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x053E8BA6_AwaitNextKeyframe;              // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5D81E59F__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B727DF3__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1A1EC93E__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E385FBF__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDF78CD56__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x230023B8__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4A2A0F34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDCA25E7B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2DAABA8B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_Nanimation__mode_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x30521B48__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x25C48BD2__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_Nanimation__mode_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog;                       // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x1A3A2D49_KeyframeReachedEvent;           // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xEC8DE8C6_MovementCompleteEvent;          // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xDE60FD58_StateChangedEvent;              // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_118[0x48];                                     // 0x0118(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	EDevices_CreativeAnimation_animation_controller_state _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R(const struct Ftuple_L_Kchar_Mplaystoppause__result_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_playstoppause_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_playstoppause_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_Nanimation__mode_R(const struct Ftuple_L_Kkeyframe__delta_M_QMode_Nanimation__mode_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_set_animation_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_Nanimation__mode_R(const struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_playstoppause_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R(EDevices_CreativeAnimation_set_animation_result __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* AwaitNextKeyframe(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller">();
	}
	static class UDevices_CreativeAnimation_animation_controller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation_animation_controller) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation_animation_controller");
static_assert(sizeof(UDevices_CreativeAnimation_animation_controller) == 0x000160, "Wrong size on UDevices_CreativeAnimation_animation_controller");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x0E85E6FA__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R) == 0x000028, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x0E85E6FA__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x053E8BA6_AwaitNextKeyframe) == 0x000038, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x053E8BA6_AwaitNextKeyframe' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x5D81E59F__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal) == 0x000048, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x5D81E59F__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x6B727DF3__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay) == 0x000058, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x6B727DF3__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x1A1EC93E__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal) == 0x000068, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x1A1EC93E__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x1E385FBF__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause) == 0x000078, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x1E385FBF__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0xDF78CD56__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal) == 0x000088, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0xDF78CD56__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x230023B8__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop) == 0x000098, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x230023B8__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x4A2A0F34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState) == 0x0000A8, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x4A2A0F34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0xDCA25E7B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid) == 0x0000B8, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0xDCA25E7B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x2DAABA8B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_Nanimation__mode_R) == 0x0000C8, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x2DAABA8B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_Nanimation__mode_R' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x30521B48__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R) == 0x0000D8, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x30521B48__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x25C48BD2__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_Nanimation__mode_R) == 0x0000E8, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x25C48BD2__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_Nanimation__mode_R' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x63A8D5FA_DebugLog) == 0x0000F8, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x63A8D5FA_DebugLog' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0x1A3A2D49_KeyframeReachedEvent) == 0x000100, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0x1A3A2D49_KeyframeReachedEvent' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0xEC8DE8C6_MovementCompleteEvent) == 0x000108, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0xEC8DE8C6_MovementCompleteEvent' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_animation_controller, __verse_0xDE60FD58_StateChangedEvent) == 0x000110, "Member 'UDevices_CreativeAnimation_animation_controller::__verse_0xDE60FD58_StateChangedEvent' has a wrong offset!");

// VerseClass VerseDevices.task_Devices_device_event_optional_agent_int$Await
// 0x0020 (0x0168 - 0x0148)
class Utask_Devices_device_event_optional_agent_int_Await final : public UConcurrency_task
{
public:
	class UDevices_device_event_optional_agent_int* _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _RetVal;                                           // 0x0158(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices_device_event_optional_agent_int$Await">();
	}
	static class Utask_Devices_device_event_optional_agent_int_Await* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_device_event_optional_agent_int_Await>();
	}
};
static_assert(alignof(Utask_Devices_device_event_optional_agent_int_Await) == 0x000008, "Wrong alignment on Utask_Devices_device_event_optional_agent_int_Await");
static_assert(sizeof(Utask_Devices_device_event_optional_agent_int_Await) == 0x000168, "Wrong size on Utask_Devices_device_event_optional_agent_int_Await");
static_assert(offsetof(Utask_Devices_device_event_optional_agent_int_Await, _Self) == 0x000148, "Member 'Utask_Devices_device_event_optional_agent_int_Await::_Self' has a wrong offset!");
static_assert(offsetof(Utask_Devices_device_event_optional_agent_int_Await, __verse_0xB2CDDD72_Argument) == 0x000150, "Member 'Utask_Devices_device_event_optional_agent_int_Await::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Utask_Devices_device_event_optional_agent_int_Await, _RetVal) == 0x000158, "Member 'Utask_Devices_device_event_optional_agent_int_Await::_RetVal' has a wrong offset!");

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation_animation_controller_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller_debug_log">();
	}
	static class UDevices_CreativeAnimation_animation_controller_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller_debug_log>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation_animation_controller_debug_log) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation_animation_controller_debug_log");
static_assert(sizeof(UDevices_CreativeAnimation_animation_controller_debug_log) == 0x000028, "Wrong size on UDevices_CreativeAnimation_animation_controller_debug_log");

// VerseClass VerseDevices.Devices_device_function_get_string
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_string final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0xBD53BC40__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__string_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__string_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_string">();
	}
	static class UDevices_device_function_get_string* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_string>();
	}
};
static_assert(alignof(UDevices_device_function_get_string) == 0x000008, "Wrong alignment on UDevices_device_function_get_string");
static_assert(sizeof(UDevices_device_function_get_string) == 0x000048, "Wrong size on UDevices_device_function_get_string");
static_assert(offsetof(UDevices_device_function_get_string, __verse_0xBD53BC40__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__string_N_RInvoke) == 0x000038, "Member 'UDevices_device_function_get_string::__verse_0xBD53BC40__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__string_N_RInvoke' has a wrong offset!");

// VerseClass VerseDevices.Devices_CreativeAnimation_InterpolationTypes
// 0x00A0 (0x00C8 - 0x0028)
class UDevices_CreativeAnimation_InterpolationTypes final : public UObject
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9B27EB9D_Linear;                         // 0x0028(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9CD14C25_Ease;                           // 0x0048(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xB345298C_EaseIn;                         // 0x0068(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xF59E2BD2_EaseOut;                        // 0x0088(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x29A389AE_EaseInOut;                      // 0x00A8(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_InterpolationTypes">();
	}
	static class UDevices_CreativeAnimation_InterpolationTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_InterpolationTypes>();
	}
};
static_assert(alignof(UDevices_CreativeAnimation_InterpolationTypes) == 0x000008, "Wrong alignment on UDevices_CreativeAnimation_InterpolationTypes");
static_assert(sizeof(UDevices_CreativeAnimation_InterpolationTypes) == 0x0000C8, "Wrong size on UDevices_CreativeAnimation_InterpolationTypes");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0x9B27EB9D_Linear) == 0x000028, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0x9B27EB9D_Linear' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0x9CD14C25_Ease) == 0x000048, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0x9CD14C25_Ease' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0xB345298C_EaseIn) == 0x000068, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0xB345298C_EaseIn' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0xF59E2BD2_EaseOut) == 0x000088, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0xF59E2BD2_EaseOut' has a wrong offset!");
static_assert(offsetof(UDevices_CreativeAnimation_InterpolationTypes, __verse_0x29A389AE_EaseInOut) == 0x0000A8, "Member 'UDevices_CreativeAnimation_InterpolationTypes::__verse_0x29A389AE_EaseInOut' has a wrong offset!");

// VerseClass VerseDevices.task_Devices_device_event_void$Await
// 0x0020 (0x0168 - 0x0148)
class Utask_Devices_device_event_void_Await final : public UConcurrency_task
{
public:
	class UDevices_device_event_void*             _Self;                                             // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0150(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _RetVal;                                           // 0x0158(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices_device_event_void$Await">();
	}
	static class Utask_Devices_device_event_void_Await* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_device_event_void_Await>();
	}
};
static_assert(alignof(Utask_Devices_device_event_void_Await) == 0x000008, "Wrong alignment on Utask_Devices_device_event_void_Await");
static_assert(sizeof(Utask_Devices_device_event_void_Await) == 0x000168, "Wrong size on Utask_Devices_device_event_void_Await");
static_assert(offsetof(Utask_Devices_device_event_void_Await, _Self) == 0x000148, "Member 'Utask_Devices_device_event_void_Await::_Self' has a wrong offset!");
