#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseFortnite_classes.hpp"


namespace SDK
{

// VerseClass VerseFortnite.Characters_fort_character_impl
// 0x0230 (0x0280 - 0x0050)
class UCharacters_fort_character_impl final : public UVerseFortniteCharacter
{
public:
	FVerseFunctionProperty_                       __verse_0xCB6F79D3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent; // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1B4AAA99__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent; // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2F94B078__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation; // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x454A4B2C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent; // 0x0080(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC92ABB7D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent; // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD90058E7__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0F127353__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD3C45C5B__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0337C666__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x33C4CAA3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCBE35292__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5397112__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2A43A893__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9084EF8E__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable; // 0x0120(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x48326568__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield; // 0x0130(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8B41548F__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R; // 0x0140(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x26941A48__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield; // 0x0150(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4BA33B47__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF6DD1D2E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDCD5C88E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x919B3D8B__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBCC8CFC8__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7782AD90__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x641F6E2B__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF2F0AAD0__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3244305D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x339B570D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3579A169__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF6BFDA59__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R; // 0x0210(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF8CC989C__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent; // 0x0220(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0230(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x4DE1175C_DamagedHealthEventInternal;     // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x3EFD7EED_DamagedShieldEventInternal;     // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xF4EDADDB_HealedHealthEventInternal;      // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x87F1C46A_HealedShieldEventInternal;      // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x0008931F_CrouchedEventInternal;          // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xCE63A4CB_JumpedEventInternal;            // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x242DF4E0_SprintedEventInternal;          // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x5587B813_EliminatedEventInternal;        // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R(const struct FCharacters_stasis_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R(const struct FGame_damage_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R(const struct FGame_healing_args& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Characters_fort_character_impl">();
	}
	static class UCharacters_fort_character_impl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacters_fort_character_impl>();
	}
};
static_assert(alignof(UCharacters_fort_character_impl) == 0x000008, "Wrong alignment on UCharacters_fort_character_impl");
static_assert(sizeof(UCharacters_fort_character_impl) == 0x000280, "Wrong size on UCharacters_fort_character_impl");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xCB6F79D3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent) == 0x000050, "Member 'UCharacters_fort_character_impl::__verse_0xCB6F79D3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x1B4AAA99__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent) == 0x000060, "Member 'UCharacters_fort_character_impl::__verse_0x1B4AAA99__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x2F94B078__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation) == 0x000070, "Member 'UCharacters_fort_character_impl::__verse_0x2F94B078__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x454A4B2C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent) == 0x000080, "Member 'UCharacters_fort_character_impl::__verse_0x454A4B2C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xC92ABB7D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent) == 0x000090, "Member 'UCharacters_fort_character_impl::__verse_0xC92ABB7D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xD90058E7__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent) == 0x0000A0, "Member 'UCharacters_fort_character_impl::__verse_0xD90058E7__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x0F127353__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive) == 0x0000B0, "Member 'UCharacters_fort_character_impl::__verse_0x0F127353__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xD3C45C5B__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut) == 0x0000C0, "Member 'UCharacters_fort_character_impl::__verse_0xD3C45C5B__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x0337C666__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R) == 0x0000D0, "Member 'UCharacters_fort_character_impl::__verse_0x0337C666__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x33C4CAA3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis) == 0x0000E0, "Member 'UCharacters_fort_character_impl::__verse_0x33C4CAA3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xCBE35292__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow) == 0x0000F0, "Member 'UCharacters_fort_character_impl::__verse_0xCBE35292__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xC5397112__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide) == 0x000100, "Member 'UCharacters_fort_character_impl::__verse_0xC5397112__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x2A43A893__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R) == 0x000110, "Member 'UCharacters_fort_character_impl::__verse_0x2A43A893__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x9084EF8E__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable) == 0x000120, "Member 'UCharacters_fort_character_impl::__verse_0x9084EF8E__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x48326568__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield) == 0x000130, "Member 'UCharacters_fort_character_impl::__verse_0x48326568__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x8B41548F__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R) == 0x000140, "Member 'UCharacters_fort_character_impl::__verse_0x8B41548F__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x26941A48__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield) == 0x000150, "Member 'UCharacters_fort_character_impl::__verse_0x26941A48__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x4BA33B47__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R) == 0x000160, "Member 'UCharacters_fort_character_impl::__verse_0x4BA33B47__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xF6DD1D2E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent) == 0x000170, "Member 'UCharacters_fort_character_impl::__verse_0xF6DD1D2E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xDCD5C88E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent) == 0x000180, "Member 'UCharacters_fort_character_impl::__verse_0xDCD5C88E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x919B3D8B__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R) == 0x000190, "Member 'UCharacters_fort_character_impl::__verse_0x919B3D8B__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xBCC8CFC8__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R) == 0x0001A0, "Member 'UCharacters_fort_character_impl::__verse_0xBCC8CFC8__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x7782AD90__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent) == 0x0001B0, "Member 'UCharacters_fort_character_impl::__verse_0x7782AD90__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x641F6E2B__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth) == 0x0001C0, "Member 'UCharacters_fort_character_impl::__verse_0x641F6E2B__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xF2F0AAD0__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R) == 0x0001D0, "Member 'UCharacters_fort_character_impl::__verse_0xF2F0AAD0__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x3244305D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth) == 0x0001E0, "Member 'UCharacters_fort_character_impl::__verse_0x3244305D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x339B570D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R) == 0x0001F0, "Member 'UCharacters_fort_character_impl::__verse_0x339B570D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x3579A169__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R) == 0x000200, "Member 'UCharacters_fort_character_impl::__verse_0x3579A169__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xF6BFDA59__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R) == 0x000210, "Member 'UCharacters_fort_character_impl::__verse_0xF6BFDA59__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xF8CC989C__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent) == 0x000220, "Member 'UCharacters_fort_character_impl::__verse_0xF8CC989C__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x000230, "Member 'UCharacters_fort_character_impl::__verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x4DE1175C_DamagedHealthEventInternal) == 0x000240, "Member 'UCharacters_fort_character_impl::__verse_0x4DE1175C_DamagedHealthEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x3EFD7EED_DamagedShieldEventInternal) == 0x000248, "Member 'UCharacters_fort_character_impl::__verse_0x3EFD7EED_DamagedShieldEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xF4EDADDB_HealedHealthEventInternal) == 0x000250, "Member 'UCharacters_fort_character_impl::__verse_0xF4EDADDB_HealedHealthEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x87F1C46A_HealedShieldEventInternal) == 0x000258, "Member 'UCharacters_fort_character_impl::__verse_0x87F1C46A_HealedShieldEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x0008931F_CrouchedEventInternal) == 0x000260, "Member 'UCharacters_fort_character_impl::__verse_0x0008931F_CrouchedEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0xCE63A4CB_JumpedEventInternal) == 0x000268, "Member 'UCharacters_fort_character_impl::__verse_0xCE63A4CB_JumpedEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x242DF4E0_SprintedEventInternal) == 0x000270, "Member 'UCharacters_fort_character_impl::__verse_0x242DF4E0_SprintedEventInternal' has a wrong offset!");
static_assert(offsetof(UCharacters_fort_character_impl, __verse_0x5587B813_EliminatedEventInternal) == 0x000278, "Member 'UCharacters_fort_character_impl::__verse_0x5587B813_EliminatedEventInternal' has a wrong offset!");

// VerseClass VerseFortnite.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseFortnite_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFortnite.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortnite_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortnite_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseFortnite_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseFortnite_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseFortnite_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseFortnite_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseFortnite.Characters
// 0x0000 (0x0028 - 0x0028)
class UCharacters final : public UObject
{
public:
	static FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigatorAgent_U_L_Ngame__action__instigator_M_Ntuple_L_R_R(const struct Ftuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FCharacters_character_action_result Characters_character_action_result_Factory();
	static struct FCharacters_stasis_args Characters_stasis_args_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Characters">();
	}
	static class UCharacters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacters>();
	}
};
static_assert(alignof(UCharacters) == 0x000008, "Wrong alignment on UCharacters");
static_assert(sizeof(UCharacters) == 0x000028, "Wrong size on UCharacters");

// VerseClass VerseFortnite.Characters_fort_character
// 0x0000 (0x0028 - 0x0028)
class UCharacters_fort_character final : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R(const struct FCharacters_stasis_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Characters_fort_character">();
	}
	static class UCharacters_fort_character* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacters_fort_character>();
	}
};
static_assert(alignof(UCharacters_fort_character) == 0x000008, "Wrong alignment on UCharacters_fort_character");
static_assert(sizeof(UCharacters_fort_character) == 0x000028, "Wrong size on UCharacters_fort_character");

// VerseClass VerseFortnite.Game_agent_instigator_impl
// 0x0008 (0x0030 - 0x0028)
class UGame_agent_instigator_impl final : public UObject
{
public:
	class USimulation_agent*                      __verse_0x8D191063_TheAgent;                       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_agent_instigator_impl">();
	}
	static class UGame_agent_instigator_impl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_agent_instigator_impl>();
	}
};
static_assert(alignof(UGame_agent_instigator_impl) == 0x000008, "Wrong alignment on UGame_agent_instigator_impl");
static_assert(sizeof(UGame_agent_instigator_impl) == 0x000030, "Wrong size on UGame_agent_instigator_impl");
static_assert(offsetof(UGame_agent_instigator_impl, __verse_0x8D191063_TheAgent) == 0x000028, "Member 'UGame_agent_instigator_impl::__verse_0x8D191063_TheAgent' has a wrong offset!");

// VerseClass VerseFortnite.FortPlayerUtilities
// 0x0000 (0x0028 - 0x0028)
class UFortPlayerUtilities final : public UObject
{
public:
	static TArray<class USimulation_player*> _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eGetPlayersSpectating_U_L_Nplayer_M_Ntuple_L_R_R(const struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eIsSpectator_U_L_Nplayer_M_Ntuple_L_R_R(const struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eRespawn_U_L_Nagent_M_Ntuple_L_R_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSendToLobby_U_L_Nplayer_M_Ntuple_L_R_R(const struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSetSpectator_U_L_Nplayer_M_Ntuple_L_R_R(const struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSpectateEliminator_U_L_Nplayer_M_Ntuple_L_R_R(const struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FOptionProperty_ _L_2fFortnite_2ecom_2fFortPlayerUtilities_N_Roperator_U_2eSpectatePlayer_U_L_Nplayer_M_Ntuple_L_R_M_Nplayer_R(const struct Ftuple_Lplayer_Mtuple_L_R_Mplayer_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerUtilities">();
	}
	static class UFortPlayerUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerUtilities>();
	}
};
static_assert(alignof(UFortPlayerUtilities) == 0x000008, "Wrong alignment on UFortPlayerUtilities");
static_assert(sizeof(UFortPlayerUtilities) == 0x000028, "Wrong size on UFortPlayerUtilities");

// VerseClass VerseFortnite.Game
// 0x0000 (0x0028 - 0x0028)
class UGame final : public UObject
{
public:
	static struct FGame_damage_args Game_damage_args_Factory();
	static struct FGame_damage_result Game_damage_result_Factory();
	static struct FGame_elimination_result Game_elimination_result_Factory();
	static struct FGame_healing_args Game_healing_args_Factory();
	static struct FGame_healing_result Game_healing_result_Factory();

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game">();
	}
	static class UGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame>();
	}
};
static_assert(alignof(UGame) == 0x000008, "Wrong alignment on UGame");
static_assert(sizeof(UGame) == 0x000028, "Wrong size on UGame");

// VerseClass VerseFortnite.Game_damageable
// 0x0000 (0x0028 - 0x0028)
class UGame_damageable final : public UObject
{
public:
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R(const struct FGame_damage_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_damageable">();
	}
	static class UGame_damageable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_damageable>();
	}
};
static_assert(alignof(UGame_damageable) == 0x000008, "Wrong alignment on UGame_damageable");
static_assert(sizeof(UGame_damageable) == 0x000028, "Wrong size on UGame_damageable");

// VerseClass VerseFortnite.Game_game_action_causer
// 0x0000 (0x0028 - 0x0028)
class UGame_game_action_causer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_game_action_causer">();
	}
	static class UGame_game_action_causer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_game_action_causer>();
	}
};
static_assert(alignof(UGame_game_action_causer) == 0x000008, "Wrong alignment on UGame_game_action_causer");
static_assert(sizeof(UGame_game_action_causer) == 0x000028, "Wrong size on UGame_game_action_causer");

// VerseClass VerseFortnite.Game_game_action_instigator
// 0x0000 (0x0028 - 0x0028)
class UGame_game_action_instigator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_game_action_instigator">();
	}
	static class UGame_game_action_instigator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_game_action_instigator>();
	}
};
static_assert(alignof(UGame_game_action_instigator) == 0x000008, "Wrong alignment on UGame_game_action_instigator");
static_assert(sizeof(UGame_game_action_instigator) == 0x000028, "Wrong size on UGame_game_action_instigator");

// VerseClass VerseFortnite.Vehicles_fort_vehicle
// 0x0000 (0x0028 - 0x0028)
class UVehicles_fort_vehicle final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vehicles_fort_vehicle">();
	}
	static class UVehicles_fort_vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicles_fort_vehicle>();
	}
};
static_assert(alignof(UVehicles_fort_vehicle) == 0x000008, "Wrong alignment on UVehicles_fort_vehicle");
static_assert(sizeof(UVehicles_fort_vehicle) == 0x000028, "Wrong size on UVehicles_fort_vehicle");

// VerseClass VerseFortnite.Game_healable
// 0x0000 (0x0028 - 0x0028)
class UGame_healable final : public UObject
{
public:
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R(const struct FGame_healing_args& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_healable">();
	}
	static class UGame_healable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_healable>();
	}
};
static_assert(alignof(UGame_healable) == 0x000008, "Wrong alignment on UGame_healable");
static_assert(sizeof(UGame_healable) == 0x000028, "Wrong size on UGame_healable");

// VerseClass VerseFortnite.Game_healthful
// 0x0000 (0x0028 - 0x0028)
class UGame_healthful final : public UObject
{
public:
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_healthful">();
	}
	static class UGame_healthful* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_healthful>();
	}
};
static_assert(alignof(UGame_healthful) == 0x000008, "Wrong alignment on UGame_healthful");
static_assert(sizeof(UGame_healthful) == 0x000028, "Wrong size on UGame_healthful");

// VerseClass VerseFortnite.Game_positional
// 0x0000 (0x0028 - 0x0028)
class UGame_positional final : public UObject
{
public:
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_positional">();
	}
	static class UGame_positional* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_positional>();
	}
};
static_assert(alignof(UGame_positional) == 0x000008, "Wrong alignment on UGame_positional");
static_assert(sizeof(UGame_positional) == 0x000028, "Wrong size on UGame_positional");

// VerseClass VerseFortnite.Game_shieldable
// 0x0000 (0x0028 - 0x0028)
class UGame_shieldable final : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_shieldable">();
	}
	static class UGame_shieldable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_shieldable>();
	}
};
static_assert(alignof(UGame_shieldable) == 0x000008, "Wrong alignment on UGame_shieldable");
static_assert(sizeof(UGame_shieldable) == 0x000028, "Wrong size on UGame_shieldable");

// VerseClass VerseFortnite.Playspaces_fort_playspace
// 0x0000 (0x0028 - 0x0028)
class UPlayspaces_fort_playspace final : public UObject
{
public:
	TArray<class USimulation_player*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Playspaces_fort_playspace">();
	}
	static class UPlayspaces_fort_playspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaces_fort_playspace>();
	}
};
static_assert(alignof(UPlayspaces_fort_playspace) == 0x000008, "Wrong alignment on UPlayspaces_fort_playspace");
static_assert(sizeof(UPlayspaces_fort_playspace) == 0x000028, "Wrong size on UPlayspaces_fort_playspace");

// VerseClass VerseFortnite.Playspaces_fort_playspace_impl
// 0x0050 (0x00C8 - 0x0078)
class UPlayspaces_fort_playspace_impl final : public UVerseFortnitePlayspace
{
public:
	FVerseFunctionProperty_                       __verse_0x3B43FA74__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x179254F9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5ED7C0BA__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8B6A4ED9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        __verse_0xD574E81A_PlayerAddedEventInternal;       // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        __verse_0x91891F4A_PlayerRemovedEventInternal;     // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TArray<class USimulation_player*> _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Playspaces_fort_playspace_impl">();
	}
	static class UPlayspaces_fort_playspace_impl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaces_fort_playspace_impl>();
	}
};
static_assert(alignof(UPlayspaces_fort_playspace_impl) == 0x000008, "Wrong alignment on UPlayspaces_fort_playspace_impl");
static_assert(sizeof(UPlayspaces_fort_playspace_impl) == 0x0000C8, "Wrong size on UPlayspaces_fort_playspace_impl");
static_assert(offsetof(UPlayspaces_fort_playspace_impl, __verse_0x3B43FA74__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers) == 0x000078, "Member 'UPlayspaces_fort_playspace_impl::__verse_0x3B43FA74__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetPlayers' has a wrong offset!");
static_assert(offsetof(UPlayspaces_fort_playspace_impl, __verse_0x179254F9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection) == 0x000088, "Member 'UPlayspaces_fort_playspace_impl::__verse_0x179254F9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RGetTeamCollection' has a wrong offset!");
static_assert(offsetof(UPlayspaces_fort_playspace_impl, __verse_0x5ED7C0BA__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent) == 0x000098, "Member 'UPlayspaces_fort_playspace_impl::__verse_0x5ED7C0BA__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerAddedEvent' has a wrong offset!");
static_assert(offsetof(UPlayspaces_fort_playspace_impl, __verse_0x8B6A4ED9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent) == 0x0000A8, "Member 'UPlayspaces_fort_playspace_impl::__verse_0x8B6A4ED9__L_2fFortnite_2ecom_2fPlayspaces_2ffort__playspace_N_RPlayerRemovedEvent' has a wrong offset!");
static_assert(offsetof(UPlayspaces_fort_playspace_impl, __verse_0xD574E81A_PlayerAddedEventInternal) == 0x0000B8, "Member 'UPlayspaces_fort_playspace_impl::__verse_0xD574E81A_PlayerAddedEventInternal' has a wrong offset!");
static_assert(offsetof(UPlayspaces_fort_playspace_impl, __verse_0x91891F4A_PlayerRemovedEventInternal) == 0x0000C0, "Member 'UPlayspaces_fort_playspace_impl::__verse_0x91891F4A_PlayerRemovedEventInternal' has a wrong offset!");

// VerseClass VerseFortnite.Teams_fort_br_team_collection
// 0x0070 (0x0100 - 0x0090)
class UTeams_fort_br_team_collection final : public UVerseFortniteBRTeamCollection
{
public:
	FVerseFunctionProperty_                       __verse_0x2B14CBA3__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams; // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7D93C574__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF54858F7__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA8860961__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x50AAD761__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x91ADE272__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDE2FEE1D__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R(const struct Ftuple_Lagent_Mteam_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R(class USimulation_team* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R(const struct Ftuple_Lagent_Magent_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R(const struct Ftuple_Lteam_Mteam_R& __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_team*> _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R(const struct Ftuple_Lagent_Mteam_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Teams_fort_br_team_collection">();
	}
	static class UTeams_fort_br_team_collection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeams_fort_br_team_collection>();
	}
};
static_assert(alignof(UTeams_fort_br_team_collection) == 0x000008, "Wrong alignment on UTeams_fort_br_team_collection");
static_assert(sizeof(UTeams_fort_br_team_collection) == 0x000100, "Wrong size on UTeams_fort_br_team_collection");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0x2B14CBA3__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams) == 0x000090, "Member 'UTeams_fort_br_team_collection::__verse_0x2B14CBA3__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams' has a wrong offset!");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0x7D93C574__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R) == 0x0000A0, "Member 'UTeams_fort_br_team_collection::__verse_0x7D93C574__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0xF54858F7__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R) == 0x0000B0, "Member 'UTeams_fort_br_team_collection::__verse_0xF54858F7__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0xA8860961__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R) == 0x0000C0, "Member 'UTeams_fort_br_team_collection::__verse_0xA8860961__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0x50AAD761__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R) == 0x0000D0, "Member 'UTeams_fort_br_team_collection::__verse_0x50AAD761__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0x91ADE272__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R) == 0x0000E0, "Member 'UTeams_fort_br_team_collection::__verse_0x91ADE272__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_br_team_collection, __verse_0xDE2FEE1D__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R) == 0x0000F0, "Member 'UTeams_fort_br_team_collection::__verse_0xDE2FEE1D__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R' has a wrong offset!");

// VerseClass VerseFortnite.Teams_fort_minigame_team_collection
// 0x0070 (0x00B8 - 0x0048)
class UTeams_fort_minigame_team_collection final : public UVerseFortniteMinigameTeamCollection
{
public:
	FVerseFunctionProperty_                       __verse_0x2B14CBA3__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7D93C574__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF54858F7__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA8860961__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x50AAD761__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x91ADE272__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDE2FEE1D__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R(const struct Ftuple_Lagent_Mteam_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R(class USimulation_team* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R(const struct Ftuple_Lagent_Magent_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R(const struct Ftuple_Lteam_Mteam_R& __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_team*> _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R(const struct Ftuple_Lagent_Mteam_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Teams_fort_minigame_team_collection">();
	}
	static class UTeams_fort_minigame_team_collection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeams_fort_minigame_team_collection>();
	}
};
static_assert(alignof(UTeams_fort_minigame_team_collection) == 0x000008, "Wrong alignment on UTeams_fort_minigame_team_collection");
static_assert(sizeof(UTeams_fort_minigame_team_collection) == 0x0000B8, "Wrong size on UTeams_fort_minigame_team_collection");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0x2B14CBA3__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams) == 0x000048, "Member 'UTeams_fort_minigame_team_collection::__verse_0x2B14CBA3__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams' has a wrong offset!");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0x7D93C574__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R) == 0x000058, "Member 'UTeams_fort_minigame_team_collection::__verse_0x7D93C574__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0xF54858F7__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R) == 0x000068, "Member 'UTeams_fort_minigame_team_collection::__verse_0xF54858F7__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0xA8860961__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R) == 0x000078, "Member 'UTeams_fort_minigame_team_collection::__verse_0xA8860961__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0x50AAD761__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R) == 0x000088, "Member 'UTeams_fort_minigame_team_collection::__verse_0x50AAD761__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0x91ADE272__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R) == 0x000098, "Member 'UTeams_fort_minigame_team_collection::__verse_0x91ADE272__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R' has a wrong offset!");
static_assert(offsetof(UTeams_fort_minigame_team_collection, __verse_0xDE2FEE1D__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R) == 0x0000A8, "Member 'UTeams_fort_minigame_team_collection::__verse_0xDE2FEE1D__L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R' has a wrong offset!");

// VerseClass VerseFortnite.Teams_fort_team_collection
// 0x0000 (0x0028 - 0x0028)
class UTeams_fort_team_collection final : public UObject
{
public:
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RAddToTeam_L_Nagent_M_Nteam_R(const struct Ftuple_Lagent_Mteam_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetAgents_L_Nteam_R(class USimulation_team* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nagent_M_Nagent_R(const struct Ftuple_Lagent_Magent_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeamAttitude_L_Nteam_M_Nteam_R(const struct Ftuple_Lteam_Mteam_R& __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_team*> _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RGetTeams(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FOptionProperty_ _L_2fFortnite_2ecom_2fTeams_2ffort__team__collection_N_RIsOnTeam_L_Nagent_M_Nteam_R(const struct Ftuple_Lagent_Mteam_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Teams_fort_team_collection">();
	}
	static class UTeams_fort_team_collection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeams_fort_team_collection>();
	}
};
static_assert(alignof(UTeams_fort_team_collection) == 0x000008, "Wrong alignment on UTeams_fort_team_collection");
static_assert(sizeof(UTeams_fort_team_collection) == 0x000028, "Wrong size on UTeams_fort_team_collection");

// VerseClass VerseFortnite.Vehicles
// 0x0000 (0x0028 - 0x0028)
class UVehicles final : public UObject
{
public:
	static FOptionProperty_ _L_2fFortnite_2ecom_2fVehicles_N_Roperator_U_2eGetVehicle_U_L_Nfort__character_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vehicles">();
	}
	static class UVehicles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicles>();
	}
};
static_assert(alignof(UVehicles) == 0x000008, "Wrong alignment on UVehicles");
static_assert(sizeof(UVehicles) == 0x000028, "Wrong size on UVehicles");

// VerseClass VerseFortnite.Vehicles_fort_vehicle_impl
// 0x0088 (0x00D0 - 0x0048)
class UVehicles_fort_vehicle_impl final : public UVerseFortniteActorWrapper
{
public:
	FVerseFunctionProperty_                       __verse_0x919B3D8B__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBCC8CFC8__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7782AD90__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x641F6E2B__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF2F0AAD0__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
