#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "VerseFortnite_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite.Characters_fort_character_impl.$InitCDO
// 0x0080 (0x0080 - 0x0000)
struct Characters_fort_character_impl__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_12;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_14;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__InitCDO) == 0x000008, "Wrong alignment on Characters_fort_character_impl__InitCDO");
static_assert(sizeof(Characters_fort_character_impl__InitCDO) == 0x000080, "Wrong size on Characters_fort_character_impl__InitCDO");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_0) == 0x000000, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_1) == 0x000008, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_1' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_2) == 0x000010, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_3) == 0x000018, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_3' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_4) == 0x000020, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_4' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_5) == 0x000028, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_5' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_6) == 0x000030, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_6' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_7) == 0x000038, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_7' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_8) == 0x000040, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_8' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_9) == 0x000048, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_9' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_10) == 0x000050, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_10' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_11) == 0x000058, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_11' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_12) == 0x000060, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_12' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_13) == 0x000068, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_13' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _ExprResult_14) == 0x000070, "Member 'Characters_fort_character_impl__InitCDO::_ExprResult_14' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__InitCDO, _InstancingGraph_15) == 0x000078, "Member 'Characters_fort_character_impl__InitCDO::_InstancingGraph_15' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FOptionProperty_                              RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation
// 0x0030 (0x0030 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation) == 0x000010, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation) == 0x000030, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation, RetVal) == 0x000010, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide) == 0x000001, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive) == 0x000003, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive, RetVal) == 0x000001, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut) == 0x000003, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut, RetVal) == 0x000001, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable) == 0x000003, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable, RetVal) == 0x000001, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R final
{
public:
	struct FCharacters_stasis_args                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0003)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R) == 0x000003, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis) == 0x000001, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R) == 0x000001, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow) == 0x000001, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow) == 0x000001, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R
// 0x0018 (0x0018 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R final
{
public:
	struct FGame_damage_args                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R) == 0x000018, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R) == 0x000008, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R) == 0x000008, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R
// 0x0018 (0x0018 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R final
{
public:
	struct FGame_healing_args                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R) == 0x000018, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R) == 0x000008, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R) == 0x000008, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
// 0x0070 (0x0070 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x000010, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform) == 0x000070, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform, RetVal) == 0x000010, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent) == 0x000010, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent, RetVal) == 0x000008, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R) == 0x000008, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R) == 0x000008, "Wrong alignment on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R");
static_assert(sizeof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R) == 0x000008, "Wrong size on Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R");
static_assert(offsetof(Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	FOptionProperty_                              RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R) == 0x000008, "Wrong alignment on Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R");
static_assert(sizeof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R) == 0x000018, "Wrong size on Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R");
static_assert(offsetof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R, RetVal) == 0x000010, "Member 'Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetFortCharacter_U_L_Nagent_M_Ntuple_L_R_R::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R) == 0x000008, "Wrong alignment on Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R");
static_assert(sizeof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R) == 0x000018, "Wrong size on Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R");
static_assert(offsetof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R, RetVal) == 0x000010, "Member 'Characters__L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigator_U_L_Nagent_M_Ntuple_L_R_R::RetVal' has a wrong offset!");

// Function VerseFortnite.Characters._L_2fFortnite_2ecom_2fCharacters_N_Roperator_U_2eGetInstigatorAgent_U_L_Ngame__action__instigator_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
