#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKEditGameplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class VKEditGameplay.VKEditGameplayAssetsToCook
// 0x0010 (0x0040 - 0x0030)
class UVKEditGameplayAssetsToCook final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UObject>>         Assets;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VKEditGameplayAssetsToCook">();
	}
	static class UVKEditGameplayAssetsToCook* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVKEditGameplayAssetsToCook>();
	}
};
static_assert(alignof(UVKEditGameplayAssetsToCook) == 0x000008, "Wrong alignment on UVKEditGameplayAssetsToCook");
static_assert(sizeof(UVKEditGameplayAssetsToCook) == 0x000040, "Wrong size on UVKEditGameplayAssetsToCook");
static_assert(offsetof(UVKEditGameplayAssetsToCook, Assets) == 0x000030, "Member 'UVKEditGameplayAssetsToCook::Assets' has a wrong offset!");

// Class VKEditGameplay.PlayspaceComponent_PlaysetRootSpawner
// 0x0018 (0x0110 - 0x00F8)
class UPlayspaceComponent_PlaysetRootSpawner final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x18];                                      // 0x00F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_PlaysetRootSpawner">();
	}
	static class UPlayspaceComponent_PlaysetRootSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_PlaysetRootSpawner>();
	}
};
static_assert(alignof(UPlayspaceComponent_PlaysetRootSpawner) == 0x000008, "Wrong alignment on UPlayspaceComponent_PlaysetRootSpawner");
static_assert(sizeof(UPlayspaceComponent_PlaysetRootSpawner) == 0x000110, "Wrong size on UPlayspaceComponent_PlaysetRootSpawner");

// Class VKEditGameplay.PlayspaceComponent_VKEditCreativeToolsPermission
// 0x0000 (0x01E0 - 0x01E0)
class UPlayspaceComponent_VKEditCreativeToolsPermission final : public UPlayspaceComponent_CreativeToolsPermission
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_VKEditCreativeToolsPermission">();
	}
	static class UPlayspaceComponent_VKEditCreativeToolsPermission* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_VKEditCreativeToolsPermission>();
	}
};
static_assert(alignof(UPlayspaceComponent_VKEditCreativeToolsPermission) == 0x000008, "Wrong alignment on UPlayspaceComponent_VKEditCreativeToolsPermission");
static_assert(sizeof(UPlayspaceComponent_VKEditCreativeToolsPermission) == 0x0001E0, "Wrong size on UPlayspaceComponent_VKEditCreativeToolsPermission");

// Class VKEditGameplay.VKEditPlayspace
// 0x0100 (0x0770 - 0x0670)
class AVKEditPlayspace final : public AFortPlayspace
{
public:
	uint8                                         Pad_670[0x20];                                     // 0x0670(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   EditorOnlyMinigameSettingsMachineClassToSpawn;     // 0x0690(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   EditorOnlyWorldManagerClassToSpawn;                // 0x06B8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLevelStreamComponent*              LevelStreamComponent;                              // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortProjectEditComponent*              ProjectEditComponent;                              // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_PlayStopPauseManager* PlayStopPauseManager;                              // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_EditConnectionManager* EditConnectionManager;                             // 0x06F8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_LiveEdit*           LiveEditComponent;                                 // 0x0700(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_VKEditCreativeToolsPermission* CreativeToolsPermission;                           // 0x0708(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_CreativeLoadingStateProxy* CreativeLoadingStateProxy;                         // 0x0710(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_SpatialGameplay*    SpatialGameplayComponent;                          // 0x0718(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVolumeObjectTrackingComponent*     ObjectTrackingComponent;                           // 0x0720(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_DeviceTracking*     DeviceTrackerComponent;                            // 0x0728(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_CreativeInventory*  CreativeInventoryComponent;                        // 0x0730(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_ActorMemoryTracker* ActorMemoryTrackerComponent;                       // 0x0738(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeDynamicXpComponent*        FortCreativeDynamicXp;                             // 0x0740(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_CreativeModifyEmotes* CreativeModifyEmotesComponent;                     // 0x0748(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayspaceComponent_WorldTimeOfDayOverride* WorldTimeOfDayOverrideComponent;                   // 0x0750(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayspaceComponent_NaniteSettingsOverride* NaniteSettingsOverrideComponent;                   // 0x0758(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_PlaysetRootSpawner* PlaysetRootSpawnerComponent;                       // 0x0760(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceComponent_PlayerPawnOverrides* PlayerPawnOverridesComponent;                      // 0x0768(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnClientActivatedContent(const struct FUniqueNetIdRepl& ClientNetId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VKEditPlayspace">();
	}
	static class AVKEditPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVKEditPlayspace>();
	}
};
static_assert(alignof(AVKEditPlayspace) == 0x000008, "Wrong alignment on AVKEditPlayspace");
static_assert(sizeof(AVKEditPlayspace) == 0x000770, "Wrong size on AVKEditPlayspace");
static_assert(offsetof(AVKEditPlayspace, EditorOnlyMinigameSettingsMachineClassToSpawn) == 0x000690, "Member 'AVKEditPlayspace::EditorOnlyMinigameSettingsMachineClassToSpawn' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, EditorOnlyWorldManagerClassToSpawn) == 0x0006B8, "Member 'AVKEditPlayspace::EditorOnlyWorldManagerClassToSpawn' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, LevelStreamComponent) == 0x0006E0, "Member 'AVKEditPlayspace::LevelStreamComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, ProjectEditComponent) == 0x0006E8, "Member 'AVKEditPlayspace::ProjectEditComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, PlayStopPauseManager) == 0x0006F0, "Member 'AVKEditPlayspace::PlayStopPauseManager' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, EditConnectionManager) == 0x0006F8, "Member 'AVKEditPlayspace::EditConnectionManager' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, LiveEditComponent) == 0x000700, "Member 'AVKEditPlayspace::LiveEditComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, CreativeToolsPermission) == 0x000708, "Member 'AVKEditPlayspace::CreativeToolsPermission' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, CreativeLoadingStateProxy) == 0x000710, "Member 'AVKEditPlayspace::CreativeLoadingStateProxy' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, SpatialGameplayComponent) == 0x000718, "Member 'AVKEditPlayspace::SpatialGameplayComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, ObjectTrackingComponent) == 0x000720, "Member 'AVKEditPlayspace::ObjectTrackingComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, DeviceTrackerComponent) == 0x000728, "Member 'AVKEditPlayspace::DeviceTrackerComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, CreativeInventoryComponent) == 0x000730, "Member 'AVKEditPlayspace::CreativeInventoryComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, ActorMemoryTrackerComponent) == 0x000738, "Member 'AVKEditPlayspace::ActorMemoryTrackerComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, FortCreativeDynamicXp) == 0x000740, "Member 'AVKEditPlayspace::FortCreativeDynamicXp' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, CreativeModifyEmotesComponent) == 0x000748, "Member 'AVKEditPlayspace::CreativeModifyEmotesComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, WorldTimeOfDayOverrideComponent) == 0x000750, "Member 'AVKEditPlayspace::WorldTimeOfDayOverrideComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, NaniteSettingsOverrideComponent) == 0x000758, "Member 'AVKEditPlayspace::NaniteSettingsOverrideComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, PlaysetRootSpawnerComponent) == 0x000760, "Member 'AVKEditPlayspace::PlaysetRootSpawnerComponent' has a wrong offset!");
static_assert(offsetof(AVKEditPlayspace, PlayerPawnOverridesComponent) == 0x000768, "Member 'AVKEditPlayspace::PlayerPawnOverridesComponent' has a wrong offset!");

// Class VKEditGameplay.PlayspaceComponent_EditConnectionManager
// 0x0088 (0x0180 - 0x00F8)
class UPlayspaceComponent_EditConnectionManager final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x60];                                      // 0x00F8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EditConnections;                                   // 0x0158(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVkEditStatus                                 VkEditStatus;                                      // 0x015C(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  UITagsToHide;                                      // 0x0160(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_EditConnections() const;
	void OnRep_VkEditStatus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_EditConnectionManager">();
	}
	static class UPlayspaceComponent_EditConnectionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_EditConnectionManager>();
	}
};
static_assert(alignof(UPlayspaceComponent_EditConnectionManager) == 0x000008, "Wrong alignment on UPlayspaceComponent_EditConnectionManager");
static_assert(sizeof(UPlayspaceComponent_EditConnectionManager) == 0x000180, "Wrong size on UPlayspaceComponent_EditConnectionManager");
static_assert(offsetof(UPlayspaceComponent_EditConnectionManager, EditConnections) == 0x000158, "Member 'UPlayspaceComponent_EditConnectionManager::EditConnections' has a wrong offset!");
static_assert(offsetof(UPlayspaceComponent_EditConnectionManager, VkEditStatus) == 0x00015C, "Member 'UPlayspaceComponent_EditConnectionManager::VkEditStatus' has a wrong offset!");
static_assert(offsetof(UPlayspaceComponent_EditConnectionManager, UITagsToHide) == 0x000160, "Member 'UPlayspaceComponent_EditConnectionManager::UITagsToHide' has a wrong offset!");

}

