#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelChangePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelChangePopup.VoiceChannelChangePopup_C
// 0x0070 (0x0420 - 0x03B0)
class UVoiceChannelChangePopup_C final : public UFortVoiceChannelChangePopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AmbientIconPulse;                                  // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadKeybindWrapper;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Mic;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         KBKeybindWrapper;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MicPulse;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_KeybindWidgets;                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_Hold;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   M_Param_ColorA;                                    // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   M_Param_ColorB;                                    // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   M_Param_Progress;                                  // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorB;                                            // 0x03FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorA;                                            // 0x040C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseOnAnimationFinish;                         // 0x041C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_VoiceChannelChangePopup(int32 EntryPoint);
	void OnInputModeChanged(ECommonInputType NewInputType);
	void OnPlayCloseAnimation();
	void OnPlayOpenAnimation();
	void Popup_Animation_Finished();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelChangePopup_C">();
	}
	static class UVoiceChannelChangePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelChangePopup_C>();
	}
};
static_assert(alignof(UVoiceChannelChangePopup_C) == 0x000008, "Wrong alignment on UVoiceChannelChangePopup_C");
static_assert(sizeof(UVoiceChannelChangePopup_C) == 0x000420, "Wrong size on UVoiceChannelChangePopup_C");
static_assert(offsetof(UVoiceChannelChangePopup_C, UberGraphFrame) == 0x0003B0, "Member 'UVoiceChannelChangePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, AmbientIconPulse) == 0x0003B8, "Member 'UVoiceChannelChangePopup_C::AmbientIconPulse' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, GamepadKeybindWrapper) == 0x0003C0, "Member 'UVoiceChannelChangePopup_C::GamepadKeybindWrapper' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, Image_Mic) == 0x0003C8, "Member 'UVoiceChannelChangePopup_C::Image_Mic' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, KBKeybindWrapper) == 0x0003D0, "Member 'UVoiceChannelChangePopup_C::KBKeybindWrapper' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, MicPulse) == 0x0003D8, "Member 'UVoiceChannelChangePopup_C::MicPulse' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, Switcher_KeybindWidgets) == 0x0003E0, "Member 'UVoiceChannelChangePopup_C::Switcher_KeybindWidgets' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, Text_Hold) == 0x0003E8, "Member 'UVoiceChannelChangePopup_C::Text_Hold' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, M_Param_ColorA) == 0x0003F0, "Member 'UVoiceChannelChangePopup_C::M_Param_ColorA' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, M_Param_ColorB) == 0x0003F4, "Member 'UVoiceChannelChangePopup_C::M_Param_ColorB' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, M_Param_Progress) == 0x0003F8, "Member 'UVoiceChannelChangePopup_C::M_Param_Progress' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, ColorB) == 0x0003FC, "Member 'UVoiceChannelChangePopup_C::ColorB' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, ColorA) == 0x00040C, "Member 'UVoiceChannelChangePopup_C::ColorA' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, CollapseOnAnimationFinish) == 0x00041C, "Member 'UVoiceChannelChangePopup_C::CollapseOnAnimationFinish' has a wrong offset!");

}

