#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelHeaderButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelHeaderButton.VoiceChannelHeaderButton_C
// 0x00B0 (0x1540 - 0x1490)
class UVoiceChannelHeaderButton_C final : public UFortVoiceChannelHeaderButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnExpansion;                                       // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JoinSlideOut;                                      // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScaleUp;                                           // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortMobileImage*                       ExpandDirectionTick;                               // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Join;                                         // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VoiceChatWarning;                            // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   JoinText;                                          // 0x14C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotTransmitting;                                   // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OffText;                                           // 0x14D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OnOffSwitcher;                                     // 0x14E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OnText;                                            // 0x14E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectionBackplate;                                // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SimultaneousChannelSwitcher;                       // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Transmitting;                               // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Transmitting;                                      // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusActiveColor;                            // 0x1518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VoiceStatusWarningColor;                           // 0x1528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnUnhovered();
	void ExecuteUbergraph_VoiceChannelHeaderButton(int32 EntryPoint);
	void OnListItemObjectSet_1(class UObject* ListItemObject);
	void OnUpdateVisuals(bool bIsActiveAndListening, bool bIsActiveOrAvailable, bool bIsAvailableAndNotActive, bool bIsListening, bool bShowingRestriction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelHeaderButton_C">();
	}
	static class UVoiceChannelHeaderButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelHeaderButton_C>();
	}
};
static_assert(alignof(UVoiceChannelHeaderButton_C) == 0x000010, "Wrong alignment on UVoiceChannelHeaderButton_C");
static_assert(sizeof(UVoiceChannelHeaderButton_C) == 0x001540, "Wrong size on UVoiceChannelHeaderButton_C");
static_assert(offsetof(UVoiceChannelHeaderButton_C, UberGraphFrame) == 0x001490, "Member 'UVoiceChannelHeaderButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnExpansion) == 0x001498, "Member 'UVoiceChannelHeaderButton_C::OnExpansion' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, JoinSlideOut) == 0x0014A0, "Member 'UVoiceChannelHeaderButton_C::JoinSlideOut' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, ScaleUp) == 0x0014A8, "Member 'UVoiceChannelHeaderButton_C::ScaleUp' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, ExpandDirectionTick) == 0x0014B0, "Member 'UVoiceChannelHeaderButton_C::ExpandDirectionTick' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, HBox_Join) == 0x0014B8, "Member 'UVoiceChannelHeaderButton_C::HBox_Join' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Image_VoiceChatWarning) == 0x0014C0, "Member 'UVoiceChannelHeaderButton_C::Image_VoiceChatWarning' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, JoinText) == 0x0014C8, "Member 'UVoiceChannelHeaderButton_C::JoinText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, NotTransmitting) == 0x0014D0, "Member 'UVoiceChannelHeaderButton_C::NotTransmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OffText) == 0x0014D8, "Member 'UVoiceChannelHeaderButton_C::OffText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnOffSwitcher) == 0x0014E0, "Member 'UVoiceChannelHeaderButton_C::OnOffSwitcher' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, OnText) == 0x0014E8, "Member 'UVoiceChannelHeaderButton_C::OnText' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Overlay_1) == 0x0014F0, "Member 'UVoiceChannelHeaderButton_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, SelectionBackplate) == 0x0014F8, "Member 'UVoiceChannelHeaderButton_C::SelectionBackplate' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, SimultaneousChannelSwitcher) == 0x001500, "Member 'UVoiceChannelHeaderButton_C::SimultaneousChannelSwitcher' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Switch_Transmitting) == 0x001508, "Member 'UVoiceChannelHeaderButton_C::Switch_Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, Transmitting) == 0x001510, "Member 'UVoiceChannelHeaderButton_C::Transmitting' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, VoiceStatusActiveColor) == 0x001518, "Member 'UVoiceChannelHeaderButton_C::VoiceStatusActiveColor' has a wrong offset!");
static_assert(offsetof(UVoiceChannelHeaderButton_C, VoiceStatusWarningColor) == 0x001528, "Member 'UVoiceChannelHeaderButton_C::VoiceStatusWarningColor' has a wrong offset!");

}

