#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AudioAnalysis_FloatGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_AudioAnalysis_FloatGraph.WB_AudioAnalysis_FloatGraph_C
// 0x0080 (0x02E8 - 0x0268)
class UWB_AudioAnalysis_FloatGraph_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label_;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          calculated;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Parameter;                                         // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Points;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         numPoints;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VectorIndex;                                       // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialParameterCollection*           Collection;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void calcWidgetSize(const struct FGeometry& geom);
	void Construct();
	void ExecuteUbergraph_WB_AudioAnalysis_FloatGraph(int32 EntryPoint);
	void Initialize_MPC(class FName Parameter_0, class UMaterialParameterCollection* Collection_0, int32 VectorIndex_0);
	void PreConstruct(bool IsDesignTime);
	void Set_Value(double Value_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_AudioAnalysis_FloatGraph_C">();
	}
	static class UWB_AudioAnalysis_FloatGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_AudioAnalysis_FloatGraph_C>();
	}
};
static_assert(alignof(UWB_AudioAnalysis_FloatGraph_C) == 0x000008, "Wrong alignment on UWB_AudioAnalysis_FloatGraph_C");
static_assert(sizeof(UWB_AudioAnalysis_FloatGraph_C) == 0x0002E8, "Wrong size on UWB_AudioAnalysis_FloatGraph_C");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, UberGraphFrame) == 0x000268, "Member 'UWB_AudioAnalysis_FloatGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, CanvasPanel_0) == 0x000270, "Member 'UWB_AudioAnalysis_FloatGraph_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Label_) == 0x000278, "Member 'UWB_AudioAnalysis_FloatGraph_C::Label_' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, ProgressBar) == 0x000280, "Member 'UWB_AudioAnalysis_FloatGraph_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Value) == 0x000288, "Member 'UWB_AudioAnalysis_FloatGraph_C::Value' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Position) == 0x000290, "Member 'UWB_AudioAnalysis_FloatGraph_C::Position' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Size) == 0x0002A0, "Member 'UWB_AudioAnalysis_FloatGraph_C::Size' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, calculated) == 0x0002B0, "Member 'UWB_AudioAnalysis_FloatGraph_C::calculated' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Parameter) == 0x0002B4, "Member 'UWB_AudioAnalysis_FloatGraph_C::Parameter' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Points) == 0x0002B8, "Member 'UWB_AudioAnalysis_FloatGraph_C::Points' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, numPoints) == 0x0002C8, "Member 'UWB_AudioAnalysis_FloatGraph_C::numPoints' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Color) == 0x0002CC, "Member 'UWB_AudioAnalysis_FloatGraph_C::Color' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, VectorIndex) == 0x0002DC, "Member 'UWB_AudioAnalysis_FloatGraph_C::VectorIndex' has a wrong offset!");
static_assert(offsetof(UWB_AudioAnalysis_FloatGraph_C, Collection) == 0x0002E0, "Member 'UWB_AudioAnalysis_FloatGraph_C::Collection' has a wrong offset!");

}

