#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerAvatar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerAvatar.WBP_PlayerAvatar_C
// 0x00C0 (0x0338 - 0x0278)
class UWBP_PlayerAvatar_C final : public UFortPlayerAvatar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                Spacer_Size;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               AvatarMaterial;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AvatarSize;                                        // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceSelect_Online;                             // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceSelect_Away;                               // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceSelect_Offline;                            // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceSelect_Blocked;                            // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceColor_Online;                              // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceColor_Away;                                // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PresenceColor_Offline;                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowOnlinePresence;                                // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PresenceIconScale;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PresenceIconOffset;                                // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowPresenceBg;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Event_Set_Presence_Icon_Settings(double Scale, const struct FVector2D& Offset);
	void Event_Set_Size(const struct FVector2D& NewSize);
	void ExecuteUbergraph_WBP_PlayerAvatar(int32 EntryPoint);
	void OnOnlinePresenceChanged(const bool bHidePresence, const EPresenceIndicatorState PresenceState);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerAvatar_C">();
	}
	static class UWBP_PlayerAvatar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerAvatar_C>();
	}
};
static_assert(alignof(UWBP_PlayerAvatar_C) == 0x000008, "Wrong alignment on UWBP_PlayerAvatar_C");
static_assert(sizeof(UWBP_PlayerAvatar_C) == 0x000338, "Wrong size on UWBP_PlayerAvatar_C");
static_assert(offsetof(UWBP_PlayerAvatar_C, UberGraphFrame) == 0x000278, "Member 'UWBP_PlayerAvatar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, Spacer_Size) == 0x000280, "Member 'UWBP_PlayerAvatar_C::Spacer_Size' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, AvatarMaterial) == 0x000288, "Member 'UWBP_PlayerAvatar_C::AvatarMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, AvatarSize) == 0x000290, "Member 'UWBP_PlayerAvatar_C::AvatarSize' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceSelect_Online) == 0x0002A0, "Member 'UWBP_PlayerAvatar_C::PresenceSelect_Online' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceSelect_Away) == 0x0002B0, "Member 'UWBP_PlayerAvatar_C::PresenceSelect_Away' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceSelect_Offline) == 0x0002C0, "Member 'UWBP_PlayerAvatar_C::PresenceSelect_Offline' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceSelect_Blocked) == 0x0002D0, "Member 'UWBP_PlayerAvatar_C::PresenceSelect_Blocked' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceColor_Online) == 0x0002E0, "Member 'UWBP_PlayerAvatar_C::PresenceColor_Online' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceColor_Away) == 0x0002F0, "Member 'UWBP_PlayerAvatar_C::PresenceColor_Away' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceColor_Offline) == 0x000300, "Member 'UWBP_PlayerAvatar_C::PresenceColor_Offline' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, ShowOnlinePresence) == 0x000310, "Member 'UWBP_PlayerAvatar_C::ShowOnlinePresence' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceIconScale) == 0x000318, "Member 'UWBP_PlayerAvatar_C::PresenceIconScale' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, PresenceIconOffset) == 0x000320, "Member 'UWBP_PlayerAvatar_C::PresenceIconOffset' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerAvatar_C, ShowPresenceBg) == 0x000330, "Member 'UWBP_PlayerAvatar_C::ShowPresenceBg' has a wrong offset!");

}

