#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusBar.WBP_StatusBar_C
// 0x00A0 (0x0308 - 0x0268)
class UWBP_StatusBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Content;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Tag_Background;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tag_Image;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Tag_Text;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Background_Color;                                  // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateColor                            Text_Color;                                        // 0x02A0(0x0014)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x02B8(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Image_Texture;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Image_Rotation;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Image_Color;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     Image_Material;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FMargin                                ImagePadding;                                      // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_StatusBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Update_Image(class UTexture2D* Texture, class UMaterialInterface* Material, const struct FLinearColor& Color, double Angle);
	void UpdateColor(const struct FLinearColor& Background_Color_0, const struct FSlateColor& Text_Color_0);
	void UpdateText(const class FText& Text_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusBar_C">();
	}
	static class UWBP_StatusBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusBar_C>();
	}
};
static_assert(alignof(UWBP_StatusBar_C) == 0x000008, "Wrong alignment on UWBP_StatusBar_C");
static_assert(sizeof(UWBP_StatusBar_C) == 0x000308, "Wrong size on UWBP_StatusBar_C");
static_assert(offsetof(UWBP_StatusBar_C, UberGraphFrame) == 0x000268, "Member 'UWBP_StatusBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, HorizontalBox_Content) == 0x000270, "Member 'UWBP_StatusBar_C::HorizontalBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Tag_Background) == 0x000278, "Member 'UWBP_StatusBar_C::Tag_Background' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Tag_Image) == 0x000280, "Member 'UWBP_StatusBar_C::Tag_Image' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Tag_Text) == 0x000288, "Member 'UWBP_StatusBar_C::Tag_Text' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Background_Color) == 0x000290, "Member 'UWBP_StatusBar_C::Background_Color' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Text_Color) == 0x0002A0, "Member 'UWBP_StatusBar_C::Text_Color' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Text) == 0x0002B8, "Member 'UWBP_StatusBar_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Image_Texture) == 0x0002D0, "Member 'UWBP_StatusBar_C::Image_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Image_Rotation) == 0x0002D8, "Member 'UWBP_StatusBar_C::Image_Rotation' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Image_Color) == 0x0002E0, "Member 'UWBP_StatusBar_C::Image_Color' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, Image_Material) == 0x0002F0, "Member 'UWBP_StatusBar_C::Image_Material' has a wrong offset!");
static_assert(offsetof(UWBP_StatusBar_C, ImagePadding) == 0x0002F8, "Member 'UWBP_StatusBar_C::ImagePadding' has a wrong offset!");

}

