#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutTitleButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutTitleButton.WBP_LoadoutTitleButton_C.ExecuteUbergraph_WBP_LoadoutTitleButton
// 0x0078 (0x0078 - 0x0000)
struct WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton) == 0x000008, "Wrong alignment on WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton");
static_assert(sizeof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton) == 0x000078, "Wrong size on WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, EntryPoint) == 0x000000, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, Temp_bool_Variable) == 0x000004, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, Temp_real_Variable) == 0x000008, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, Temp_bool_Variable_1) == 0x000010, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, Temp_struct_Variable) == 0x000018, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, Temp_struct_Variable_1) == 0x000028, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000048, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, CallFunc_IsMobileGame_ReturnValue) == 0x000050, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, K2Node_Select_Default) == 0x000054, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, K2Node_Select_Default_1) == 0x000058, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton, K2Node_MakeStruct_Margin) == 0x000068, "Member 'WBP_LoadoutTitleButton_C_ExecuteUbergraph_WBP_LoadoutTitleButton::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function WBP_LoadoutTitleButton.WBP_LoadoutTitleButton_C.Set Text
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoadoutTitleButton_C_Set_Text final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_LoadoutTitleButton_C_Set_Text) == 0x000008, "Wrong alignment on WBP_LoadoutTitleButton_C_Set_Text");
static_assert(sizeof(WBP_LoadoutTitleButton_C_Set_Text) == 0x000018, "Wrong size on WBP_LoadoutTitleButton_C_Set_Text");
static_assert(offsetof(WBP_LoadoutTitleButton_C_Set_Text, Text) == 0x000000, "Member 'WBP_LoadoutTitleButton_C_Set_Text::Text' has a wrong offset!");

}

