#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augment_CollectionScreenInfoOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerAugmentsUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Augment_CollectionScreenInfoOverlay.WBP_Augment_CollectionScreenInfoOverlay_C
// 0x0090 (0x0520 - 0x0490)
class UWBP_Augment_CollectionScreenInfoOverlay_C final : public UFortPlayerAugmentCollectionScreenInfoOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReloadInfo;                                        // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBG;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBorder;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RadialBloom;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Descriptions;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Locations;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_AllInfos;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Current_location;                                  // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_location;                                    // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocationTrackerColor;                              // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocationTrackerColor_Complete;                     // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectedState                           State;                                             // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LocationRGBA2_Base;                                // 0x04FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LocationRGBA2_Hover;                               // 0x050C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnCollectedStateSet(EFortCollectedState CollectedState);
	void BP_OnLocationsFoundSet(int32 NumFound, int32 NumAvailable, bool bAllFound);
	void ExecuteUbergraph_WBP_Augment_CollectionScreenInfoOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Augment_CollectionScreenInfoOverlay_C">();
	}
	static class UWBP_Augment_CollectionScreenInfoOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Augment_CollectionScreenInfoOverlay_C>();
	}
};
static_assert(alignof(UWBP_Augment_CollectionScreenInfoOverlay_C) == 0x000008, "Wrong alignment on UWBP_Augment_CollectionScreenInfoOverlay_C");
static_assert(sizeof(UWBP_Augment_CollectionScreenInfoOverlay_C) == 0x000520, "Wrong size on UWBP_Augment_CollectionScreenInfoOverlay_C");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, UberGraphFrame) == 0x000490, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, ReloadInfo) == 0x000498, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::ReloadInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, Image_PanelBG) == 0x0004A0, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::Image_PanelBG' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, Image_PanelBorder) == 0x0004A8, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::Image_PanelBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, Image_RadialBloom) == 0x0004B0, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::Image_RadialBloom' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, SizeBox_Descriptions) == 0x0004B8, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::SizeBox_Descriptions' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, Switcher_Locations) == 0x0004C0, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::Switcher_Locations' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, VerticalBox_AllInfos) == 0x0004C8, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::VerticalBox_AllInfos' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, Current_location) == 0x0004D0, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::Current_location' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, Total_location) == 0x0004D4, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::Total_location' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, LocationTrackerColor) == 0x0004D8, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::LocationTrackerColor' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, LocationTrackerColor_Complete) == 0x0004E8, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::LocationTrackerColor_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, State) == 0x0004F8, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::State' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, LocationRGBA2_Base) == 0x0004FC, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::LocationRGBA2_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenInfoOverlay_C, LocationRGBA2_Hover) == 0x00050C, "Member 'UWBP_Augment_CollectionScreenInfoOverlay_C::LocationRGBA2_Hover' has a wrong offset!");

}

