#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augment_CollectionScreenContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerAugmentsUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Augment_CollectionScreenContainer.WBP_Augment_CollectionScreenContainer_C
// 0x0048 (0x0548 - 0x0500)
class UWBP_Augment_CollectionScreenContainer_C final : public UFortPlayerAugmentCollectionScreenContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HBox_Tabs;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGGradient;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SafeZoneBG;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_HitTestable;                               // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_MenuTabs;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_MobileClose;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnShowTabsSet(bool bShowTabs);
	void Construct();
	void ExecuteUbergraph_WBP_Augment_CollectionScreenContainer(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Augment_CollectionScreenContainer_C">();
	}
	static class UWBP_Augment_CollectionScreenContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Augment_CollectionScreenContainer_C>();
	}
};
static_assert(alignof(UWBP_Augment_CollectionScreenContainer_C) == 0x000008, "Wrong alignment on UWBP_Augment_CollectionScreenContainer_C");
static_assert(sizeof(UWBP_Augment_CollectionScreenContainer_C) == 0x000548, "Wrong size on UWBP_Augment_CollectionScreenContainer_C");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, UberGraphFrame) == 0x000500, "Member 'UWBP_Augment_CollectionScreenContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, HBox_Tabs) == 0x000508, "Member 'UWBP_Augment_CollectionScreenContainer_C::HBox_Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, Image_BGGradient) == 0x000510, "Member 'UWBP_Augment_CollectionScreenContainer_C::Image_BGGradient' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, Image_SafeZoneBG) == 0x000518, "Member 'UWBP_Augment_CollectionScreenContainer_C::Image_SafeZoneBG' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, NextTabAction) == 0x000520, "Member 'UWBP_Augment_CollectionScreenContainer_C::NextTabAction' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, Overlay_HitTestable) == 0x000528, "Member 'UWBP_Augment_CollectionScreenContainer_C::Overlay_HitTestable' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, PreviousTabAction) == 0x000530, "Member 'UWBP_Augment_CollectionScreenContainer_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, SafeZone_MenuTabs) == 0x000538, "Member 'UWBP_Augment_CollectionScreenContainer_C::SafeZone_MenuTabs' has a wrong offset!");
static_assert(offsetof(UWBP_Augment_CollectionScreenContainer_C, SafeZone_MobileClose) == 0x000540, "Member 'UWBP_Augment_CollectionScreenContainer_C::SafeZone_MobileClose' has a wrong offset!");

}

