#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Augment_CollectionScreenContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Augment_CollectionScreenContainer.WBP_Augment_CollectionScreenContainer_C.BP_OnShowTabsSet
// 0x0001 (0x0001 - 0x0000)
struct WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet final
{
public:
	bool                                          bShowTabs;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet) == 0x000001, "Wrong alignment on WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet");
static_assert(sizeof(WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet) == 0x000001, "Wrong size on WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet, bShowTabs) == 0x000000, "Member 'WBP_Augment_CollectionScreenContainer_C_BP_OnShowTabsSet::bShowTabs' has a wrong offset!");

// Function WBP_Augment_CollectionScreenContainer.WBP_Augment_CollectionScreenContainer_C.ExecuteUbergraph_WBP_Augment_CollectionScreenContainer
// 0x0130 (0x0130 - 0x0000)
struct WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00C0)()
	bool                                          K2Node_Event_bShowTabs;                            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer) == 0x000010, "Wrong alignment on WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer");
static_assert(sizeof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer) == 0x000130, "Wrong size on WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, EntryPoint) == 0x000000, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, Temp_bool_Variable) == 0x000005, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, Temp_byte_Variable) == 0x000006, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, Temp_bool_Variable_1) == 0x00001C, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, Temp_struct_Variable) == 0x000020, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, Temp_struct_Variable_1) == 0x000030, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, K2Node_Select_Default) == 0x000048, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, K2Node_Event_bShowTabs) == 0x000120, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::K2Node_Event_bShowTabs' has a wrong offset!");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer, K2Node_Select_Default_1) == 0x000121, "Member 'WBP_Augment_CollectionScreenContainer_C_ExecuteUbergraph_WBP_Augment_CollectionScreenContainer::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Augment_CollectionScreenContainer.WBP_Augment_CollectionScreenContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Augment_CollectionScreenContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Augment_CollectionScreenContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Augment_CollectionScreenContainer_C_PreConstruct");
static_assert(sizeof(WBP_Augment_CollectionScreenContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_Augment_CollectionScreenContainer_C_PreConstruct");
static_assert(offsetof(WBP_Augment_CollectionScreenContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Augment_CollectionScreenContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

