#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ButtonBackground_CTA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Block_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ButtonBackground_CTA.WBP_UIKit_ButtonBackground_CTA_C
// 0x0070 (0x0318 - 0x02A8)
class UWBP_UIKit_ButtonBackground_CTA_C final : public UWBP_UIKit_Block_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Outline_Glow;                                 // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Outline;                                      // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusOutline;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusOutline_Glow;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Root;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          AdditiveBorder;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BackgroundDynamicMaterial;                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_ButtonBackground_CTA(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundMaterial(class UMaterialInstance*& Brush);
	void SetBorderMaterial(class UMaterialInstance* Border_Material, bool IsAdditive);
	void SetDisabled();
	void SetEnabled();
	void TransitionDisabled(class UWidgetAnimation* AnimTransition);
	void TransitionEnabled(class UWidgetAnimation* AnimTransition);
	void TransitionFocused(class UWidgetAnimation* AnimTransition);
	void TransitionPressed(class UWidgetAnimation* AnimTransition);
	void TransitionReleased(class UWidgetAnimation* AnimTransition);
	void TransitionUnfocused(class UWidgetAnimation* AnimTransition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ButtonBackground_CTA_C">();
	}
	static class UWBP_UIKit_ButtonBackground_CTA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ButtonBackground_CTA_C>();
	}
};
static_assert(alignof(UWBP_UIKit_ButtonBackground_CTA_C) == 0x000008, "Wrong alignment on UWBP_UIKit_ButtonBackground_CTA_C");
static_assert(sizeof(UWBP_UIKit_ButtonBackground_CTA_C) == 0x000318, "Wrong size on UWBP_UIKit_ButtonBackground_CTA_C");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Anim_Outline_Glow) == 0x0002B0, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Anim_Outline_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Anim_Outline) == 0x0002B8, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Anim_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Anim_Disabled_Transition) == 0x0002C0, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Anim_Disabled_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Anim_Pressed_Transition) == 0x0002C8, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Anim_Pressed_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Anim_Focused_Transition) == 0x0002D0, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Anim_Focused_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Backing) == 0x0002D8, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Backing' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, FocusOutline) == 0x0002E0, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::FocusOutline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, FocusOutline_Glow) == 0x0002E8, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::FocusOutline_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Glow) == 0x0002F0, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Glow' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, Root) == 0x0002F8, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, BackgroundMaterial) == 0x000300, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::BackgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, AdditiveBorder) == 0x000308, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::AdditiveBorder' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_ButtonBackground_CTA_C, BackgroundDynamicMaterial) == 0x000310, "Member 'UWBP_UIKit_ButtonBackground_CTA_C::BackgroundDynamicMaterial' has a wrong offset!");

}

