#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExpressYourSupportFavoriteButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ExpressYourSupportFavoriteButton.WBP_ExpressYourSupportFavoriteButton_C
// 0x0070 (0x14D0 - 0x1460)
class UWBP_ExpressYourSupportFavoriteButton_C final : public UFortExpressYourSupportFavoriteButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnhoveredToggleOff;                                // 0x1468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoveredToggleOn;                                 // 0x1470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoverToggledOff;                                 // 0x1478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggledOff;                                   // 0x1480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoverToggledOn;                                  // 0x1488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggledOn;                                    // 0x1490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredToggleOff;                                  // 0x1498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoveredToggleOn;                                   // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x14A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FavoriteIcon;                                // 0x14B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pulse;                                       // 0x14B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x14C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_ExpressYourSupportFavoriteButton(int32 EntryPoint);
	void SetButtonHeight(bool IsTouch);
	void StopHoveringAnimations();
	void StopTogglingAnimations();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ExpressYourSupportFavoriteButton_C">();
	}
	static class UWBP_ExpressYourSupportFavoriteButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExpressYourSupportFavoriteButton_C>();
	}
};
static_assert(alignof(UWBP_ExpressYourSupportFavoriteButton_C) == 0x000010, "Wrong alignment on UWBP_ExpressYourSupportFavoriteButton_C");
static_assert(sizeof(UWBP_ExpressYourSupportFavoriteButton_C) == 0x0014D0, "Wrong size on UWBP_ExpressYourSupportFavoriteButton_C");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, UberGraphFrame) == 0x001460, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, UnhoveredToggleOff) == 0x001468, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::UnhoveredToggleOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, UnhoveredToggleOn) == 0x001470, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::UnhoveredToggleOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, UnhoverToggledOff) == 0x001478, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::UnhoverToggledOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, HoverToggledOff) == 0x001480, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::HoverToggledOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, UnhoverToggledOn) == 0x001488, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::UnhoverToggledOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, HoverToggledOn) == 0x001490, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::HoverToggledOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, HoveredToggleOff) == 0x001498, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::HoveredToggleOff' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, HoveredToggleOn) == 0x0014A0, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::HoveredToggleOn' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, Border_Background) == 0x0014A8, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, Image_FavoriteIcon) == 0x0014B0, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::Image_FavoriteIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, Image_Pulse) == 0x0014B8, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::Image_Pulse' has a wrong offset!");
static_assert(offsetof(UWBP_ExpressYourSupportFavoriteButton_C, SizeBox_0) == 0x0014C0, "Member 'UWBP_ExpressYourSupportFavoriteButton_C::SizeBox_0' has a wrong offset!");

}

