#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallySelectionHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallySelectionHeader.WBP_RebootRallySelectionHeader_C
// 0x0040 (0x1430 - 0x13F0)
class UWBP_RebootRallySelectionHeader_C final : public URebootRallySelectionHeaderBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhovered;                                         // 0x13F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x1400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x1408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x1410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LinearFade;                                  // 0x1418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RebootRallyLogo;                             // 0x1420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rewards;                                     // 0x1428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_RebootRallySelectionHeader(int32 EntryPoint);
	void Finished_83AA4B0145343A56061784AA887827D3();
	void InputMethodChanged(ECommonInputType bNewInputType);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallySelectionHeader_C">();
	}
	static class UWBP_RebootRallySelectionHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallySelectionHeader_C>();
	}
};
static_assert(alignof(UWBP_RebootRallySelectionHeader_C) == 0x000010, "Wrong alignment on UWBP_RebootRallySelectionHeader_C");
static_assert(sizeof(UWBP_RebootRallySelectionHeader_C) == 0x001430, "Wrong size on UWBP_RebootRallySelectionHeader_C");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, UberGraphFrame) == 0x0013F0, "Member 'UWBP_RebootRallySelectionHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Unhovered) == 0x0013F8, "Member 'UWBP_RebootRallySelectionHeader_C::Unhovered' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Hovered) == 0x001400, "Member 'UWBP_RebootRallySelectionHeader_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Default) == 0x001408, "Member 'UWBP_RebootRallySelectionHeader_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, CommonActionWidget) == 0x001410, "Member 'UWBP_RebootRallySelectionHeader_C::CommonActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Image_LinearFade) == 0x001418, "Member 'UWBP_RebootRallySelectionHeader_C::Image_LinearFade' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Image_RebootRallyLogo) == 0x001420, "Member 'UWBP_RebootRallySelectionHeader_C::Image_RebootRallyLogo' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallySelectionHeader_C, Image_Rewards) == 0x001428, "Member 'UWBP_RebootRallySelectionHeader_C::Image_Rewards' has a wrong offset!");

}

