#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContentPurchaseBlocker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ContentPurchaseBlocker.WBP_ContentPurchaseBlocker_C
// 0x0070 (0x02D8 - 0x0268)
class UWBP_ContentPurchaseBlocker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Mobile;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Loud_C*               WBP_UIKit_Button_Loud;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_Details;                                      // 0x0290(0x0018)(Edit, BlueprintVisible)
	int32                                         Max_Width;                                         // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ParentalControlsScreenClass;                       // 0x02B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetVisuals(int32 MaxWidth);
	void Set_Data(const class FText& InText);
	void PreConstruct(bool IsDesignTime);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void Construct();
	void OnComplete_EDE27478404080C54EDC0D863BB58408(class UUserWidget* UserWidget);
	void BndEvt__WBP_ContentPurchaseBlocker_WBP_UIKit_Button_Loud_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_ContentPurchaseBlocker(int32 EntryPoint);
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ContentPurchaseBlocker_C">();
	}
	static class UWBP_ContentPurchaseBlocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ContentPurchaseBlocker_C>();
	}
};
static_assert(alignof(UWBP_ContentPurchaseBlocker_C) == 0x000008, "Wrong alignment on UWBP_ContentPurchaseBlocker_C");
static_assert(sizeof(UWBP_ContentPurchaseBlocker_C) == 0x0002D8, "Wrong size on UWBP_ContentPurchaseBlocker_C");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, UberGraphFrame) == 0x000268, "Member 'UWBP_ContentPurchaseBlocker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, SizeBox_Mobile) == 0x000270, "Member 'UWBP_ContentPurchaseBlocker_C::SizeBox_Mobile' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Text_Description) == 0x000278, "Member 'UWBP_ContentPurchaseBlocker_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Text_Title) == 0x000280, "Member 'UWBP_ContentPurchaseBlocker_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, WBP_UIKit_Button_Loud) == 0x000288, "Member 'UWBP_ContentPurchaseBlocker_C::WBP_UIKit_Button_Loud' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Text_Details) == 0x000290, "Member 'UWBP_ContentPurchaseBlocker_C::Text_Details' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, Max_Width) == 0x0002A8, "Member 'UWBP_ContentPurchaseBlocker_C::Max_Width' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPurchaseBlocker_C, ParentalControlsScreenClass) == 0x0002B0, "Member 'UWBP_ContentPurchaseBlocker_C::ParentalControlsScreenClass' has a wrong offset!");

}

