#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RebootRallyPopupModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RebootRallyPopupModal.WBP_RebootRallyPopupModal_C
// 0x0058 (0x0420 - 0x03C8)
class UWBP_RebootRallyPopupModal_C final : public URebootRallyQRModalWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_RebootRallyPopupModal_Background_C* WBP_RebootRallyPopupModal_Background;              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRallyPopupModal_DetailsText_C* WBP_RebootRallyPopupModal_DetailsText;             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRallyPopupModal_HeaderText_C* WBP_RebootRallyPopupModal_HeaderText;              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RebootRallyPopupModal_Image_C*     WBP_RebootRallyPopupModal_Image;                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DetailsTextNewPlayer;                              // 0x03F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DetailsTextOldPlayer;                              // 0x0408(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RebootRallyPopupModal(int32 EntryPoint);
	void OnFailure_64C14A3847EFAA993FB47C990CFD9E3D();
	void OnIgnored_64C14A3847EFAA993FB47C990CFD9E3D();
	void OnSetIsInvite(bool bIsInvited);
	void OnSuccess_64C14A3847EFAA993FB47C990CFD9E3D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RebootRallyPopupModal_C">();
	}
	static class UWBP_RebootRallyPopupModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RebootRallyPopupModal_C>();
	}
};
static_assert(alignof(UWBP_RebootRallyPopupModal_C) == 0x000008, "Wrong alignment on UWBP_RebootRallyPopupModal_C");
static_assert(sizeof(UWBP_RebootRallyPopupModal_C) == 0x000420, "Wrong size on UWBP_RebootRallyPopupModal_C");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, UberGraphFrame) == 0x0003C8, "Member 'UWBP_RebootRallyPopupModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, WBP_RebootRallyPopupModal_Background) == 0x0003D0, "Member 'UWBP_RebootRallyPopupModal_C::WBP_RebootRallyPopupModal_Background' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, WBP_RebootRallyPopupModal_DetailsText) == 0x0003D8, "Member 'UWBP_RebootRallyPopupModal_C::WBP_RebootRallyPopupModal_DetailsText' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, WBP_RebootRallyPopupModal_HeaderText) == 0x0003E0, "Member 'UWBP_RebootRallyPopupModal_C::WBP_RebootRallyPopupModal_HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, WBP_RebootRallyPopupModal_Image) == 0x0003E8, "Member 'UWBP_RebootRallyPopupModal_C::WBP_RebootRallyPopupModal_Image' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, DetailsTextNewPlayer) == 0x0003F0, "Member 'UWBP_RebootRallyPopupModal_C::DetailsTextNewPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_RebootRallyPopupModal_C, DetailsTextOldPlayer) == 0x000408, "Member 'UWBP_RebootRallyPopupModal_C::DetailsTextOldPlayer' has a wrong offset!");

}

