#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: windowchromebuttons

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function windowchromebuttons.windowchromebuttons_C.ExecuteUbergraph_windowchromebuttons
// 0x0188 (0x0188 - 0x0000)
struct windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0098)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0098)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons) == 0x000008, "Wrong alignment on windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons");
static_assert(sizeof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons) == 0x000188, "Wrong size on windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons");
static_assert(offsetof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons, EntryPoint) == 0x000000, "Member 'windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons::EntryPoint' has a wrong offset!");
static_assert(offsetof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons, K2Node_Event_MyGeometry) == 0x000010, "Member 'windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons, CallFunc_PlayAnimation_ReturnValue_1) == 0x000180, "Member 'windowchromebuttons_C_ExecuteUbergraph_windowchromebuttons::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function windowchromebuttons.windowchromebuttons_C.OnMouseEnter
// 0x00D8 (0x00D8 - 0x0000)
struct windowchromebuttons_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(windowchromebuttons_C_OnMouseEnter) == 0x000008, "Wrong alignment on windowchromebuttons_C_OnMouseEnter");
static_assert(sizeof(windowchromebuttons_C_OnMouseEnter) == 0x0000D8, "Wrong size on windowchromebuttons_C_OnMouseEnter");
static_assert(offsetof(windowchromebuttons_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'windowchromebuttons_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(windowchromebuttons_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'windowchromebuttons_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function windowchromebuttons.windowchromebuttons_C.OnMouseLeave
// 0x0098 (0x0098 - 0x0000)
struct windowchromebuttons_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(windowchromebuttons_C_OnMouseLeave) == 0x000008, "Wrong alignment on windowchromebuttons_C_OnMouseLeave");
static_assert(sizeof(windowchromebuttons_C_OnMouseLeave) == 0x000098, "Wrong size on windowchromebuttons_C_OnMouseLeave");
static_assert(offsetof(windowchromebuttons_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'windowchromebuttons_C_OnMouseLeave::MouseEvent' has a wrong offset!");

}

