#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WolfRidingPlayerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0227 (0x0228 - 0x0001)
struct WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1434;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1435;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1436;                               // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_1437;                               // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1438;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1439;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1440;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1441;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1442;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1443;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1444;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1445;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1446;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1447;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1448;                               // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1449;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1450;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1451;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1452;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1453;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1454;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1455;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1456;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1457;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1458;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1459;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1460;                               // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1461;                              // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	EBlendListTransitionType                      __EnumProperty_1462;                               // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1463;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1464;                               // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1465;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1466;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1467;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1468;                              // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1469;                              // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               __EnumProperty_1470;                               // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1471;                               // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1472;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1473;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1474;                                 // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1475;                               // 0x00F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1476;                               // 0x00F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1477;                              // 0x00F8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1478;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_1479;                             // 0x010C(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1480;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1481;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_1482;                               // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1483;                               // 0x0144(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1484;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1485;                               // 0x014C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1486;                              // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1487;                              // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1488;                               // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1489;                               // 0x0159(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1490;                               // 0x015A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1491;                               // 0x015C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1492;                               // 0x0160(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1493;                               // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1494;                               // 0x0168(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1495;                             // 0x0170(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1496;                               // 0x0188(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1497;                               // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0190(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0210(0x0018)()
};
static_assert(alignof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000228, "Wrong size on WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1434) == 0x000004, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1434' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1435) == 0x000008, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1435' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1436) == 0x000010, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1436' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1437) == 0x000018, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1437' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1438) == 0x00001C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1438' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1439) == 0x000020, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1439' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1440) == 0x000024, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1440' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1441) == 0x000028, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1441' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1442) == 0x00002C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1442' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1443) == 0x000030, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1443' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1444) == 0x000034, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1444' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1445) == 0x000038, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1445' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1446) == 0x00003C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1446' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1447) == 0x000040, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1447' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1448) == 0x000044, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1448' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1449) == 0x000048, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1449' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1450) == 0x00004C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1450' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1451) == 0x000050, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1451' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1452) == 0x000054, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1452' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1453) == 0x000058, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1453' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1454) == 0x00005C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1454' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1455) == 0x000060, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1455' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1456) == 0x000064, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1456' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1457) == 0x000068, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1457' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1458) == 0x00006C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1458' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1459) == 0x000070, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1459' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1460) == 0x000074, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1460' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1461) == 0x000078, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1461' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1462) == 0x000088, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1462' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1463) == 0x000090, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1463' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1464) == 0x0000A0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1464' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1465) == 0x0000A4, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1465' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1466) == 0x0000A8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1466' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1467) == 0x0000AC, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1467' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1468) == 0x0000B0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1468' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1469) == 0x0000C0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1469' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1470) == 0x0000D0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1470' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1471) == 0x0000D4, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1471' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1472) == 0x0000D8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1472' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_1473) == 0x0000E0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_1473' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_1474) == 0x0000E8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_1474' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1475) == 0x0000F0, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1475' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1476) == 0x0000F1, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1476' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1477) == 0x0000F8, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1477' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1478) == 0x000108, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1478' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1479) == 0x00010C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1479' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1480) == 0x000138, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1480' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1481) == 0x00013C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1481' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1482) == 0x000140, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1482' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1483) == 0x000144, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1483' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_1484) == 0x000148, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_1484' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1485) == 0x00014C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1485' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1486) == 0x000150, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1486' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_1487) == 0x000154, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_1487' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_1488) == 0x000158, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_1488' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_1489) == 0x000159, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_1489' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_1490) == 0x00015A, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_1490' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1491) == 0x00015C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1491' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1492) == 0x000160, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1492' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1493) == 0x000164, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1493' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1494) == 0x000168, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1494' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_1495) == 0x000170, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_1495' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1496) == 0x000188, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1496' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_1497) == 0x00018C, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_1497' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000190, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000210, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct WolfRidingPlayerLayerAnimBP.WolfRidingPlayerLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00A7 (0x00A8 - 0x0001)
struct WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1;                                 // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_2;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x002E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_16;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_24;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_26;                                 // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0076(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_29;                                 // 0x0077(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_30;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_31;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_32;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_33;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_37;                                 // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_38;                                 // 0x0095(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_39;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_40;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_41;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_42;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000A8, "Wrong size on WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'WolfRidingPlayerLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
